[ { projectCode: 'TG-AST030031N',
    cores: 16,
    pi: 'William Dorland',
    fos: 'Astronomical Sciences (AST)',
    inst: 'University of Maryland, College Park',
    abstract: 'This proposal is for the extension of our numerical investigations of the turbulent magnetic fields in astrophysical plasmas. We are interested in the turbulent mechanisms for the generation and maintenance of fluctuating magnetic fields in stars, galaxies and clusters. \nThe physical objective is a detailed understanding of fully developed MHD turbulence both with and without an imposed mean field. In this Renewal Proposal for 2007-08, we ask for a continuation of our allocation to study the magnetic-field generation in systems  with linear shear, the anisotropic Alfven-wave turbulence in the presence of a strong mean field, and the magnetic fluctuations in a model of inhomogeneously interstellar medium. \nThe first two projects are of fundamental importance and have many astrophysical applications: accretion flows, galactic fields, turbulence in the solar wind and the inter-stellar medium. The third project addresses a number of recent observational results on the differences between the magnetic-field structure in the galactic spiral arms and in the interarm regions as well as the fundamental problem of turbulent paramagnetism. \n' },
  { projectCode: 'PCSE-2015',
    cores: 16,
    pi: 'Victor Eijkhout',
    fos: 'COMPUTER AND INFORMATION SCIENCE AND ENGINEERING (CISE)',
    inst: 'University of Texas at Austin',
    abstract: 'This project will service the lab exercises, homework, and projects for the Parallel Computing for Science and Engineering class, taught by Victor Eijkhout and Cyrus Proctor.' },
  { projectCode: 'TG-BCS130009',
    cores: 112,
    pi: 'celso m ferreira',
    fos: 'Natural and Man-Made Hazard Migration',
    inst: 'George Mason University',
    abstract: 'Hurricanes are one of the most costly natural disasters impacting the US coastal areas and the State of Virginia has historically faced severe impacts from these storms (e.g., Isabel [2003] and Sandy [2012]). Although coastal areas are predominantly at risk from storm surge flooding, areas along the Chesapeake Bay and its tributaries are also extremely vulnerable to hurricane flooding. It is believed that coastal wetlands, besides its ecological importance, might help to reduce the impact of storm surge, acting as a natural protection against hurricane flooding, especially for small hurricanes and tropical storms. Here, we propose to develop a novel framework integrating high performance computing of hurricane storm surge flooding, hydrodynamics characterization of flow through natural wetlands ecosystems and critical infrastructure inventory to investigate the potential of wetlands to reduce hurricane flooding, improving our basic understanding of natural hazards and our capability to expand the State resilience to such events. To improve our fundamental knowledge of tide and storm surge hydrodynamics in wetlands ecosystems, four study sites in the eastern shore will be equipped with sensors to thoroughly monitor water levels within wetlands ecosystems and field survey will be performed in these sites to measure vegetation structural characteristics contributing to flow resistance (i.e. height, diameter and stem density). The field campaigns information will support the development and calibration of computational models to simulate storm surge flow over wetlands specifically designed to represent Virginias aquatic vegetation. A multi-model, multi-scale, multi-resolution approach will be developed to integrate High Performance Computing (HPC) of large scale and high resolution hurricane storm surge modeling and small scale high fidelity models to evaluate the benefits of wetlands ecosystems to reduce storm surge and related damage to critical infrastructure quantified using geospatial analyses. Quantifying these benefits will provide sound scientific information to support planning and decision making. ' },
  { projectCode: 'TG-PHY140059',
    cores: 16,
    pi: 'Charles R Evans',
    fos: 'Gravitational Physics',
    inst: 'University of North Carolina, Chapel Hill',
    abstract: 'Gravitational wave observatories may soon detect signals from merging black hole binary systems.  Simulations of binary mergers may aid detection efforts and will be used to determine physical parameters of observed events.  Binary black hole simulations are frequently computed using the Einstein Toolkit package, a powerful computational infrastructure that handles AMR, boundary conditions, cluster communication, etc.  Unfortunately, the routines that supply initial conditions for black hole binaries in the Einstein Toolkit introduce gravitational wave transients that limit the spin of each black hole and make it difficult to give initial black holes significant momentum.  We are developing a new procedure for constructing black hole initial data, which will open up previously inaccessable regions of parameter \nspace for black hole simulations using the Einstein Toolkit.  Our code development has so far used local campus clusters.  To proceed further, an XSEDE allocation will be necessary.  The Einstein Toolkit is known to run successfully on XSEDE resources.  We will test our modified version of the black hole simulation code in advance of submitting a full research allocation request.' },
  { projectCode: 'TG-ATM100026',
    cores: 16,
    pi: 'Meers Oppenheim',
    fos: 'Aeronomy',
    inst: 'Boston University',
    abstract: 'Every day billions of particles impact the Earth\'s upper atmosphere with sufficient energy to create high-density plasma trails in the E-region ionosphere.  For the last 50 years, optics and radars have characterized these meteor plasmas in order to infer properties of the meteoroids that created them (speed, direction of origin, size) and the atmosphere (winds and temperatures) through which they travel. In the last decade, the aeronomy research community has made dramatic\nimprovements in understanding the observational characteristics of radar meteors and their underlying physics.  This has led to great progress in measuring both meteoroids and atmospheric dynamics.  The PI has made enough progress in this area that he has obtained consistent NSF support for this research for a over a decade. This XSEDE project will further develop this field by performing the first fully 3-D kinetic simulations of meteor plasma evolution.  Starting with a model of meteor plasma production the simulator will emulate the evolution of the magnetized, collisional meteor plasma as it drives currents through the ionosphere, expands and, eventually, diffuses away.  This will provide insight into the numerous observations of meteors, predominantly with radars.  This research will require a series of medium runs followed by a smaller number of large ones.  The largest runs should be able to mimic the physics of small meteors with only minimal effects of the boundary conditions.\n\n' },
  { projectCode: 'TG-DMR110090',
    cores: 96,
    pi: 'Chengping Wu',
    fos: 'Materials Research (DMR)',
    inst: 'University of Virginia',
    abstract: 'n/a' },
  { projectCode: 'TG-DMR120073',
    cores: 16,
    pi: 'Efthimios Kaxiras',
    fos: 'Materials Research (DMR)',
    inst: 'Harvard University',
    abstract: 'Our group studies the physical and chemical properties and interface phenomena\nof nanoscale materials for photovoltaic and energy storage devices.\nSimulation, using techniques such as finite element analysis and molecular\ndynamics, forms a major part of our research program and allows us to\ninvestigate new, multi-purpose materials, composites, and fabrication\ntechniques \\textit{in silico}.  Our current focus is topological insulators,\nlayered composite systems (e.g. graphene, dichalcogenides, boron nitride),\nsilicon nanostructures, organic semiconductor devices (e.g. pentance, rubrene,\nporphyrin, phthalocyanene) and point defects and impurities on semiconductor\nand metallic surfaces.  In addition to using pre-existing codes, we develop\ncodes for first-principles simulation which provide a balance between accuracy and\nefficiency.\n\nTo advance our current research program we request an allocation of 10M SUs,\nsplit across four distinct projects.  Initial performance and scaling tests at\nTACC, NCSA, and PSC have established the value of XSEDE resources for this\nwork, and allowed us to predict our computational requirements for the next\nphase of our research, which far exceeds the capacity available from local\nresources.\n' },
  { projectCode: 'TG-MCB140242',
    cores: 16,
    pi: 'Margaret E Johnson',
    fos: 'Biophysics',
    inst: 'Johns Hopkins University',
    abstract: 'We have two major projects that will require large computational resources. In one project we are identifying the mechanisms by which multiple proteins assemble into a protein coat at the cell membrane. By running detailed reactiondiffusion simulations of invitro systems at multiple concentrations we will be able to validate our model against experimental data and answer several key questions about the temporal order and the degree of cooperativity active in the protein assembly process. In the second project we are investigating how the evolution of specific and functional proteinprotein interactions influences the topology of protein networks and the expression levels of proteins in the cell. Using a coarsegrained model of protein binding we will run MonteCarlo simulations to quantify the effects of network topology and protein concentration on the efficiency and specificity of protein interactions in the cell.\nSoftware we use is our own c/c++ code, that runs on any platform including Linux, and some of which uses MPI. We will potentially use molecular dynamics (MD) software packages such as NAMD. For the first project, the simulations are currently embarrassingly parallel, the typical job length is about a week.For the second projects, simulations are usually run on 1664 cores and depending on the system size take between 1 and 5 days. Individual jobs can produce ~ 5GB of data over a week. The accumulated active data can be kept to about 300400GB.' },
  { projectCode: 'Proteins-and-DNA-sol',
    cores: 16,
    pi: 'B MONTGOMERY PETTITT',
    fos: 'Biophysics',
    inst: 'University of Texas Medical Branch',
    abstract: 'We will use computational techniques and theories to investigate the following biophysical problems: (1) the backbone versus side-chain influence in protein folding (2) understanding the mechanism for protein-DNA interactions and the influences of specific amino acid side-chains on the binding (3) expand our coarse-grain models to investigate the configurations of DNA in capsids and minicircles. The distribution of configurations will be compared to Cryo-Electron Microscopy reconstructions (4) expand our proximal Radial Distribution Function methodology to nucleic acids and protein interfaces.' },
  { projectCode: 'TG-MCB130084',
    cores: 48,
    pi: 'Axel Muller',
    fos: 'Biophysics',
    inst: 'California Institute of Technology',
    abstract: 'n/a' },
  { projectCode: 'TG-CHE140047',
    cores: 128,
    pi: 'Ian Harrison',
    fos: 'Physical Chemistry',
    inst: 'University of Virginia',
    abstract: 'n/a' },
  { projectCode: 'Electromagnetic-Anal',
    cores: 16,
    pi: 'Ali Yilmaz',
    fos: 'Communications and Computational Systems',
    inst: 'Institute for Computational Engineering and Science',
    abstract: 'Electromagnetic Analysis of Electronic Packages\n\nElectronic packages continue to pose challenges that are not met by current simulation tools. Advanced electromagnetic simulators are needed to characterize, analyze, design, and optimize full-scale packages. The goal of this project is to enable predictive and fast full-wave simulation of full-scale packages by exploiting the latest developments in computational electromagnetics. Specifically, the PI will (i) formulate layered-medium Green functions and generalized conductor loss models for packages to simplify modeling/meshing, to increase accuracy, and to reduce number of unknowns, (ii) develop FFT-accelerated iterative and direct integral-equation algorithms to reduce computational costs, (iii) devise parallel workload distribution methods to increase parallel efficiency and scalability of the methods, and (iv) deploy the resulting software and investigate its performance on massively parallel clusters of multi-core processors and many-integrated-core coprocessors on Lonestar and Stampede.\nThe requested SUs will be used for (i) code validation by solving reference problems, (ii) parallel scalability tests, and (iii) medium-scale simulations. It is expected that the results of these investigation will significantly extend our ability to quantify the elecrtical performance of electronic packages.' },
  { projectCode: 'TG-MCB120175',
    cores: 144,
    pi: 'Valerie Daggett',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of Washington',
    abstract: 'BIOEN 588 Computational Protein Design\nStarting and ending date: 9/25/2013 - 12/13/2013\n\nThe computational protein design course covers current methods in protein engineering with an emphasis on biomedical and biotechnological applications. Topics include molecular visualization, homology modeling, molecular dynamics, and computational protein design. Students will learn how to use these tools through lectures and lab time and will apply them to investigate a problem of their choosing during the second half of the quarter. The course will also introduce students to current research in these areas.\n\nCurrently, we have at least 17 students (including graduates and undergraduates) registered for this course. We request 100000 SU from Stampede to train students to use homology modeling and molecular dynamics simulation softwares. Using computational tools, students will complete their final protein design project. This amount of allocation is essential to provide a good learning experience for the students.' },
  { projectCode: 'EE382N-20',
    cores: 16,
    pi: 'Mattan Erez',
    fos: 'Computer Systems Architecture',
    inst: 'Department of Electrical and Computer Engineering',
    abstract: 'The "Computer Architecture: Parallelism and Locality" course addresses issues that are fundamental to computer architecture and software/algorithm development. The course is architecture-centric and currently focuses, for the most part, on massively-parallel processors, including GPUs and the Xeon Phy. As part of the course, students engage in software labs and projects to better grasp the tradeoffs and differences between different architectural choices. For the most part, development is single-node with an accelerator, but multi-node techniques will also be discussed.' },
  { projectCode: 'TG-CTS130005',
    cores: 4160,
    pi: 'Eric Johnsen',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Michigan',
    abstract: 'The Rayleigh-Taylor instability (RTI), a process by which the misalignment of the pressure and the density gradient at unstably stratified interfaces generates baroclinic vorticity, can transition a laminar flow field to a fully mixed turbulent field. The RTI occurs in a wide variety of atmospheric, oceanic, geophysical and astrophysical flows and, despite recent progress made through numerical simulations, remains poorly understood, e.g., the late-time turbulent multi-material mixing behavior for multimode initial conditions. The key difficulty is that the long transient of this initially laminar flow, i.e., turbulence is achieved only at late times. Furthermore, many numerical methods are based on the concept of implicit large-eddy simulation, where large scales are resolved but the small-scale dynamics are modeled purely using the numerical dissipation. Although successful in representing the large-scale behavior, it is far from clear that the energy dissipation and mixing processes at the small scales are accurately represented.\n\nThe objective of the proposed research is to investigate the late-time turbulence and mixing in the Rayleigh-Taylor instability, with relevance to astrophysics. To achieve this objective, we propose to conduct direct numerical simulation (DNS) using non-dissipative methods, such that all the physics are resolved on the computational grid, and that the numerics no longer affect the solution. This will be achieved with a high-order accurate minimally dissipative kinetic-energy preserving and interface capturing scheme will be used. For this purpose, we request 2.5M SUs to perform a series of RTI simulations as detailed in the proposal. The XSEDE allocation will allow us to perform simulations at sufficiently high Reynolds numbers that the mixing transition is achieved. Our three-dimensional code uses the message-passing interface (MPI) for parallelization and HDF5 library for parallel I/O. High efficiency has been obtained for weak and strong scaling analysis conducted on Ranger and Lonestar up to 2048 cores.\n\nThe present hypothesis is that, by perturbing the interface using an existing turbulent velocity field to mimic multimode initialization, evolution to turbulence and higher Reynolds numbers can be achieved more rapidly. By solving the full compressible Navier-Stokes equations, we will quantify isotropy and intermittency of the decaying turbulence (i) first without gravity, (ii) then with a gravitational field. In the latter, we will make the region of initial turbulence larger to determine how turbulence ahead of the mixing region influences the instability growth. Through resolved calculations, we will be able to determine the mechanisms that govern the mixing.  We expect that the results will depend on a ratio of time scale describing the turbulence decay to that of the Rayleigh-Taylor instability.  Preliminary low-resolution results using our start-up allocation shows that, surprisingly, the initial growth rates of bubble and spikes decrease in the presence of an isotropic velocity field in front of them.\n' },
  { projectCode: 'A-cm10',
    cores: 16,
    pi: 'Edward Marcotte',
    fos: 'BIOLOGICAL SCIENCES (BIO)',
    inst: 'University of Texas at Austin',
    abstract: 'Bottom-up tandem protein mass spectrometry is one of the most widely used high-throughput methods in proteomics, which focuses on measuring the expression of every protein in a cell.  We are developing a number of computational algorithms that allow us to more accurately and efficiently interpret proteomics mass spectrometry data.' },
  { projectCode: 'TG-MCB120014',
    cores: 16,
    pi: 'Jeetain Mittal',
    fos: 'Biophysics',
    inst: 'Lehigh University',
    abstract: 'n/a' },
  { projectCode: 'Propulsors',
    cores: 16,
    pi: 'Spyridon Kinnas',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'Offshore Technology Research Center',
    abstract: 'Computational hydrodynamics for propulor design' },
  { projectCode: 'TG-EAR080022N',
    cores: 288,
    pi: 'Louise Kellogg',
    fos: 'Earth Sciences (EAR)',
    inst: 'University of California, Davis',
    abstract: 'The Computational Infrastructure for Geodynamics (CIG), an NSF center, develops and maintains open-source geodynamics software in support of the NSF-supported Earth science community. The goal of CIGs efforts is to provide software that will help researchers and students address important unsolved problems in geophysics, including problems in mantle dynamics, crustal and lithospheric dynamics on both million-year and earthquake time-scales, and seismic wave propagation. CIG engaged in these activities under an MRAC and requested to upgrade to an LRAC in January 2008, as the positive response from the community has been consuming its present TeraGrid allocation at a substantially higher rate than anticipated. This proposal justification will answer questions and address issues raised by the LRAC Review Board. In the previously submitted LRAC application, CIG proposed to continue to promote four geodynamics codes through operation and further development of its science gateway and by pre-installing more codes in TeraGrids Community Software Area. The Seismology Science Gateway, already deployed, features SPECFEM3D_GLOBE, a spectral-element code that simulates global and regional (continental-scale) seismic wave propagation; SPECFEM3D, which simulates southern California seismic wave propagation, is a planned future addition. Three CIG finite-element codes (CitcomS, Gale, and PyLith) are all state-of-the art and scale well on a variety of TeraGrid platforms. Using a powerful, yet simplified interface that will run and benchmark these applications via a web browser, we hope to increase the ability of the Earth Sciences community to access TeraGrid resources. A benchmarking tool, the CIG Model Analyzer (Cigma), will also be offered as a web service. An allocation is requested for four activities: (1) operation and continued development of the science gateway, (2) benchmarking, (3) workshops and training sessions, and (4) nurturing new users on the TeraGrid using CIG software.' },
  { projectCode: 'TG-CHE140044',
    cores: 320,
    pi: 'Pablo Debenedetti',
    fos: 'Physical Chemistry',
    inst: 'Princeton University',
    abstract: 'n/a' },
  { projectCode: 'TG-PHY140055',
    cores: 64,
    pi: 'duck young kim',
    fos: 'Physics (PHY)',
    inst: 'Carnegie Institution of Washington',
    abstract: 'Computationally we use pressure to investigate the physical and chemical properties of new and existing energy materials, and to understand the origins of material phenomena. Basic research on materials at the extremes of pressure deepens our understanding of materials behaviors. This enables the elucidation of the fundamentals of chemical interaction at the atomic and electronic levels, and provides access to novel functional materials not otherwise accessible. In many cases, this insight can be applied at ambient conditions as well as extremes to guide new synthetic efforts.\nCrystal structure prediction using quantum mechanical description has grown rapidly in recent years and now it can be used to uncover structures of solids, point defects, surfaces, and clusters. It has become very powerful to search the most stable structure of a large assembly of atoms by minimizing a common order parameter, enthalpy. In general, we can define any order parameter to be searched for all the possible atomic configurations. In this project, we propose to predict novel materials, which optimize our defined order parameters such as entropy, superconductivity, topological insulator, as well as enthalpy. This search strategy can predict novel functional materials such as unprecedented hydrogen-dense hydrides, new form of silicon (photovoltaic applications), low dimensional carbon materials (beyond graphene), new topological insulators, and transparent amorphous oxides.  \nRecently, our predictions have guided experimental synthesis and we have reported several novel compounds stabilized at ambient condition such as Mg2C, Mg2C3, NaSi6, and Si24, which thus can lead us to find novel functional materials to solve energy challenge [see publications of PI]. Especially, we found a new form of silicon [accepted in Nature Materials] and we would like to expand our study into application aspect of our recently discovered new form of silicon.' },
  { projectCode: 'TG-CHE140009',
    cores: 448,
    pi: 'Ronald G. Larson',
    fos: 'Chemistry (CHE)',
    inst: 'University of Michigan',
    abstract: 'n/a' },
  { projectCode: 'TG-PHY130007',
    cores: 320,
    pi: 'Taylor C Lilly',
    fos: 'Atomic, Molecular, and Optical Physics',
    inst: 'University of Colorado, Colorado Springs',
    abstract: 'Laser-based gas acceleration and heating of neutral flows have direct applications to research in gas-surface interactions, high-temperature gas research (e.g. chemistry, gas kinetics, and radiation modeling), hypersonics, and orbital environment simulation.  The University of Colorado Colorado Springs, in collaboration with the Air Force Research Laboratory, is currently working on neutral gas heating via non-resonant pulsed optical lattices formed by counter-propagating laser pulses.  This experimentation is greatly enhanced by complimentary numerical simulation.  Using the Direct Simulation Monte-Carlo method for statistical gas dynamic simulation, the simulations proposed will elucidate the kinetic phenomenon at the core of the interaction between a neutral atmospheric gas and high intensity pulsed optical lattices (lasers).  Current experimental capabilities in diagnosing the underlying mechanisms are limited by the fast time-scales and small length-scales of the interaction.  Numerical simulations are not similarly limited and can give data (e.g. velocity and internal energy distributions) inaccessible to experiment.  In pairing the proposed simulations with existing experimental data, this proposal seeks to gain an inside look at the micro-scale molecular interaction (both molecule-molecule and molecule-laser) which drive the experimentally observed phenomena.  The code used for these simulations is SMILE, a thoroughly tested gas dynamic simulation package written in MPI Fortran 77 and specially modified to simulated the laser-gas interaction of interest.  This simulation tool has been used extensively for similar simulations on DoD HPC facilities, demonstrating the PIs expertise in performing the proposed work.  Two test cases were run on TACC Lonestar and TACC Ranger.  A total simulation time of 175,000 SU on the TACC Lonestar system (or 370,000 SU on Ranger) is being requested to perform the proposed simulations.  The product of these simulations, in addition to insight on the gas dynamic phenomena, will be contributing data to at least two archival journal articles and a doctoral dissertation.' },
  { projectCode: 'Histone11_randomizat',
    cores: 48,
    pi: 'Samyeol Baek',
    fos: 'BIOLOGICAL, BEHAVIORAL, AND SOCIAL SCIENCES (BBS)',
    inst: 'Institute for Cellular and Molecular Biology',
    abstract: 'Randomization of 11 histone modification.\n-> TF binding analysis.' },
  { projectCode: 'TG-CHE040013N',
    cores: 32,
    pi: 'Kendall N. Houk',
    fos: 'Organic and Macromolecular Chemistry',
    inst: 'University of California, Los Angeles',
    abstract: 'n/a' },
  { projectCode: 'Thompson_Replication',
    cores: 16,
    pi: 'Matthew W Vaughn',
    fos: 'BIOLOGICAL SCIENCES (BIO)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'In spite of continued strong interest in the epigenome, very little is known about the processes that transmit epigenetic marks through multiple rounds of DNA replication and cell division in plants and animals. Because cell-to-cell inheritance is crucial to the function of epigenetic marks, understanding their biology requires an intimate knowledge of DNA replication as well as tools to study events occurring in S phase. In the proposed project, the tools and knowledge of DNA replication developed in the previous PGRP project will be used to characterize epigenome dynamics during S phase in two important model systems â€“ maize and Arabidopsis.\nA combination of flow cytometry and in vivo labeling will be used to dissect multiple stages within S phase of cells in suspension culture and in planta. A genome-wide approach and deep sequencing technology will be used to address several fundamental questions about the interplay between DNA replication and epigenetic inheritance.' },
  { projectCode: 'NGSDataPipeline',
    cores: 16,
    pi: 'Lee W Kraus',
    fos: 'BIOLOGICAL SCIENCES (BIO)',
    inst: 'University of Texas Southwestern Medical Center',
    abstract: 'Our lab generates various kinds of sequencing data in studying molecular mechanism of transcription in response to various stimuli in either human cell lines or mouse model.  They include RNA-seq, ChIP-seq, RIP-seq, and GRO-seq.  Analyzing these data is very challenging due to their high volume and the complexity of data processing pipeline.  Using TACC cluster will greatly expedite our efforts to gain biological insights out of the sheer volume of data.' },
  { projectCode: 'TG-DMR110088',
    cores: 544,
    pi: 'Jerzy Leszczynski',
    fos: 'Materials Research (DMR)',
    inst: 'Jackson State University',
    abstract: 'Nanoparticles are considered to be the building blocks for nanotechnology.  Use of nanomaterials in various industries is projected to increase dramatically an environmental contamination by these materials. Since it is still largely unknown how nanoparticles will impact the environment, nanotechnology could lead to serious environmental problems.  Moreover,  there is still a substantial need to comprehensively investigate all physicochemical and biological properties of nanoparticles to predict possible impact.\n\nThe goal of the NSF CREST Interdisciplinary Center for Nanotoxicity (ICN) at Jackson State University is to develop an understanding of the potentially complex interplay between properties of different  nanomaterials and the health of ecosystems (impact to environment) using computational and experimental approaches. The Center analyzes the basic properties of the investigated nanoparticles that will lead to the thorough understanding of their behavior in physical processes, environments, relationship between physicochemical properties and biological activity/toxicity. Detailed physicochemical and toxicological characterization of different nanomaterials will ultimately have numerous applications in the industry and environmental hazard assessments and certainly will lead to development of reliable risk and safety evaluations to ensure their safety for human health and the environment. The activity of the Center is focused on the following directions:\n\n1. Physicochemical properties of nanoparticles. Computational and experimental prediction of  fundamental physicochemical properties, including quantum-chemical parameters, size-dependent parameters, composition-dependent parameters, and surface-dependent parameters that determine the intrinsic features of nanoparticles.\n\n2. Interactions of nanoparticles with biological systems and small molecules. The studies are carried out by comprehensive ab initio quantum-chemical calculations at high level of theory for small systems and using hybrid molecular mechanics/quantum-mechanical, classical force files and docking methods for larger systems.\n\n3. SAR studies, toxicity effects and environmental risks assessment of nanoparticles. The structure-activity paradigms applicable for nanoparticles are developed. According to this concept, the structure-property relationships and especially, the nanoparticle-toxicity relationships for different endpoints are being comprehensively investigated to reveal the mechanisms of nanoparticles toxicity and then to use such information to assess the environmental risks.' },
  { projectCode: 'TG-ATM050014N',
    cores: 128,
    pi: 'Brian Jewett',
    fos: 'Atmospheric Sciences (ATM)',
    inst: 'University of Illinois',
    abstract: 'n/a' },
  { projectCode: 'TG-MCA95C003',
    cores: 16,
    pi: 'John F Hawley',
    fos: 'Astronomical Sciences (AST)',
    inst: 'University of Virginia',
    abstract: 'We propose to continue our ongoing program to study the magnetohydrodynamics of astrophysical systems including accretion disks and jets.  We will carry out both global and local three dimensional simulations designed to investigate the properties of magnetized plasma in differentially rotating environments.  We shall validate the numerical results by comparing the outcomes from codes using different algorithms.  The simulations will be analyzed for their observational implications using a post-processor that incorporates an emission model and ray tracing.' },
  { projectCode: 'TG-AST120064',
    cores: 128,
    pi: 'Casey A Meakin',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'Los Alamos National Laboratory',
    abstract: 'We are requesting an allocation to study two complementary lines of grant-supported research in the area of stellar hydrodynamics. First, we would like to carry out a suite of calculations designed to obtain the first detailed look at the stellar evolution that results in the formation and gravitational collapse of an iron core. Towards this end, we will simulate the final stage of turbulent nuclear burning that takes place in a massive star interior immediately preceding the collapse of its core. The second line of research is focused on our ability to model the quiescent, quasi-steady epochs of stellar evolution that precede, and ultimately set the stage for, the often more violent end phases. The primary aim of this effort is to obtain the most detailed possible snapshot of simulated thermal convection in as realistic a stellar interiors setting as possible in order to shed light on the underlying fluid dynamical mechanisms responsible for turbulent mixing. The calculations proposed are specifically designed to study the boundary layer mixing that takes place adjacent to a region of turbulent, thermal convection. This data will contribute towards our ongoing efforts to develop and constrain turbulence closure models for use in stellar evolution calculations.' },
  { projectCode: 'TG-DMR090028',
    cores: 16,
    pi: 'Brian Space',
    fos: 'Materials Research (DMR)',
    inst: 'University of South Florida',
    abstract: 'Hydrogen storage in nanoporous Metal-Organic Materials is a promising approach currently being supported by the Department of Energy\'s Hydrogen Energy program.  Our group (funded under the Basic Energy Sciences division) has employed Teragrid MRAC resources to (a) develop new methodologies and (b) discover key interactions with respect to hydrogen sorption in Metal-Organic Materials.  The previously allocated MRAC has significantly contributed to the publication of numerous manuscripts in peer-reviewed journals and the development of a massively-parallel supercomputing application (MPMC) for evaluating the statistical thermodynamics of hydrogen in nanomaterials.  Here we propose a number of additional approaches to studying hydrogen in Metal-Organic Materials which require computational resources beyond an MRAC, such as exploring the preferential adsorption of \\emph{ortho/para} hydrogen and determining the binding energy of hydrogen to various transition metal-substituted linkers (taking electron correlation into account).  The research tasks ahead have been well prepared for by past MRAC SUs, and so we kindly request that the Large Resource Allocations Committee consider our application.  \\emph{The proposal herein constitutes an application for 2,781,000 SUs to be applied on (a) the TACC Sun cluster Ranger (2,464,000 SUs) and (b) the PSC SGI Altix Pople (317,000 SUs).}\n' },
  { projectCode: 'TG-PHY990007N',
    cores: 224,
    pi: 'Saul A. Teukolsky',
    fos: 'Gravitational Physics',
    inst: 'Cornell University',
    abstract: 'Gravitational waves from the final inspiral, plunge and merger of compact binaries with black holes and neutron stars are primary targets for gravitational wave detectors. While analytic methods such as the post-Newtonian approximation and effective one-body (EOB) formalism can be used to predict wave forms for most of the inspiral, wave forms from the final few orbits, plunge, and merger can be predicted only by large-scale numerical computations. The EOB formalism can be used to construct templates for gravitational wave data analysis by adding parameters that can be calibrated with numerical simulations.  These calibrations, however, require very accurate numerical simulations.  We propose to do a series of simulations and calibrate the EOB waveforms with the results of our simulations for binary systems with non-equal black hole masses as well as arbitrary black hole spins. Neutron stars merging with stellar mass black holes are potentially sources of short duration gamma-ray bursts, depending upon how much of an accretion disk is formed during the merger.  We plan to explore the dependence of the disk formation on the mass ratio, spin of the black hole, and the currently unknown equation of state describing the neutron star.' },
  { projectCode: 'TG-DMR140027',
    cores: 32,
    pi: 'Kimberley R Cousins',
    fos: 'Materials Research (DMR)',
    inst: 'California State University-San Bernardino',
    abstract: 'Recently discovered organoferroelectrics, including croconic acid and diisopropyl ammonium bromide have opened a new area of research for functional materials. A research team of chemists and physicists at the California State University, San Bernardino (CSUSB) working with a larger group including investigators at the University of Nebraska, Lincoln, are conducting experimental and computation studies to define properties and mechanisms of action for known ferroelectric materials, with an ultimate goal of predicting useful organoferroelectrcs. The PI and her undergraduates have learned to use VASP 4.6 for modeling materials properties, but lack sufficient local computational resources to address more complex calculations. The group has already purchased a VASP 5.x license, and is seeking access to XSEDE resources to address both larger systems, and additional calculation types, including of the related piezoelectric properties, and elastic band calculations for ferroelectric transitions. This startup request is to determine how many SU\'s will be needed prior to submitting a full research request in 2014.' },
  { projectCode: 'TG-CTS130006',
    cores: 1040,
    pi: 'Guillaume Blanquart',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'California Institute of Technology',
    abstract: 'The aim of this project is to fill the gap in the present understanding and modeling of soot formation in turbulent non-premixed flames.  The project focuses on the two most critical aspects of soot formation, namely soot nucleation and soot oxidation.  Nucleation of soot particles results from a complex series of slow chemical reactions whose interactions with turbulence remain unknown.  Oxidation of soot depends strongly on the differential transport of the soot quantities (high Schmidt number) and temperature (close to unity Schmidt number).  \n\nThe objectives of proposed work are 1) to investigate the effects of turbulence on slowly reacting chemical soot precursors; 2) to develop reduced-order models for capturing these unsteady effects; and 3) to analyze the differences in transport of unity Schmidt number scalar (temperature) and high Schmidt number scalars (such as soot concentration).  State-of-the-art chemical and soot models will be incorporated in Direct Numerical Simulations of turbulent sooting flames.  Two configurations will be considered, namely turbulent mixing layers and homogeneous isotropic turbulence.  These two configurations are representative of the flow field at the base and the tip of a turbulent jet flame. \n\nThe outcome is expected to be a major leap in the understanding of soot formation/oxidation in combustion engines.  The impact of the proposed research goes far beyond soot formation. It is relevant to the formation of all other nanoparticles (SiO2, TiO2, and AlO3) as well as other slowly evolving processes in turbulent flows (CO, NOx).' },
  { projectCode: 'A-ceer1',
    cores: 64,
    pi: 'Elena McDonald-Buller',
    fos: 'Atmospheric Chemistry',
    inst: 'Center for Energy and Environmental Resources',
    abstract: 'ozone and secondary particulate matter formation will be simulated using WRF and CAMx' },
  { projectCode: 'TG-OCE140024',
    cores: 16,
    pi: 'Antonio M. Baptista',
    fos: 'Ocean Sciences (OCE)',
    inst: 'Oregon Health and Science University',
    abstract: 'The NSF Science & Technology Center for Coastal Margin Observation & Prediction (CMOP) is studying the Columbia River estuary as a river-dominated bioreactor, where biogeochemical transformations occur disproportionately through specialized biological hotspots (e.g., lateral bays, estuarine turbidity maxima, and red water blooms). Anchoring the study is an observation network with high-resolution endurance stations, mobile platforms, and process-oriented campaigns. A family of interdisciplinary models has been developed iteratively, with the benefit of calibration/validation against the CMOP data set, and the frequent scrutiny of process-oriented investigators. These models have been ported to the XSEDE environment (through separate specific allocations to CMOP post-docs and students), and are routinely run there for development, calibration, skill assessment and sensitivity simulations. \nHere, we will use mature versions of these models to provide an integrated view of circulation and sediment dynamics, preparatory of net ecosystem metabolism (NEM) simulations in the estuary. We will also examine the estuarys susceptibility to change. Simulations for the contemporary estuary will typically cover periods over a decade, at high-resolution (time step of 36 seconds, saved every 15 minutes). For one of those years, ten scenarios of globally and locally induced change will also be conducted. \nWe will map our simulation results onto a modern estuarine classification system, to characterize the dependence of the estuary on the four prevailing physical regimes in the estuary, which are driven by river flows and tides. We will also characterize major ocean influences (as measured by salinity intrusion) relative to the estuarine regimes and coastal-upwelling regimes. By exploring select scenarios of change, we will characterize the susceptibility of the estuarine regimes to evolving external forcing and bathymetry.\nThis silico analysis will constitute a major advancement in our iterative understanding of a very complex estuary. The analysis will be limited by the modeling skill, which itself depends on the prevailing forcing and estuarine regimes. An extensive modeling skill assessment will be conducted, whichtogether with a rich and diversity observational data setwill be used to assess strengths and weaknesses of the analysis.' },
  { projectCode: 'STAR-Technip',
    cores: 272,
    pi: 'Melyssa Fratkin',
    fos: 'GEOSCIENCES (GEO)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'Numerical wave tank simulations to validate of Euler-Overlay Method' },
  { projectCode: 'TG-CTS030026N',
    cores: 496,
    pi: 'Prosenjit Bagchi',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'Rutgers University',
    abstract: 'n/a' },
  { projectCode: 'TG-EAR130036',
    cores: 384,
    pi: 'Lijun Liu',
    fos: 'Geophysics',
    inst: 'University of Illinois',
    abstract: 'Subduction is a key geodynamic process governing the temporal evolution of mantle and lithosphere. Although the theory of plate tectonics provides a basis for the horizontal motion of Earths surface, both the fate of subducted slabs and the mechanisms of lithosphere evolution, especially continents, remain poorly understood. This is because the relevant processes are complex and involve a large range of time- and length-scales. Techniques of data assimilation including sequential (forward) and variational (inverse) methods are promising in solving complex systems by minimizing the number of model unknowns through prediction of observational constraints. We have obtained some experiences from previous research in applying both these methods to geodynamic modeling. In this proposal, we plan to expand these methods to better understanding subduction processes and mechanisms of continental lithosphere evolution; example study regions include North America, South America, and East Asia.' },
  { projectCode: 'TG-ATM140004',
    cores: 16,
    pi: 'Bohua Huang',
    fos: 'Climate Dynamics',
    inst: 'George Mason University',
    abstract: 'There is ample evidence that dynamical models of the Earth\'s climate system have the potential to make skillful seasonal predictions of the Indian summer monsoon rainfall from May to September. Currently, however, there is still a major gap between the level of predictability and actual prediction skill, which can be attributed to both inadequate model physics and inaccurate initial state. This proposal requests computational resource to improve the seasonal monsoon prediction, using the version 2 of the Climate Forecast System (CFSv2), which is the current operational climate prediction model at the National Centers for Environmental Predictions. We concentrate on improving the ocean initialization of the forecast system, where most of the memory for seasonal predictability resides. For this purpose, we will conduct a set of 28-year (1979-2009) hindcast experiments, using our newly developed strategy of multiple analysis ensemble (MAE) initialization of ocean. It is expected that the MAE strategy will significantly reduce the effect of the inherent uncertainty in current ocean analyses and thus improve the seasonal prediction skill of the sea surface temperature (SST) in not only the tropical eastern Pacific, but also the western Pacific and Indian Oceans, which will further lead to improved Indian Monsoon prediction. A set of the idealized initialization experiments will also be conducted to help evaluate the effects of the model systematic bias. Furthermore, some sensitivity experiments will be conducted to examine the relative contributions to the monsoon prediction by the SST anomalies in the tropical Pacific, Indian and Atlantic basins respectively, as well as the influences of the atmospheric model resolution on the tropical air-sea interaction. The total requested computational allocation for these experiments is 4.30 million core-hours (su) on Stampede. ' },
  { projectCode: 'Plasmon-Enhanced-Sol',
    cores: 256,
    pi: 'Yuebing Zheng',
    fos: 'Materials Research (DMR)',
    inst: 'Department of Mechanical Engineering',
    abstract: 'Rational design of plasmonic nanostructures for enhanced photovoltaics and photosynthesis' },
  { projectCode: 'TG-DMS140028',
    cores: 512,
    pi: 'Natalia Vladimirova',
    fos: 'Applied Mathematics',
    inst: 'University of New Mexico',
    abstract: 'n/a' },
  { projectCode: 'TG-MCA93S028',
    cores: 3152,
    pi: 'Klaus Schulten',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of Illinois',
    abstract: 'During 2005/2006 our group published 31 papers [1-31] and eight reviews [32-39] reporting our LRAC supported research. One paper notably described the first all-atom simulation of an entire virus, showing that some virus capsids assemble around preformed RNA; the reviews covered three fields which have become transformed through advanced computing: membrane transport, cellular mechanics, and bionanotechnology.  Over the past 15 years, we have published more than a hundred molecular dynamics studies, which were cited over 3,100 times. The great impact is very much due to our close link between computational work and experimental work: about half of our 2005/2006 papers were co-authored with experimental collaborators.  Through our own simulations, as well as through simulations of others using our groups program NAMD, the power of NSFs high performance computers is being harnessed daily for mainstream life science. This year, again, all studies proposed by us are linked directly to the laboratory bench, each involving a leading experimental investigator. We seek to continue investigating forefront biology (protein gas conduction, virus infection, DNA loop formation by proteins, mechanosensitive membrane channels, transport through nuclear pores, proteins acting as springs) and to add two ambitious, already well advanced, investigations on bacterial flagella and ribosome, projects which demand simulations of millions of atoms on thousand processors. In addition to all-atom approaches, our studies involve coarse-graining methods that reach beyond 10 microseconds simulation periods. The latter methodology is backed up by six successfully completed investigations [16, 27, 40-43] and heralds a new era in computational biology.' },
  { projectCode: 'TG-MCB110022',
    cores: 352,
    pi: 'Matthew W Vaughn',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'In this proposal we request an allocation of 4.84 million service units (over 2 years) on Ranger to provide the life science research community with a shared resource for addressing large-scale biological questions with specific focus on genomics- and quantitative genetics-oriented studies. This resource will provide the compute cycles necessary to undertake these investigations and will also provide a much needed standardized suite of applications, workflows and tools. Our focus on genomics is driven by several considerations. First, the broad scope of questions that can be addressed with a comparative genomics approach translates into a range of possible experimental designs, and thus a vast set of examples that will be available to other researchers around the nation. Second, at a time when human impact on the global environment is accelerating, a collective goal of the researchers that will use the products of this proposal is to gain a more fundamental understanding of the genomic biodiversity of the planet.  And finally, genomics provides an extremely useful touchstone for involving a broad swath of the scientific community at a variety of levels, backgrounds, and disciplines.\n\nCurrently, a number of important, phylogenetic and comparative genomics sequencing efforts are underway in the US and abroad. These projects have great potential for advancing our fundamental understanding of key biological processes. At the same time, the massive amounts of data generated by these projects also pose substantial computational challenges to researchers. The goal of this proposal is to provide a robust set of scalable applications, gateways and workflows that can be readily used by biologists for conducting complex comparative genomics and quantitative genetics studies. To this end, several exemplary projects have been chosen to serve as a foundation for building these tools.' },
  { projectCode: 'TG-DMR110085',
    cores: 128,
    pi: 'James Rondinelli',
    fos: 'Materials Research (DMR)',
    inst: 'Northwestern University',
    abstract: 'This new Research Project requests supercomputer time to support our work in the area of first-principles computational design of multifunctional materials. This proposal is for computing resources to be carried out in the group of James M. Rondinelli in the Department of Materials and Engineering at Drexel University. The objective of the proposed study is to obtain a detailed microscopic understanding of charge ordering (CO)the real space ordering of valence electrons driven by Coulombic electron-electron interactions. Our calculations are focused on the materials physics of CO, which we aim to harness as the operating principal of a novel channel material for use in a Vertical Charge Ordering Transistor (VCOT) to be grown using state-of-the-art molecular beam epitaxy techniques at Drexel University.\n\nThe specic goals for this allocation are the following:\n[1] Ab-initio selection of the charge order material. First-principles calculations will be used to screen candidate perovskite oxides for the charge ordering material through a systematic study of the effect of various structural distortionsoctahedral rotations and octahedral breathing modes. These atomic distortion patterns should enhance the charge-ordered state in the active layer.\n[2] Elastic effects on charge order. We will perform calculations on prototypical charge ordering perovskite oxides and subject them to various biaxial strain conditions (to mimic experimental thin film epitaxy) and free standing slabs in vacuum. These studies are aimed at understanding how symmetry and dimensionality can be used to alter the CO state. Because the CO material will form the transistor channel, we will be able to identify the intrinsic limits on the length scales of the device.\n[3] Chemical control over charge order. We seek to identify the role of chemical covalency on stabilizing the charge ordered state in perovskite oxides by exploiting atomic level control over cation ordering in synthetic thin film superlattices. We will simulate the effect of different cation arrangements, while keeping the total stoichiometry fixed, to identify how anisotropic chemical bond environments can be used to manipulate the charge ordered state.\n\nWe request a total of 44,925 SUs for this Research Project to be used on the TACC, Lonestar machine.\nDetails and justication for the hours are provided in Sec. 3 of our proposal. Our investigations will employ plane-wave density-functional theory as implemented into the Vienna Ab-initio Soware Package (VASP) together with recent developments in materials theory understanding of structural phase transitions in perovskite oxides to explore and characterize the charge ordering phenomenon. This code is well-suited for studyingmaterials with complex electronic and magnetic structures and with unusual orbital and spin responses because it has the capability to simultaneously treat relativistic spin-orbit interactions, non-collinear magnetism and correlated electrons (Hubbard U method). Finally, we present scaling benchmarks for VASP on the QueenBee machine and use those timings to estimate the total number of SUs for the project on the new TACC, Lonestar System.\n\nThe primary need for TeraGrid resources is due to the limited computing facilities available to the PI. The PI has recently moved to Drexel University and at present the research group does not have local computer cluster. The current proposal therefore represents the majority of computational hours for the PI and one Postdoc for Q3(2011) through Q3(2012). In addition to the current project allocation, the PI has a pending supercomputer (100,000 SUs) request at the Computational Nanoscience Facility at the Center for Nanoscale Materials (CNM) at Argonne National Laboratory. That allocation is primarily intended for the PIs graduate student, Joshua Young, and not related to the CO project described in this proposal.' },
  { projectCode: 'TG-DMR130011',
    cores: 576,
    pi: 'David S Simmons',
    fos: 'Materials Research (DMR)',
    inst: 'University of Akron',
    abstract: 'The proposed research will employ NSF XSEDE computational resources to address two questions in the physics and engineering of glass-forming materials: 1) how do interfacial effects on glass-formation impact the boundary condition of flow in confined glass-forming liquids; 2) what is the interplay between crystallization and glass formation in semi-crystalline systems, and how can these systems be rationally engineered via changes in composition and chemical structure? These topics will be addressed via coarse-grained classical molecular dynamics simulations of 1) nanoconfined polymeric and small-molecule glass-formers under flow and 2) a semicrystalline binary Lennard-Jones glass-former.' },
  { projectCode: 'iPlant-Collabs',
    cores: 64,
    pi: 'Matthew W Vaughn',
    fos: 'BIOLOGICAL SCIENCES (BIO)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'The iPlant Collaborative is a successful partnership among UT and several other institutions to provide a comprehensive national cyberinfrastructure. It supports a community science gateway, a REST API, and several joint development, optimization, and scientific sub-projects. This project is intended to coordinate the development and optimization projects, leaving iPlant-Master as a home for the gateway and analysis activities.' },
  { projectCode: 'TG-MCB080109N',
    cores: 32,
    pi: 'Marta Filizola',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'Mount Sinai School of Medicine',
    abstract: 'Computational studies are proposed here by a medium-size group of computational biophysicists directed by Dr. Marta Filizola at Mount Sinai School of Medicine of New York University to gain a better understanding of the structural and molecular determinants responsible for ligand-induced activation of membrane protein systems such as opioid receptors and beta3 integrins. Specifically, opioid receptors are members of the G-protein coupled receptor (GPCR) family, while beta3 integrins are members of the integrin family. GPCRs constitute the most abundant family of cell-surface proteins involved in signal transduction, and are among the most heavily investigated drug targets in the pharmaceutical industry. They have recently been discovered to form dimers or higher-order oligomers. Beta3 integrins are hetero-dimeric cell-surface receptors that mediate cell-cell, cell-extracellular matrix, and cell-pathogen interactions. Despite intensive research on both classes of these membrane proteins, a molecular understanding of the dynamic mechanisms underlying their function is still uncertain. As part of an integrated approach combining inferences we obtain from our computational studies with collaborative experimental testing, we plan to identify specific mutations at interaction interfaces of GPCRs or integrins that may interfere with their function. The planned computational studies are part of a larger research project aimed at achieving a detailed mechanistic understanding of allosteric signal transduction processes triggered by molecular recognition in membrane protein complexes. These NIH-supported studies are computationally challenging and highly CPU-time consuming. We estimate that the bulk of the proposed studies on opioid receptors and beta3 integrins will require a total of 994,593 hours of computer time. In order to reduce the computational load associated with our projects, we propose to split our simulations between in-house computational resources and Teragrid machines, thus reducing our current request to 459,536 service units (SUs) on Teragrid machines. Estimates of our computational needs on these machines were calculated using our recently awarded DAC proposals (MCB070113 to Marta Filizola, MCB070117 to Marta Murcia, MCB080055 to Andrea Bortolato, and MCB080029 to Debashree Bandhyopadhyay), and are reported in detail in the Justification of Requested Computation Time section. ' },
  { projectCode: 'TG-DMR130039',
    cores: 64,
    pi: 'Gaurav N Sant',
    fos: 'Materials Research (DMR)',
    inst: 'University of California, Los Angeles',
    abstract: 'n/a' },
  { projectCode: 'TG-AST100040',
    cores: 64,
    pi: 'Alexander Tchekhovskoy',
    fos: 'Astronomical Sciences (AST)',
    inst: 'University of California, Berkeley',
    abstract: 'n/a' },
  { projectCode: 'TG-CHE130008',
    cores: 256,
    pi: 'Hanning Chen',
    fos: 'Chemistry (CHE)',
    inst: 'George Washington University',
    abstract: 'Solar energy is one of the most promising renewable sources to dissolve the pressing worldwide energy crisis, which is caused by our dominant reliance on the environmentally unfriendly fossil fuels. Owing to the explosion in computational power over the last decade, the computational modeling of the critical yet experimentally unobservable photon-electron exchange has become feasible on realistic time scales and length scales. In the proposed projects, we will apply several novel time-dependent optical theories to study the light-matter interactions in a wide variety of photo-voltaic, photo-catalytic and photo-conductive devices, including plasmon-enhanced dye-sensitized solar cells, singlet fission polycrystalline and photo-modulable molecular wire.       ' },
  { projectCode: 'TG-CHE140070',
    cores: 128,
    pi: 'Hai Lin',
    fos: 'Chemistry (CHE)',
    inst: 'University of Colorado, Denver',
    abstract: 'Membrane proteins are attached to or associated with the membranes, and they perform a wide range of functions from signal transduction to membrane fusion that are vital to cell growth, replication, and movement. This proposal seeks to carry out molecular modeling and simulations to gain insights into the acting mechanisms and the underlying dynamics of two families of critical membrane proteins. The first is the ClC chloride transport proteins, which translocate chloride ions across the cell membrane. We aim to study how quantum effects, such as charge transfer and tunneling, tune the mechanism and the underlying dynamics of ion translocation. This part of work is currently supported by National Science Foundation (CHE-0952337). The second membrane proteins are the C2A domains of the synaptotagmins (Syts) that stabilize intermediate states in membrane fusion. In this project, we aim to establish the correlations between the structural features and membrane docking mechanisms of the two homologous C2A protein domains from Syt1 and Syt7. In collaboration with our experimental collaborator, we want to understand how the subtle variations in protein structure can significantly change the way that the proteins associate with membranes. This part of work is currently supported by Research Corporation (MI CCSA 22399). We will utilize a wide range of computational techniques from quantum mechanical model calculations to molecular dynamics simulations. In particular, we will develop, implement, and apply novel combined quantum-mechanical/molecular-mechanical (QM/MM) methods for dynamics simulations. We will further develop and optimize our QMMM code and to carry out the simulations using our QMMM code as well as other programs (Amber, Gaussian, MNDO, NAMD, and TINKER). The project will involve a number of undergraduate students from the Department of Chemistry and the Department of Biology.' },
  { projectCode: 'CarbonCycling',
    cores: 224,
    pi: 'Muhammad J Shaikh',
    fos: 'Global Atmospheric Research',
    inst: 'John A. and Katherine G. Jackson School of Geosciences',
    abstract: 'We propose to develop, carry out, and analyze simulations with versions of the DOE/NSF Community Earth System Model (CESM) that address some outstanding uncertainties in the modeled carbon and nitrogen cycles and their feedback on climate and atmospheric carbon dioxide concentrations.  Direct climate impacts arise from modification of leaf transpiration that coexists with carbon assimilation.  Carbon assimilation at leaf level depends on several approximations now made in the CLM land model whose efficacy can be questioned and involve leaf level PAR intensity and leaf physiological parameters.  Nitrogen regulates the increase of CO2 uptake with increased CO2.  However, the magnitude of this regulation depends on several processes not currently included in the model and to be evaluated in our proposed study.\n\tThe proposed simulations will first use some scenarios in a recent paper to evaluate the impacts of stomatal closure from a doubling of CO2, and how these impacts can be changed by a prescribed downregulation of leaf function and an increase of leaf area.  It then will use new codes developed as part of this proposal to evaluate the dependences of down regulation parameterization for the coupled soil carbon and nitrogen cycling.\n\tThe anticipated end point of this study is the clarification of some important uncertainties as to future climate and carbon dioxide levels and some new ESM component codes that should allow a reduction in these uncertainties.' },
  { projectCode: 'TG-DEB140011',
    cores: 800,
    pi: 'Sean Norman',
    fos: 'Environmental Biology (DEB)',
    inst: 'University of South Carolina',
    abstract: 'n/a' },
  { projectCode: 'TG-DMR970008S',
    cores: 64,
    pi: 'Gerbrand Ceder',
    fos: 'Materials Research (DMR)',
    inst: 'Massachusetts Institute of Technology',
    abstract: 'Our group studies the structural, thermodynamic, kinetic, electronic, and electrochemical properties of materials for energy technologies with a focus on the ab initio prediction for complex materials. Using our grant from last year, we accomplished most of what we outlined as a plan of research in last year\'s proposal, and submitted several papers based on that work: 1) we have determined the equilibrium particle shapes for olivine structure LiFePO4 and LiMnPO4 and calculated the energy barriers for lithium in the bulk region to diffuse out at the (010) surface. These factors control the morphology and performance of this important class of Li ion battery cathode materials. 2) We have calculated the bending strain energy, defect energy and interfacial energy in TiS2 nanotubes, and determined the optimal bending angle. These calculations permit a better understanding of the structure of inorganic nanotubes, which is crucial to accurate calculations of their electrochemical and other properties for Li ion battery applications. 3) We constructed the Pourbaix diagrams for both bulk and 0.5 to 2 nm diameter Pt nanoparticles, which helps us understand and improve the stability of Pt nanocatalysts. 4) We developed a method based on the cluster expansion formalism that makes highly accurate thermodynamic calculations of nano-structured materials computationally feasible, and applied it successfully to our test system of Au-Pd nanoparticles to predict ground state structures. This method allows us to extend our computational work to alloyed nanoparticles that are too large for the fully ab initio approach. We are requesting an allocation to allow us to advance our studies on several areas: in Li ion battery materials we will 1) continue the study of LiFePO4 nanoparticles with adsorbates to study how the equilibrium particle morphology is modified by different solution environments and predict optimal synthesis conditions, and 2) study lithiation reactions in alloyed metallic and oxide nanoparticles. 3) In fuel cell catalysis we will investigate the effects of alloying on Pt catalysts. 4) We will also evaluate different quantum mechanical, continuum and hybrid model in the study of electrochemical properties of room temperature ionic liquids for electrolyte and other applications. 5) We will evaluate the optical and transport properties of candidate materials for photovoltaic applications using the GW approximation. The amount of units we are requesting this year is higher than last year\'s allocation because of the fact that we are expanding our research program to include additional areas of energy technologies and also because of the increased complexity in our calculations.' },
  { projectCode: 'TG-AST130036',
    cores: 1024,
    pi: 'Adam Frank',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'University of Rochester',
    abstract: 'Observational evidence from local star-forming regions mandates that star formation occurs shortly after, or even during, molecular cloud formation. Models of the formation of molecular clouds in large-scale colliding flows have identified the physical mechanisms driving the necessary rapid fragmentation. They also point to global gravitational collapse driving supersonic turbulence in molecular clouds. In this work we propose exploring the effect of {\\\\it magnetic fields} and {\\\\it shear} in the colliding flow on the resulting clouds and the ensuing gravitational collapse. We also explore the role of triggering in star formation, namely the ability of supersonic flows to drive stable pre-existing clouds into collapse. We are particularly interested in the formation of (planet forming) accretion disks in the aftermath of triggering and the role of fields in inhibiting or altering collapse.\n\nThree new publications came from results obtained with our previous XSEDE allocation (AST130036) and we now seek resources to continue and expand our work. To achieve this goal we request the support of 5.0 million SU\'s on Stampede at TACC, 2.5 million SU\'s on Gordon at SDSC.\n' },
  { projectCode: 'TG-CTS130030',
    cores: 48,
    pi: 'Zhi Liang',
    fos: 'Thermal Systems',
    inst: 'Rensselaer Polytechnic Institute',
    abstract: 'n/a' },
  { projectCode: 'Xenon',
    cores: 192,
    pi: 'Mark Deinert',
    fos: 'Interfacial, Transport, and Separation Processes',
    inst: 'Nuclear Engineering Teaching Laboratory',
    abstract: 'Underground nuclear tests produce anthropogenic isotopes that provide the only definitive means by which to determine whether a nuclear explosion has taken place.  Verification of a suspected test under the Comprehensive Nuclear-Test-Ban Treaty often relies on ratios of noble gas radioisotopes that are gathered either on-site or off-site.  It is well established that below ground transport affects the rate at which these gasses will reach the surface.  However, the relative abundance of anthropogenic isotopes is currently assumed to rely solely on fission yield and decay rate.  Our work is focused on understanding how  geological transport can skew the ratios of key radioxenon isotopes that are used to help determine whether or not a test has taken place.' },
  { projectCode: 'TG-DMR090023',
    cores: 704,
    pi: 'Dane Morgan',
    fos: 'Materials Research (DMR)',
    inst: 'University of Wisconsin',
    abstract: 'n/a' },
  { projectCode: 'Alloys',
    cores: 256,
    pi: 'Perla B Balbuena',
    fos: 'Chemical Reaction Processes',
    inst: 'Texas A&M University',
    abstract: 'We are interested in developing a better understanding of the properties of bimetallic or trimetallic core-shell nanostructures as catalysts for the reduction of oxygen in acid medium. Under these conditions, the metal catalysts may undergo a side corrosion reaction where the metal particles may dissolve into the acid medium. We have recently developed a methodology for testing the durability of Pt-based alloys via computational determination of the electrochemical potential shift with respect to pure platinum. For this, we use the VASP program to compute the surface chemical potential of slab systems. The calculations are done with and without the presence of adsorbed atomic oxygen.' },
  { projectCode: 'TG-PHY120016',
    cores: 640,
    pi: 'Pablo Laguna',
    fos: 'Gravitational Physics',
    inst: 'Georgia Institute of Technology',
    abstract: 'This renewal proposal seeks the continuation of our EXEDE Resources Allocation in support of our numerical relativityeffort on simulations of compact objects and their impact on astrophysics and gravitational astronomy.  Numerical relativity has truly become a tool of discovery. For gravitational wave astrophysics, it has enabled a serious conversation between researchers modeling sources of gravitational radiation and scientists focussed on the intricacies of analyzing the\ndata collected by interferometric detectors.  The black hole binaries continues to be one of the most transformative challenges at the interface of gravitational wave physics, astrophysics, mathematical relativity and computational\nscience. The challenge resides in the complexities associated with solving Einstein\'s equations; in the many scales involved, from those comparable to the binary orbits or gravitational wavelengths to those in the vicinity of the black holes; in the resolutions needed to accurately extract gravitational waveforms; and in the inclusion of physics to model matter sources. \nThe allocation requested will support  work on  binary  black holes systems organized in the following closely related project areas: 1) Binary black holes in vacuum to expand parameter space explored to include arbitrary black hole spin orientations and to enhance a bank of  hybrid gravitational waveforms.\n2) Binary black holes in astrophysical environments to investigate whether electromagnetic observations are able to detect and characterize the presence of these binary systems. \n3)Binary black holes in alternative theories of gravity to study the late inspiral and merger of a binary coalescences and distinguish between scalar-tensor gravity and general relativity.\n' },
  { projectCode: 'TG-OCE110011',
    cores: 32,
    pi: 'Timour Radko',
    fos: 'Physical Oceanography',
    inst: 'Naval Postgraduate School',
    abstract: 'This three year plan for research focuses on the dynamics of oceanic double-diffusive convection, an important small-scale mixing process driven by the two orders of magnitude difference in diffusivities of heat and salt in seawater. The significance of double-diffusive mixing for water-mass transformation and determining the structure of the temperature-salinity relationship in all oceans has become increasingly clear over the last few years. One of the most intriguing aspects of double-diffusive convection is related to its ability to transform smooth vertical gradients into stepped structures consisting of mixed layers separated by thin, stratified interfaces. Recent field data from the tropical Atlantic has shown that vertical fluxes due to salt fingers, within thermohaline staircases, are significantly (by an order of magnitude) enhanced when compared to non-staircase regions with similar stratifications. Thus, it is vital to improve our understanding of thermohaline staircase formation, evolution and large-scale consequences. Double-diffusive mixing plays a fundamental role in the oceans ability to transport and sequester heat, salt, nutrients, pollutants and carbon dioxide. Yet, this small-scale process is not included in most large-scale oceanographic models, including operational Navy models, which severely limits their predictive capabilities. This research plan is aimed at quantifying the double-diffusive transport in both smooth gradients and thermohaline staircases, developing clear insight into the origin of staircases and specifying conditions for their formation. The proposed study will involve numerical process modeling using a pseudo-spectral code, which integrates the Navier-Stokes equations of motion (Boussinesq approximation). Inferences from the model runs will be used to interpret the oceanic fine- and microstructure data and the results of laboratory experiments. Advanced support is requested for collaboration with Dr. Gabriele Jost, who is familiar with the double-diffusive codes and has collaborated with the NPS computational fluid dynamics group in the past. This collaboration involves application of the advanced numerical methods to Double-Diffusion problems. The goal of this collaboration is to perform a series of Direct Numerical Simulations that will form the basis of a parameterization scheme for the General Circulation Models (GCMs). Prof Radko has developed code of his own to solve DDC problems for 2D (SF2D) and 3D (SF3D) problems. The parallelization in these codes is based on OpenMP. In order to handle realistic problem sizes, more computational power is needed than what the current OpenMP version delivers on general multi-core node clusters. SF3D lends itself to MPI parallelization. The 2D version (SF2D) may be a good candidate for running on GPGPU based nodes. Special support is requested for the port of SF2D to a GPGPU system, the development of an MPI based version of SF3D and for the evaluation of existing MPI-based codes and their suitability to the current project.' },
  { projectCode: 'TG-DMR130010',
    cores: 96,
    pi: 'Alexey N Volkov',
    fos: 'Materials Research (DMR)',
    inst: 'University of Alabama',
    abstract: 'The computing time on the Lonestar and Kraken XSEDE resources is requested for the investigation of a number of research problems in the two mutually dependent areas: (1) Atomistic simulations of thermal boundary conductance and frictions forces between interacting carbon nanotubes (CNTs), and (2) Mesoscopic simulations of structural, mechanical, and thermal properties of CNT films and vertically aligned arrays with the focus on prediction of structural changes, viscoelastic response, collective effects, and damage in CNT materials subject to quasi-static or high-velocity impact mechanical loading. The obtained results are expected to assist in the design of ballistic protection materials based on CNT-reinforced nanocomposites. The atomistic simulations will be performed with the Large-scale Atomic/Molecular Massively Parallel Simulator (LAMMPS) code. The in-house molecular-dynamics-type code implementing an original mesoscopic model of carbon nanotubes and designed for large-scale simulations of CNT materials will be used for mesoscopic simulations of CNT films and vertically aligned arrays. Both codes are tested by the research team on a number of supercomputing resources including XSEDE clusters. These benchmark simulations confirmed good scalability and performance of the computational codes.' },
  { projectCode: 'A-ti71',
    cores: 976,
    pi: 'Thomas Hughes',
    fos: 'Cross-Disciplinary Activities (CDA)',
    inst: 'Department of Aerospace Engineering and Engineering Mechanics',
    abstract: 'The objective of this Research is to develop a research framework and produce a computation toolset to address coronary artery flow problems.  The items that are necessary to build such predictive models are as follows: \r\n\r\n1)\tIncompressible Navier-Stokes fluid solver including non-Newtonian constitutive capabilities and, in particular, the Casson model.\r\n2)\tScalar advection-diffusion equation coupled to the Navier-Stokes solver.\r\n3)\tLinear elastic/viscoelastic/poroelastic wall and solid capability coupled to the flow solver.\r\n4)\tInflow boundary condition module based on the Womersley solution for distributing the flow waveform over the cross-sectional area of the artery, catheter, etc.\r\n5)\tOutflow impedance boundary condition module to represent the effect of the distal arterial system on the modeled region.\r\n6)\tNon-uniform rational B-spline (NURBS) templates for accurate geometric modeling and meshing of lumen and surrounding tissue.\r\n7)\tMesh generation capability.\r\n\r\nWith these items, meaningful calculations can be carried out, and also, it will provide a framework for future development.  At the moment our research group has a finite element and NURBS based Navier-Stokes solver and coupled linear elastic solid capability and a capability to generate finite element meshes for it.  We have added the Casson model to the flow solver, developed the coupled advection-diffusion equation capability, the poroelastic solid capability and develop the NURBS templates and the other items listed. \r\n\r\nNow we will study mass transport within the blood vessel wall with a view to achieving a few specific objectives:\r\n \r\nÃ¯Â¿Â½\tA study of the coupled analysis of mass-transport of nano-particles and drug in the blood stream and in the arterial walls will be undertaken. Results of this study will be incorporated into the existing computational framework in order to investigate,\r\n\r\na)\tMass transport of drug-encapsulated nano-particles into the blood vessel wall \r\nb)\tCoupled mass transport of nano-particles and drug diffusion from nano-particles in the arterial wall \r\n\r\ngiven several boundary conditions, namely, mass flux, concentration of drug at the wall, and so on. \r\n\r\nÃ¯Â¿Â½\tOn the analysis side, our efforts will include, \r\na)\tQuantification and visualization of drug concentration on the arterial wall as a function of space and time \r\nb)\tStudying the parametric sensitivity of mass transport \r\nc)\tDetermination of dominant dimensionless numbers (Schmidt number, Sherwood number, etc.)\r\nd)\tDefining metrics (for example, dose homogeneity index, remaining mass percentage, etc.) to measure drug delivery efficiency, and thus effectiveness of various catheter systems.\r\n\r\nThis request seeks to validate the software we have developed and start testing on some patient-specific geometries the efficacy of different drug delivery systems.' },
  { projectCode: 'TG-DMR140074',
    cores: 64,
    pi: 'Yu-Ting Cheng',
    fos: 'Metals, Ceramics, and Electronic Materials',
    inst: 'Johns Hopkins University',
    abstract: 'Thermoelectric energy conversion is seen as a promising energy-management option because of its low impact on environment and the opportunity to generate electricity from waste heat. However, the biggest challenge is to develop thermoelectric materials with high power and efficiency. Based on the thermoelectric figure of merit ZT (equal to (S^2&#963;/k)T, where S is the seebeck coefficient, &#963; the electric conductivity, k the thermal conductivity, and T the temperature), the key to enhance the ZT is the development of a material with phonon-glass (low thermal conductivity) and electron-crystal (high electric conductivity) properties. From our preliminary study of Zn-Sn-O alloy systems, performed under the NSF grant (#1005398), the addition of Sn is found to improve the electrical conductivity of ZnO. This enhancement is currently being investigated by employing first-principles calculations through another XSEDE starup grant (#TG-DMR140029). In this work, we plan to use molecular dynamics (MD) simulations to investigate the thermal property (thermal conductivity and phonon spectra), which is another critical factor to the development of better thermoelectric materials, for Zn-Sn-O systems. In particular, MD simulation could bridge the gap between nano and micro scale. Therefore, the effects of defects, dislocation, and grain boundary could be investigated and characterized on the dominant transport mechanisms in bulk Zn-Sn-O systems to complement our finding from the first-principles calculations. These results are expected to guide the interpretation of experimental data and optimization for future thermoelectric material design. ' },
  { projectCode: 'P-UTSA8',
    cores: 512,
    pi: 'Liao Y. Chen',
    fos: 'Biophysics',
    inst: 'University of Texas at San Antonio',
    abstract: '(1) Aquaporin study:\n\nAquaporins (AQPs) are a large family of integral membrane proteins, which facilitate the rapid and yet highly selective flux of water and other small solutes across biological membranes [1]. These proteins are present in all kingdoms of life, demonstrating their central role in maintaining normal physiology of all organisms. Since the first demonstration of aquaporin-1 (AQP1) from human red blood cells as a bona fide water channel, more than 450 individual AQPs have been identified and many family members are being functionally and structurally studied [2]. In silico experiments or, namely, molecular dynamics (MD) simulations, complimentary to in vitro experiments, have proven to be important in determining the mechanisms of permeation through aquaporins on the molecular level. In particular, the free-energy landscapes of the human AQP1 and of the E. Coli glycerol uptake facilitator GlpF, have been mapped in recent studies, [3-5] employing two equilibrium approaches: thermodynamics integration and adaptive biasing force methods as well as the non-equilibrium approach of steered MD (SMD). While consensus has been reached for the functions of the selection filter (SF) and the NPA motifs, the free energy profiles predicted do not quantitatively agree with one another. \nThe main objectives of the proposed research are: (1) to resolve the disagreement of the existing studies of hAQP1 and GlpF; (2) to extend the MD studies to a number of important AQPs, exploring the free-energy landscapes of AQP0, AQP1, AQP4, AQP5, AQPM, PfAQP, GlpF and AQPZ for the following permeants: H2O, C3H5(OH)3, CO2, NO, H2O2, NH3, As(OH)3, Sb(OH)3, and Si(OH)4.\nSpecifically, we will use the structure files from the Protein Data Bank (PDB) as the starting point. We will build lipid bi-layer to model the cell membrane and embed a given AQP tetramer in the membrane. We will solvate and ionize the AQP-membrane complex to simulate the physiological environment. We will employ the CHARMM 27 force fields to represent the all-atom interactions of the system and use the adapted NAMD 2.6 MD engine for equilibrium and nonequilibrium dynamics runs. We will pull the center of mass of a permeant molecule across a porin (channel) forward from the periplasm side to the cytoplasm side and then pull it back in the reverse direction. Along the forward and reverse pulling paths, we will measure the pulling forces and compute the work done to the permeant along the paths. From the work measurements, we will compute the free-energy profile along the permeation channel. We plan to implement this study first for water (H2O) and glycerol (C3H5(OH)3) and then for other permeants listed in the previous paragraph. If the requested support granted, we expect to accomplish the study for water and glycerol within one year and to generate enough preliminary data for an NIH proposal securing extramural funding support.\nWhen completed, the proposed research will (1) resolved the current discrepancies concerning the free-energy landscapes of water and glycerol permeating GlpF and (2) produce accurate mapping of the free-energy landscapes for important permeants through a number of physiologically importantly AQPs. In the long term, the proposed research will bear on determining the mechanisms of water-channel related diseases and finding their cures.\n\n[1] For a recent review, see The AQP Structure and Functional Implications, Handbook of Exp. Pharmacol. 190, (2009), Springer, Berlin.\n[2] T. Walz, Y. Fujiyoshi, and A. Engel, The AQP Structure and Functional Implications, Handbook of Exp. Pharmacol. 190:31-56 (2009).\n[3] J. S. Hub and B. L. De Groot, Proc. Natl. Acad. Sci. U.S.A. 105, 1198 (2008).\n[4] J. Henin, E. Tajkhorshid, K. Schulten, and C. Chipot, Biophysical J. 94, 832 (2008).\n[5] L. Y. Chen, D. A. Bastien, and H. E. Hugo, Phys. Chem. Chem. Phys., DOI:10.1039 (2010).\n\n\n(2) Fuctionalized gold/silver nanoparticles: \n\nInteractions between functionalized noble-metal particles in aqueous solution are central to applications relying on controlled equilibrium association.  Herein we propose to obtain the potentials of mean force (PMF) for pair-interactions between functionalized gold nanoparticles (AuNPs) in physiological saline. Four types of functionalization are built by coating the globular Au144 cluster each with 60 thiolate groups: GS-AuNP (glutathionate), PhS-AuNP (thiophenol), CyS-AuNP (cysteinyl), and p-APhS-AuNP (para-amino-thiophenol), which are, respectively, negatively charged, hydrophobic (neutral-nonpolar), hydrophilic (neutral-polar), and positively charged at neutral pH. The preliminary results, based upon 1000-ns experiments in silico of all-atom model systems under equilibrium and nonequilibrium conditions, confirm the behaviour expected of neutral (hydrophilic or hydrophobic) particles in dilute aqueous environment, but the PMF curves demonstrate that the charged AuNPs interact with one another in a unique way â€” mediated by H2O molecules and electrolyte (Na+,ClÂ¯) â€” in a physiological environment. In the case of two GS-AuNPs, the excess, neutralizing Na+ ions form a mobile (or â€˜dynamicâ€™) cloud of enhanced concentration between like-charged GS-AuNPs, inducing a moderate attraction (~ 25-kT) between them. And, to a lesser degree, for a pair of p-APhS-AuNPs, the excess, neutralizing ClÂ¯ ions (less mobile than Na+) also form a cloud of higher concentration between the two like-charged p-APhS-AuNPs, inducing weaker yet significant attractions (~ 12-kT). In the combination of one GS- and one p-APhS-AuNP, the direct, attractive Coulombic force is completely screened out while the solvation effects give rise to moderate repulsion between the two unlike-charged AuNPs. \nWith these preliminary results (published in PCCP) validating our approach, we will pursue similar studies of silver nannoparticles. We will study concentration effects of gold and silver nanoparticles in solutions of one nanoparticle type and solutions of their mixtures.' },
  { projectCode: 'TG-MCB130112',
    cores: 480,
    pi: 'Taras Pogorelov',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'University of Illinois',
    abstract: 'Membrane-active host defense peptides (MAHDP) constitute a key part of the initial immune response in multicellular organisms. They are active against both the bacterial and neoplastic mammalian membranes. The molecular picture of these interactions is incomplete. The long-term goal of this project is to understand the MAHDP mechanism of action at the atomic level, so as to guide the development of novel antimicrobial and anticancer peptides. The main hypothesis that drives this proposal is that anionic lipid clustering is the key event in the initiation of peptide-membrane interaction. The aims are: 1. Systematic modeling of bacterial and neoplastic membranes. I will study lipid clustering in binary membranes representing bacterial (PE/PG) and neoplastic (PC/PS) membranes in the absence of peptides. 2. Peptide-membrane interactions: the role of lipid clustering. We will investigate magainin 2 and its highly charged variant, pexiganan, interaction with model membranes and test the sweep-and-insert mechanism, that we propose.' },
  { projectCode: 'TG-CHE140071',
    cores: 192,
    pi: 'Tudor Spataru',
    fos: 'Inorganic, Bioinorganic and Organometallic Chemistry',
    inst: 'City University of New York',
    abstract: 'Enzyme Cytochrome P450 and coenzyme vitamin B12 have similar physical and bio-chemical features of their activation mechanisms due to their similar structures. Both molecules are activated by the influence of the substrate or by the influence of the electronic transfer. The special effect similar to Pseudo-Jahn-Teller effect is responsible for the activation of these bio-systems. DFT, MCSCF and single point CCSD(T) electronic structure methods are expected to identify both,  the structural mechanisms and the vibronic e. g. Pseudo-Jahn-Teller effect influence on coenzyme vitamin B12 coenzyme and enzyme porphyrin P450 activation in multiple biological processes.' },
  { projectCode: 'TG-MCB140270',
    cores: 432,
    pi: 'Vincent A Voelz',
    fos: 'Biophysics',
    inst: 'Temple University',
    abstract: 'The last ten years have seen major strides in using molecular simulation to understand protein folding mechanisms in atomic detail.  Advances in computing software and hardware have increased the time scales accessible by molecular simulation, and enhanced conformational sampling from massively parallel simulations, coupled with kinetic network approaches to describe conformational dynamics, have made possible the modeling of protein folding on the millisecond time scale, and quantitative connections to experiments.  To make further progress in this direction, we will expand the scope of these tools to two new challenges: (1) joint computational/experimental studies of early folding events (~200 s) of apomyoglobin, a large (153 residues) and biologically significant protein, and (2) using adaptive sampling methods to study how mutations effect folding landscapes and mechanisms.  The requested XSEDE resources are a key component in a larger effort utilizing high-performance computing (HPC) resources available at Temple University (Owlsnest) and world-wide distributed computing (Folding@home).  New kinetic network approaches based on Markov State Models (MSMs) will be used to adaptively guide conformational sampling to efficiently construct models of protein folding in predictive detail.  Although Folding@home is good for generating many short trajectories to enhance statistical sampling, only the highly parallel computing resources available through XSEDE can provide the long simulation trajectories we need to explore slow conformational transitions in apomyglobin folding.' },
  { projectCode: 'A-ti7',
    cores: 496,
    pi: 'Thomas Hughes',
    fos: 'Computational Mathematics',
    inst: 'Department of Aerospace Engineering and Engineering Mechanics',
    abstract: 'The objective is to apply the variational multiscale formulation of the Large Eddy Simulation to a problem of boundary layer bypass transition to turbulence. Only Direct Numerical Simulation (DNS) has proved up to the task of satisfactorily treating such complex flow phenomena heretofore. However, DNS is limiting due to its enormous cost. If the proposed research proves successful, it may open the way to much more economical solution of this very important class of flows. This would have significant engineering implications.' },
  { projectCode: 'TG-MCA05S028',
    cores: 1184,
    pi: 'Aleksei Aksimentiev',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of Illinois',
    abstract: 'With ever advancing miniaturization of silicon technology, it is possible now to manufacture devices with features comparable in size to the building blocks of life: DNA and proteins. Today, such devices can already detect and manipulate biological macromolecules. In the future, they will allow man-made electric circuits to interact directly with the robust machinery of living cells. This proposal requests a 1,574,000 SU allocation of computer time to advance our understanding of nanoscale interactions between biomolecules and man-made devices. We focus here on one particular emerging technology - silicon nanopores for sensing and manipulating single biomolecules - that has grown within the past 10 years from a pioneering idea into a major initiative supported by numerous funding agencies including NSF, NASA, DARPA, and recently by the NIH $1,000 genome program.  The major part of the requested allocation will be dedicated to the development of a nanopore device for sequencing DNA.  Other projects will include studies of DNA and protein translocation through membrane channels, and self-assembly of lipid vesicles with a silicon pore. We will also continue developing an empirical force field for the accurate description of interactions between silicon-based materials and biomolecules. All projects will be carried out in collaboration with leading experimental groups. The simulations will be performed using the award-winning highly scalable molecular dynamics program NAMD.' },
  { projectCode: 'TG-AST130060',
    cores: 32,
    pi: 'Phillip A Cargile',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'Harvard University',
    abstract: 'Within the last decade, large-scale, exoplanet surveys have produced vast catalogs of potential planet hosting systems. However, they are limited by a lack of stellar characterization derived from high-resolution stellar spectra, thus presenting a new data analysis challenges.  Recent studies have called into question the accuracy of the standard techniques used to measure stellar parameters from these spectra, including systematic errors that may be inherent to algorithms used to do the parameter measurements. With this in mind, we have developed SME@XSEDE, a new automated technique to measure stellar parameters by coupling well tested analysis tools with the advantages of large computational resources. At the core of our methodology, we utilize existing and stable software to perform the detailed synthesis of stellar spectra (SME: Spectroscopy Made Easy). However, instead of using traditional non-linear least-squares minimization or grid search techniques to find stellar parameters, we are performing a more extensive analysis using a Monte Carlo approach. We incorporate Bayesian analysis to determine a most-probable set of stellar parameters with robust uncertainties derived from posterior probability distributions. In addition, we will employ a Markov Chain Monte Carlo analysis using SME, This MCMC is based on an affine-invariant ensemble sampler, making this analysis computationally feasible through the use distributed computing resources (massively parallel processing centers). This approach will allow us to efficiently probe large amounts of parameter space, marginalize over "nuisance parameters", effectively apply priors (e.g., an a priori temperature determination), determine confidence intervals, and easily identify problems with parameter convergence by visually inspecting their posterior distribution functions. By applying our new technique to determine stellar parameters for several different projects, including a large survey of potential exoplanet host stars from the Kepler mission, our proposed analysis will provide valuable datasets of benchmark extrasolar systems which will lead to new insight into the nature of exoplanets in our Galaxy.\n' },
  { projectCode: 'TG-AST100035',
    cores: 1536,
    pi: 'Anatoly Spitkovsky',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'Princeton University',
    abstract: 'Collisionless non-relativistic shocks, such as the ones observed in Supernova Remnants (SNR), are thought to be the sources for energetic cosmic ray (CR) particles. Understand- ing the micro-physics of the shock transition, and the diffusive processes that are thought to be important for accelerating CR particles is the main topic of this proposal. Driven by recent results in this area, supported by a Teragrid allocation, we focus now on two closely-related projects: 1) the long-term evolution of high Mach number shocks, and the 3D effects of elec- tromagnetic turbulence on particle diffusion, and 2) the modeling of Laser-induced collisionless shocks in the laboratory. To this end, we will use two massively-parallel and multi-dimensional kinetic codes: Tristan-MP, a relativistic Particle-In-Cell (PIC) code, and dHybrid, a kinetic ion / fluid electron code. This study will answer fundamental physics questions, such as what is the long-term evolution of shocks, and how can SNR shocks accelerate both electrons and ions, and generate the enhanced magnetic fields inferred from observations. The first self-consistent 3D simulations of magnetized quasi-parallel shocks will also be performed. Finally, we focus on the particular details of laboratory Laser-induced shocks with the aim of optimizing on-going exper- iments, and to interpret experimental results. These laboratory produced shocks will provide unprecedented multi-point in-situ measurements of both magnetized and unmagnetized shocks, which so far have only been remotely observed (e.g., SNR shocks).' },
  { projectCode: 'TG-DMR080058N',
    cores: 96,
    pi: 'Ramamurthy Ramprasad',
    fos: 'Materials Research (DMR)',
    inst: 'University of Connecticut',
    abstract: 'Materials currently used in micro-electronic and photovoltaic devices are either rapidly reaching their limits of applicability, or display poor efficiencies to allow for cost-effective manufacture and usage.  Notable examples include (1) SiO2 gate dielectrics in MOSFETs, with thickness reaching less than 2 nm in the latest processors, preventing further scaling,  and (2) Si based solar cells that display less than 25% solar-to-electrical energy conversion efficiencies (and so cannot meet the DOE cost/performance standards).   New materials, and materials design motifs, are required to address these urgent problems.\n\nIn the problems identified above, the electronic structure at the interface between dissimilar materials, and their stability, play pivotal roles in determining many critical device properties. For instance, in MOSFETs, the interface between the Si substrate and the gate dielectric has to be stable, be devoid of defect states, and display at least a 1 eV nested (or Type I) valence and conduction band offsets to allow for minimal leakage currents across the gate stack. The interfacial stability and electronic structure are also critical in heterojunction quantum dots or quantum wires which are expected to lead to next-generation photovoltaic devices.  Here, a Type II (or staggered) offset between the conduction and valence bands of two different semiconductor materials on either sides of an interface is a requirement for efficient dissociation of photo-generated electron-hole pairs.\n\nRegardless of the specific application, it is important and useful to be able to reliably determine the atomic level physical structure across an interface between dissimilar materials, which is the starting point to compute their electronic structure (e.g., the valence and conduction band offsets). The main focus of the PI\'s efforts so far has been in the use of density functional theory (DFT) based techniques to study the stability, defect chemistry and electronic structure of a wide variety of interfaces, as described here. DFT simulations involving a few tens to hundred atoms have become somewhat commonplace today in most home-built linux clusters. Nevertheless, several interfacial systems relevant to the PIs research involve much larger systems containing few to several hundred atoms, and comprehensive studies of such systems will require a significantly larger infrastructure than is available locally at the PIs group.\n\nThis proposal reviews work performed in the PI\'s group using the current teragrid allocation, and describes the proposed work in the next year for which teragrid time is requested.\n' },
  { projectCode: 'TG-MCA06N030',
    cores: 1152,
    pi: 'Greg L. Bryan',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'Columbia University',
    abstract: 'In this proposal, we describe our planned research into three areas on the borderline between cosmology and astrophysics: (1) Clusters of galaxies, with a particular emphases on the interplay between hydrodynamics and gravity, (2) the formation and evolution of galaxies, again focusing on the gas content of galaxies, and finally (3) ideas for fragmentation in primordial mini-halos.  In each areas, we describe two detailed projects that we are planning to work on this year.  Although these areas are quite distinct and represent different timescales and physical conditions, they are (almost) all linked by the importance of multi-scale gas dynamics and cosmological evolution.  Therefore, for all projects but one, we will use the adaptive mesh refinement code Enzo, which is well suited to these problems.  We describe the scaling properties of the code, and then make and justify service unit requests for the six projects described.  This work is supported by three NSF grants and includes the thesis research of three graduate students.\n\n' },
  { projectCode: 'TG-MCA08X040',
    cores: 352,
    pi: 'Ivan Oleynik',
    fos: 'Materials Research (DMR)',
    inst: 'University of South Florida',
    abstract: 'This proposal requests new Teragrid LRAC allocation to perform large-scale atomistic simulations of materials. Our group has been successfully using Teragrid resources within MRAC allocations (grant # TG-DMR070018N) for several years, but increased research needs of our group dictated necessity to seek substantial expansion of allocation beyond 500,000 SUs. The major goal of our research is to perform groundbreaking computational experiments aimed at understanding fundamental atomic-scale properties of molecular and solid state material systems. This can only be achieved by using Teragrids powerful computational resources and excellent environment as an effective tool to perform a wide range of atomic-scale simulations. \nDuring the 2007-2008 allocation period, several important scientific breakthroughs have been achieved by using Teragrid facilities. They include\n\n1. Detailed investigation of energetic materials including their constitutive relationships, chemistry and mechanical properties;\n2. Studies of the reactive molecular dynamics during initial chemical events of shock-induced detonation;\n3. Detailed investigation of the molecular hysteresis switch and other non-linear single molecular devices to be used as components of future electronics and computer hardware.\nWe have also achieved important educational goals. The Teragrid computer resources were used by the PI, two postdoctoral associates, six graduate students, and two undergraduate students. Substantial expansion of PIs personnel requires increase of CPU allocation that is requested in the current proposal. \nTo achieve a broader impact of computational activities, the PI worked with a group of his colleagues from several Florida universities to develop a collaborative multi-institutional REU site with one of the nodes located at USF. The REU grant titled REU Site in Computational Materials Science: Designing Materials in a Virtual Laboratory was awarded by NSF in Spring 2008, with Prof. Oleynik as co-PI on this grant. Therefore, the LRAC allocation is critically important for the success of this REU program.\n\nImportant work has also been performed to improve parallel performance and scalability of computational tools used for simulations of materials. In particular, the MD-SHOCK code has been incorporated into the LAMMPS massively parallel molecular dynamics code, one of the best scalable and highly efficient MD codes in the world. This allowed us to achieve almost perfect scaling of large-scale MD simulations of shock wave propagation in materials.\nThis proposal will capitalize on substantial expansion of Teragrid computational power including an upgrade of Ranger, and arrival of the new Teragrid computer - NICSs Kraken. These new resources will allow us to perform exciting computational experiments with systems consisting of billions of atoms (micron-sized samples) up to a time scale of nanoseconds. These computational resources requested within LRAC allocation will play a critical role in several research projects funded by NSF and DoD. The computational program will concentrate on the following research thrusts:\n\n1. Shock annealing of electronic materials\n2. Nanomechanics of graphene nanstructures. \n3. Fundamental science of energetic materials.\n\nIn order to achieve the highest parallel and computational efficiency, we are requesting support of Teragrids computational personnel via the Advanced Support Program to help us to improve the speed and scalability of MDSHOCK/LAMMPS code for running on up to 10,000 cpus, as well as for effective management and processing of hundreds of terabytes of the output data generated in the course of our simulations. \n' },
  { projectCode: 'TG-MCB140210',
    cores: 192,
    pi: 'Jianhan Chen',
    fos: 'Biophysics',
    inst: 'Kansas State University',
    abstract: 'This new proposal requests computational resource to support two projects in the Chen lab at Kansas State University. Project 1 aims to combine experiment and simulation to characterize the structural details of a novel class of self-assembling branched amphiphilic peptide capsules (BAPCs) and to rationally design novel sequences with modified BAPC properties. Earlier development of BAPCs has been funded by NIH R01 GM074096 (2010-14), and a new R01 application for continual NIH funding is currently pending. Project 2 aims to understand the mechanism of molecular mechanism for facile binding of BH3-only protein Bim to the pro-survival protein Bcl-w using a combination of molecular modeling and kinetic and thermodynamic experiments, which is currently supported by a CAREER award from NSF, MCB 0952514 (2010-15).' },
  { projectCode: 'TG-CHE140012',
    cores: 16,
    pi: 'Eric J Schelter',
    fos: 'Inorganic, Bioinorganic and Organometallic Chemistry',
    inst: 'University of Pennsylvania',
    abstract: 'In this project, the electronic structures of high valent lanthanide and actinide complexes will be investigated using DFT methods. Computational analysis of electrochemical redox processes is expected to reveal factors that contribute to the stability of these metal ions in high oxidation states. The theoretical investigation will enable new chemistry and potentially facilitate enhanced selective separations relevant to the cost-effective isolation of high purity lanthanide elements and the reprocessing and remediation of spent nuclear fuel. ' },
  { projectCode: 'TG-MCB100146',
    cores: 176,
    pi: 'Mohammad Kaazempur-Mofrad',
    fos: 'Biophysics',
    inst: 'University of California, Berkeley',
    abstract: 'Mechanical phenomena affect nearly every aspect of cellular biology and function, yet the underlying mechanisms of how mechanical forces and biochemical signals interact is not clearly understood. In this proposal, we request for TeraGrid computational facilities to approach cellular mechanotransduction from a computational viewpoint and shed light on two important sub-cellular phenomena in which the role of mechanical factors are decisive: focal adhesion formation and nucleocytoplasmic transport. Individual molecules are suggested to be molecular mechanosensors at focal adhesions. These molecules alter their binding activity upon exposure to external force. We will investigate the validity of this suggestion and evaluate the mechanisms by which single molecules at focal adhesions could act as molecular mechanosensors. \nWhile our main focus in this proposal will be investigation of focal adhesion formation, we also aim to shed light on nucleocytoplasmic transport across the nuclear pore complex (NPC) using two different approaches: (1) all atomic simulations and (2) coarse-grained modeling. It is suggested that NPC tpr proteins interact with transport factors crm1 and importin-&#946;/&#945; to facilitate the cargo-complex translocation across the NPC. The alleged hydrophobic binding sites, however, are not determined yet. We suggest a thorough molecular dynamic simulation to find those sites. Results from this project could reveal possible mechanisms for facilitated transport. Taking into account the results of all-atomic simulations, we also will develop a coarse-grained model of the whole structure of the NPC to provide a big picture of nucleocytoplasmic transport and find out the specific role of some important factors in active transport, such as FG-repeat density in the pore, active cargo-FG hydrophobic binding affinity, aspect ratio of active cargo, and existing of competing factors within the pore for FG-repeat binding sites. The 9,900,000 SUs we are requesting will let us proceed with these projects and reveal important aspects of each of them at different scales. \n' },
  { projectCode: 'TG-ASC140045',
    cores: 256,
    pi: 'Robert L Campbell',
    fos: 'Advanced Scientific Computing (ASC)',
    inst: 'Pennsylvania State University Erie, The Behrend College',
    abstract: 'Wind turbine blades deform in response to spatially and temporally varying loadings from atmospheric boundary layer (ABL) turbulence.  Fluid-structure interaction modeling will be performed to assess the impact of 1) bend/twist coupling  2) blade nonlinear response, and 3) solver sub-iterations on the simulated power generation in the context of an atmospheric boundary layer.  The proposed simulations willl leverage existing capabilities at Penn State University, such as the ABL solvers, FSI solver, and the actuator line model (ALM) that have been successfully used to improve our understanding of wind turbine aerodynamic effects.  These focused FSI simulations will provide answers to at least the three fundamental questions described above, which are important for accurately simulating the coupled aeroelastic wind turbine response but have not yet been addressed by the community.' },
  { projectCode: 'VE-Snapoff',
    cores: 96,
    pi: 'Peixi Zhu',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'Center for Petroleum and Geosystems Engineering',
    abstract: 'Understanding the flow of viscoelastic fluids in porous media is important in many applications, especially enhanced oil recovery.  Current world recovery of hydrocarbons from primary and secondary recovery methods is only 30% of the original oil in place.  A large amount of oil remains trapped in the reservoir due to capillary resistance.  Snap-off (oil droplet splitting during its transport through porous media) is the most common residual oil trapping mechanism, especially in water-wet reservoir conditions.  Experiments showed that injection of viscoelastic (VE) fluid may have the potential to prevent or at least delay snap-off and consequently improve oil recovery.  However, the fluid dynamics mechanism of VE flow in porous media, especially at the pore scale, has not been fully understood.\n\nThe goal of the research to understand the effects of viscoelasticity on the snap-off of a Newtonian oil phase as it pass through a constriction.  Computational fluid dynamics (CFD) simulations will be conducted to simulation the flow proces.  To have a good representative of realistic pores, a tube with a converging/diverging throat in the middle is created and used as the computational domain.  This is a transient two-phase flow simulation, with viscoelastic fluid being the wetting phase and oil the non-wetting phase.  The hypothesis is that viscoelastic fluid has the potential to delay or even prevent snap-off from happening.  Such hypothesis will be proved or disproved by performing CFD simulation on a cluster and by comparing the results with that of the oil phase in a Newtonian medium.\n\nThe simulation will be performed with GOMA, an open-sourced finite element program developed by Sandia National Lab.  Due to the large number of fluid equations and complexity of the viscoelastic fluid model, fine meshes are required for the descritization of the flow domain and small time steps are also needed.  Furthermore, the non-linearity of the fluid model makes the system of equations very difficult to solve.  Therefore, parallel computing is highly in demand.' },
  { projectCode: 'TG-MCB090003',
    cores: 256,
    pi: 'Michael Feig',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Michigan State University',
    abstract: 'Multiple projects related to the modeling of biomolecular systems are proposed. 1) Molecular dynamics simulations of MutS and MSH2-MSH6, large proteins involved in DNA mismatch recognition and the initiation of repair, would provide a detailed mechanistic understanding of how damaged DNA is recognized and how that recognition leads to the initiation of downstream repair events. In particular, simulations would compare the effect of different nucleotides bound to the ATPase domains and the effect of binding to regular DNA vs. mismatched DNA and no DNA. 2) In order to understand regulation of sarcoplasmic reticulum Ca2+-ATPase (SERCA) by phospholamban (PLB) at the molecular level, replica exchange implicit membrane simulations of the SERCA-PLB complex are proposed. Such simulations would provide information about the interaction of PLB with SERCA as a function of PLB phosphorylation and as a function of SERCA state (active E1 vs. inactive E2 form). 3) As part of efforts to develop an intermediate-level coarse-grained model of proteins that is ultimately targeted at protein structure refinement, a series of long test simulations of selected proteins are proposed. Thsee simulations would allow extensive testing and further improvements of an initial version of the coarse-grained model.\n ' },
  { projectCode: 'TG-AST140004',
    cores: 384,
    pi: 'Sharanya Sur',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'Arizona State University',
    abstract: 'We request a total of 5.65 million Service Units (SU) of computing time on the Stampede \nsupercomputer in support of NSF award 1103608 for "Simulating Galaxy Formation with \nFewer than a Trillion Zones". With the requested resources, we wish to perform 3D high \nresolution non-ideal magnetohydrodynamics (MHD) simulations of turbulent mixing in \nmagnetized media using the publicly available adaptive-mesh refinement code, FLASH \n(version 4.0). The science objective of this proposal is  understanding \nthe overall efficiency of the mixing process in the presence of an evolving magnetic field, \nthe possible dependence of the mixing timescale on the magnetic field evolution, and the \n3D structure, of the magnetic field and the scalar concentration field. The results from this \nstudy will have far reaching implications on metal enrichment in both the present and the \nhigh-redshift Universe.' },
  { projectCode: 'TG-MCA06N060',
    cores: 6512,
    pi: 'Emad Tajkhorshid',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'University of Illinois',
    abstract: 'In this renewal application, we request time to continue our investigation of the mechanism of several membrane transporters and channels using simulation methodologies. Several active transporters that use various source of energy in a living cell for their function will be investigated. Furthermore, we will also continue our research on another membrane associated phenomenon, namely mechanism of membrane binding and activation of blood coagulation factors, which constitutes the most productive project over the past funding period, and a strong collaborative effort between 5 labs at UIUC.  In fact, all of the projects are conducted in close collaboration with leading experimental groups.   All Projects address rather slow processes, thus, requiring long simulations. Furthermore, due to the need of explicit representation of the lipid and water, which play role in the mechanism of transporters, and due to the complexity of the structure, large molecular assemblies need to be simulated. Such calculations can only be carried out with the advanced TeraGrid computational resources. The size and\ncomplexity of the function of these proteins pose a great challenge for computational studies. Over the last funding period, however, we have demonstrated through several published papers reported in the Progress Report, that large scale MD simulations can indeed significantly advance our understanding of the molecular mechanisms of energy coupling and transport phenomena in these biomolecules. Due to limited space and the need to describe 6 projects, we have delegated the progress and discussion of our preliminary results\ncompletely to the Progress Report. Our extensive use of the allocation over the past funding period is the strongest evidence for the computational demands of such biomolecular systems. We note, however, that we have used the allocated time extremely productively and produced a record number of publications (16; please see Progress Report) over the past funding cycle. We would like to give a general clarification with regard to the length of the proposed simulations, which might be perceived as an "unjustified" aspect. All of the projects address rather slow biomolecular processes (at least on the\norder of microsecond). As such, even orders of magnitude longer simulations than those described in this application\ncan be easily justified from a technical point of view. However, we realize that such processes (e.g., complete transport cycle) cannot be currently described in their entirety, and we can only expect to cover some of the steps involved in such processes. Therefore, in order to provide a justification that will hopefully\nbe satisfactory, almost in all cases we will base the length of the proposed simulations on our existing benchmarks (mostly published) of the same or comparable systems/phenomena. \n\n' },
  { projectCode: 'TG-AST100038',
    cores: 256,
    pi: 'Robert T. Fisher',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'University of Massachusetts, Dartmouth',
    abstract: 'n/a' },
  { projectCode: 'TG-ATM120034',
    cores: 128,
    pi: 'Michael Pritchard',
    fos: 'Atmospheric Sciences (ATM)',
    inst: 'University of California, Irvine',
    abstract: 'I seek a 1.53M SU allocation on the NICS Kraken Cray XT5 system to renew a promising line of research into the basic dynamics of the Madden-Julian Oscillation. I, the PI (Pritchard) began the prior work that paved the way for this project in Nov. 2011, under postdoctoral mentorship with the prior Co-PI (Bretherton), under the allocation TG-120034, and has since begun an Assistant Professor position at the University of California, Irvine. I am now seeking to expand promising lines of inquiry with a renewal allocation.\n\nThe proposed renewal work remains in close collaboration with the Center for Multi-Scale Modeling of Atmospheric Processes (CMMAP), a Science and Technology Center that has been supported by the National Science Foundation since July 2006. CMMAP developed the key simulation technology  the Multi-scale Modeling Framework (MMF)  that I will employ for research. I am an alumnus and active member of the CMMAP community. \n' },
  { projectCode: 'Channels',
    cores: 640,
    pi: 'Irina I Serysheva',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'University of Texas Health Science Center at Houston',
    abstract: 'Our research aims to understand molecular mechanisms underlying transport of molecules into and out of the cell across the surface membrane, or between different intracellular compartments through structure-functional studies of integral membrane proteins known as ion channels, and the macromolecular complexes they form. Ion channels regulate many diverse biological functions that include muscle contraction, hormone secretion, gene transcription, metabolic regulation, neurotransmitter release, fertilization and apoptosis. The knowledge about the three dimensional (3D) architecture of ion channels is required to understand molecular basis of ion channel gating (opening/closing process), and how this process is controlled by a wide variety of endogenous molecules and pharmacological modifies. To answer these questions we use a combination of electron microscopy and computer reconstruction techniques in conjunction with biochemical, electrophysiological and molecular biological approaches. Our structure research efforts include: 1) purification of ion channels from natural sources or from high-level expression systems; 2) electron cryomicroscopy (cryo-EM) of the purified channel assemblies; 3) computer image processing and 3D reconstruction; 4) structure analysis and annotation using combination of visualization and computational tools; 5) prediction of functional roles of the identified structural domains via bioinformatics. \nRecent focus has been on structural analysis of Ca2+ channels that mediate ligand-gated release of Ca2+ from intracellular stores: the ryanodine-sensitive Ca2+ release channel (RyR), the primary Ca2+ release channel in muscle cells, and the inositol 1,4,5-trisphosphate-sensitive Ca2+ release channel (IP3R), localized in the endoplasmic reticulum. Both channels are large tetrameric protein complexes with a molecular mass of ~2.3 MDa for RyRs and 1.2 MDa for IP3Rs. Defects in these channel proteins cause abnormal regulation of cell Ca2+ level underlying numerous human diseases: Malignant Hyperthermia, Central Core disease, cardiac hypertrophy, heart failure, hereditary ataxias, Huntingtonâ€™s disease, Alzheimerâ€™s disease, osteoporosis, atherosclerosis and some migraines.' },
  { projectCode: 'TG-OCE120008',
    cores: 96,
    pi: 'Meng Xia',
    fos: 'Physical Oceanography',
    inst: 'University of Maryland, Eastern Shore',
    abstract: 'The goals of the NSF CREST Center for the Integrated Study of Coastal Ecosystem Processes and Dynamics in the Mid-Atlantic Region are to: Understand, model and predict the effects of land use and climate change on the mid-Atlantic coastal ecosystems. Improve infrastructure for research and education in marine and environmental sciences. Increase public awareness of the interdependence of humans and the coastal environment.\nThe research team will focus on five important components of the aquatic ecosystem, all of which have economic and environmental implications for people living in coastal areas: (1) The effects of land use and climate change on water quality, (2) the response of microscopic algae and seaweed, including harmful species, to water quality changes (3) dynamics of zooplankton (microscopic animals floating in water) populations, which serve as food for commercially and ecologically important fish species (4) the effects of the recurring problem of low dissolved oxygen and pollution on fish populations such as Atlantic croaker, and (5) the effects of water quality changes on the infection of blue crab by the parasite Hematodinium and on blue crab distributions in Marylands coastal bays. These projects will contribute to our understanding of the coastal environment and the ways organisms respond to changes in their environment. ' },
  { projectCode: 'Nanoparticles',
    cores: 48,
    pi: 'Miguel Jose-Yacaman',
    fos: 'Materials Research (DMR)',
    inst: 'University of Texas at San Antonio',
    abstract: 'The nanomaterilas are having agreat impact in industry .It is necessary to advance the application by applying advanced DFT calculations to solve the structural problems in \nNanoparticles \nNanowires \nstellated particles \nIn this proyect we will study nanoparticles of metals such as gold ,Platinum and silver ffinding the properties from first principles .' },
  { projectCode: 'TG-AST140027',
    cores: 5120,
    pi: 'Doron Kushnir',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'Institute for Advanced Study',
    abstract: 'Type Ia supernovae (SNe) are an important and significant class of SNe, consisting about half of the observed SNe and providing valuable cosmological standard candles, that allowed the recent discovery that the expansion of the Universe is accelerating. While it is known that these events result from the thermonuclear explosions of white dwarfs (WDs), there is currently no satisfactory scenario to achieve such explosions. The collisions of WDs in triple systems is a promising new channel for these explosions. We propose to preform a comprehensive set of 3D, hydrodynamic+thermonuclear-burning simulations of direct collisions of WDs to study the possibility that the resulting explosions are the main source of type Ia SNe. The physics involved is well known and the successful explosion of the important subsample of zero-impact collisions has been firmly established by using 2D simulations, and shown to reproduce main features of observed type Ia SNe. The proposed comprehensive study which includes various combinations of WD masses and the full range of impact parameters, is 1. possible, 2. crucial for validating or ruling out this channel and 3. was never done before.' },
  { projectCode: 'TG-MCB140281',
    cores: 16,
    pi: 'Charles G Danko',
    fos: 'Genetics and Nucleic Acids',
    inst: 'Cornell University',
    abstract: 'High-throughput approaches which illuminate the epigenetic basis of human disease are widely anticipated to usher in a new era of information-based precision medicine, with broad applications in basic research, clinical diagnostics, and treatment.  The central objective of my lab\'s research is to develop novel bioinformatic methods that identify the type and boundaries of all varieties of active functional elements.  We also seek to apply these tools to understand the basis of gene regulation.\n\nWe foresee two key goals to be addressed in the next year:\n  Develop and optimize a machine learning approach, based on artificial neural networks, that accurately classifies the type of epigenetic element using functional genomic data.  \n\n  We have used a genomic assay called PRO-seq to map functional elements in CD4+ T-cells isolated from humans, chimpanzees, and rhesus macaques. These maps provide a rich source of data profiling both expression levels, and the location and activity of regulatory elements across 25 million years of primate evolution. Using this data, we hope to understand how differences in gene expression arise from changes in DNA sequence, and how evolutionary pressures have shaped the human adaptive immune system during the last 25 million years.' },
  { projectCode: 'ABM',
    cores: 512,
    pi: 'Xiaobo Zhou',
    fos: 'BIOLOGICAL SCIENCES (BIO)',
    inst: 'The Methodist Hospital Research Institute',
    abstract: 'To-be finished' },
  { projectCode: 'TG-CCR140017',
    cores: 384,
    pi: 'Robert A. Latour Jr.',
    fos: 'Computer and Computation Research (CCR)',
    inst: 'Clemson University',
    abstract: 'Protein adsorption to material surfaces is of critical importance in numerous applications in biomedical engineering and biotechnology. Empirical force field molecular simulation methods have great potential to help researchers understand and predict protein adsorption behavior at the atomic level.  However, these methods must first be developed, evaluated, and validated before they can be confidently used.  In particular, the Latour group has shown that tuned interfacial force field (IFF) parameters are needed to accurately represent the interactions between the amino acids that make up a protein and functional groups of a surface.  Latour (PI) and Snyder (coPI) have recently tuned a set of IFF parameters for amino acid interactions with silica glass.  The next stage in this research is to apply this IFF parameter set to assess its ability to accurately represent protein adsorption on a silica glass surface. Ribonuclease A will be used as our model protein, for which we have generated an experimental data set that can be used to assess simulation results.  Because of the large size of the system involved and the rugged energy landscape that must be sampled to provide ensemble average properties for comparison with experimental results, we will use for these simulations an advanced replica-exchange sampling method (TIGER2) along with massively parallel simulations using LAMMPS modules that we specifically developed for the simulation of this type of complex mixed-phase hybrid biomolecular system.  The results from these simulations will enable us to assess the ability to accurately predict protein adsorption behavior, which has been a sought-after goal in the biomaterials field for many decades.' },
  { projectCode: 'TG-CHE130010',
    cores: 64,
    pi: 'Andreas Goetz',
    fos: 'Chemistry (CHE)',
    inst: 'University of California, San Diego',
    abstract: 'I request supplemental computer time to be able to continue simulations for two separate research projects that are funded through NIH and DOE. The supplement is required because simulations for one project required more SUs than anticipated and for the other project unexpected results were obtained that require follow-up investigation. The allocation is currently exhausted and this supplement is necessary to obtain results that can be published. Using the supplement I will 1) continue state-of-the-art density functional theory (DFT) based quantum mechanical (QM) simulations of the active site of cytochrome c oxidase (CcO) to investigate the mechanistic steps that are involved in chemical bonding and electron/proton flow to oxygen within the FeCu dinuclear complex of the CcO active site and how this leads to proton pumping across the membrane. I will use the OLYP GGA functional that I have identified over the last months as reliable and superior to all other tested functionals for this system. 2) I will continue adaptive, buffered-force, mixed QM and classical molecular mechanical (abfQM/MM) simulations that aim at showing the advantages of abfQM/MM over conventional QM/MM simulations. I will investigate a nucleophilic substitution reaction of a phosphate in aqueous solution, which is expected to show a large difference to conventional QM/MM and thus is better suited than the initially selected example of the reaction catalyzed by chorismate mutase.' },
  { projectCode: 'TG-MCA08X002',
    cores: 64,
    pi: 'Bruce J. Berne',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Columbia University',
    abstract: 'We request a renewal of our allocation of computer time to conduct simulations investigating how fluid packing, water hydrogen bonding directionality, and correlated protein motions modulate protein-ligand binding affinities and protein structure. We plan to use this time to continue developing our method of quantifying the free energy contributions of these effects through the construction of a displaced solvent functional (DSF), and expand the project to include exciting work we have started to quantify the importance of non-additivity in protein-ligand binding and the effect of electrostatics, and also we intend to study the effects of water energetics and displacement on ligand binding and catalysis in several important enzymes. This project will make extensive use of explicitly solvated classical molecular dynamics (MD) simulation. With collaborators, we have implemented the DSF method in the Desmond MD software suite, which scales very efficiently for parallel MD and has allowed us to make efficient use of the TeraGrid supercomputing environment.' },
  { projectCode: 'TG-MCB110061',
    cores: 1536,
    pi: 'Edward Lyman',
    fos: 'Biophysics',
    inst: 'University of Delaware',
    abstract: 'An allocation of 4.7 million SU\'s is requested for two projects in membrane protein simulation and membrane biophysics. The first aims to apply, apparently for the first time, "rejection-free" Monte Carlo algorithms from condensed matter physics to study demixing of physiological mixtures of lipids and sterols. The second project seeks to rationalize how the membrane environment modulates the function of the A2A adenosine receptor, in collaboration with an experimental colleague in chemical engineering in Delaware. This is the PI\'s first allocation request, though he has extensive experience in massively parallel molecular dynamics on TeraGrid resources as a member of the Voth group. The allocation will support several proposals to the NSF and NIH, including an NSF BRIGE proposal, to be submitted on Jan 22, one week after the PI\'s appointment at Delaware begins. ' },
  { projectCode: 'TG-CTS090004',
    cores: 4352,
    pi: 'Daniel Bodony',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Illinois',
    abstract: 'The goal of this research is twofold: (i) to understand the role of turbulence in the generation of sound in modern aircraft turbo-machinery, and (ii) to develop computational methods for controlling the sound.   It is well known that certain geometrical modifications to aircraft engines can reduce their radiated noise.  However, there is no manner to predict which modifications will actually reduce the noise, resulting in lengthy---and costly---experimental programs to parametrically study candidate design modifications.  This deficiency is due to the conceptual, experimental, and computational challenges associated with turbulence-generated sound and, hence, in developing effective control methods.  By solving the compressible Navier-Stokes equations directly, this research provides foundational descriptions of the sound-generating fluid motions and subsequent development of optimized control methodologies.  The PI\'s code is based on advanced finite difference techniques and scales at 90\\% of perfect up to 1024 processors on TACC\'s Ranger.  This work follows up the previous DACs TG-CTS080019 (DJB) and TG-CTS080030N (JBF).  Financial support for this work is provided by three separate grants from NASA and the AeroAcoustics Research Consortium on which the current investigators are PI\'s or co-PI.  It builds upon large-scale aeroacoustic simulation work from past NASA and AFOSR grants.  Total requested allocation is 14,000K SUs.' },
  { projectCode: 'TG-MCA04N033',
    cores: 512,
    pi: 'Yiannis N. Kaznessis',
    fos: 'Biophysics',
    inst: 'University of Minnesota',
    abstract: 'n/a' },
  { projectCode: 'TG-DMR140031',
    cores: 1120,
    pi: 'Aldo Romero',
    fos: 'Materials Research (DMR)',
    inst: 'West Virginia University',
    abstract: 'n/a' },
  { projectCode: 'TG-PHY130014',
    cores: 576,
    pi: 'David P Landau',
    fos: 'Physics (PHY)',
    inst: 'University of Georgia',
    abstract: 'Recently, we developed a parallel replica-exchange framework for Monte Carlo simulations based on Wang-Landau sampling. Without any loss of precision, the method gives significant speed-up and is suitable for large-size applications. We determined the scaling of our approach using computer time from our actual XSEDE startup grant.\n\nWe propose to apply the method to the self-assembly process in different amphiphilic solutions concentrating on the lipid-bilayer formation (Project I) and to study the effect of muations in the primary structure of proteins in the HP model (Project II).\n\nIn Project I, we will perform replica-exchange flat-histogram simulations in 2 dimensions to obtain a joint density of states g(E,rho), where rho is the lipid concentration in the system. We anticipate a splitting of the energy and lipid-concentration range into ~500 individual simulation windows. Additionally, each of these windows will be sampled by a number of the order of 10 Wang-Landau walkers to reduce statistical errors during the simulation.\n\nIn Project II, we will perform parallel Wang-Landau simulations for all possible mutations of three particular HP proteins, known to have low ground-state degeneracies. Based on that, extensive ground-state searches will be performed.\n' },
  { projectCode: 'TG-MCA01S027',
    cores: 288,
    pi: 'Thomas Cheatham',
    fos: 'Cross-Disciplinary Activities (CDA)',
    inst: 'University of Utah',
    abstract: 'We propose to continue our studies of biomolecular structure, dynamics and interaction focusing on exposing and overcoming limitations in the empirical force fields and simulation methods.  Our application areas center on nucleic acids and proteins, in their native environment, including interaction with other ligands, solvent, ions, and drugs.  Our primary application code is AMBER and its specially optimized parallel version, PMEMD.  Some studies involve NAMD or CHARMM as well.' },
  { projectCode: 'TG-MCA05S027',
    cores: 96,
    pi: 'Joan-Emma Shea',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of California, Santa Barbara',
    abstract: 'Alzheimer\'s disease, one of the leading causes of dementia, is caused by the pathological self-assembly of the 40 to 42-long Alzheimer Amyloid-beta(Ab) peptide into aggregate species. Aggregation is believed to be nucleated at a turn region located in the 21-30 segment of this peptide and mutations of residues E22 and D23 have been shown to affect the ability of these peptides to aggregate. We propose to perform replica exchange molecular dynamics simulations on E22 and D23 mutants of the 21-30 fragment of the (Ab) peptide to investigate how these substitutions affect the folding mechanisms and conformations of these peptides and in turn their aggregation propensities.' },
  { projectCode: 'TG-DMR140129',
    cores: 4128,
    pi: 'Sharon C Glotzer',
    fos: 'Materials Research (DMR)',
    inst: 'University of Michigan',
    abstract: 'We request XSEDE resources to perform high performance, parallel GPU and CPU enabled Monte Carlo and molecular dynamics simulations of colloidal crystallization and self-assembly. 24.14M SUs are requested to investigate solid-solid phase transitions, complex crystal nucleation, binary mixtures, plastic-solid phase transitions, depletion-driven assembly, assembly of concave particles, driven systems of colloids, and other soft matter assembly systems, for the purposes of elucidating and engineering the thermodynamic-driven and non-equilibrium assembly of nanoparticle and colloidal systems. All projects described are funded by four grants from the National Science Foundation, two NSF graduate student fellowships, one grant from the U.S. Department of Energy, one grant from the Army Research Office, and a five-year grant from the Simons Foundation. Using our HOOMD-blue particle simulation code along with the HPMC plugin for hard particle Monte Carlo and the DEM plug in for molecular dynamics simulations of hard shapes, we will run simulations of anisotropic hard particles, point particles with interaction potentials and other interactions to sample equilibrium and dynamic properties of these systems. The SUs requested will support the PhD thesis research and postdoctoral research of 27 young computational physicists, materials scientists, chemical engineers, and macromolecular scientists in the Glotzer Group at the University of Michigan. Our request amounts to roughly 894,000 SUs per person.' },
  { projectCode: 'TG-MCA93S001',
    cores: 256,
    pi: 'B MONTGOMERY PETTITT',
    fos: 'Chemistry (CHE)',
    inst: 'University of Texas Medical Branch',
    abstract: 'We will use 2 methods, molecular dynamics simulations and diagrammatic theory, to study the properties of proteins and nucleic acids in aqueous saline solution. The molecular dynamics simulations will be used to interpret structural\nand thermodynamic experimental data for the biopolymer projects. Using recent classical force eld models these systems will be simulated with molecular dynamics using programs developed in this lab. \nThe following ongoing scientic projects of biochemical/biotechnological signicance related to the this renewal\nare described: 1)Salt effects in Peptide and Protein Solutions: non-ideal behavior, 2)DNA melting 3)Evaluation of probability densities by integral equations.\nThese are an ongoing set of funded projects. Considerable progress has been made with the last allocation and we\nexpect to finish the supplemental allocation before the end of this quarter. Several manuscripts have been and are being\ncompleted; these are listed in a separate section of this document along with progress on code optimization.' },
  { projectCode: 'Nano-Bio-Membrane',
    cores: 384,
    pi: 'Xubo Lin',
    fos: 'Biophysics',
    inst: 'University of Texas Health Science Center at Houston',
    abstract: 'Nowadays, nanoparticles have broad applications in biomedical field, such as drug delivery, molecular imaging, artificial enzymes, etc. In other words, nanoparticles can easily access cell and affect its functions. Cell membrane is an important biological barrier of cell, which also participates and regulates various kinds of biological processes.  Thus, it is very important to probe the interactions between nanoparticles and cell membrane. However, it is difficult to obtain the detailed interaction information on molecular level using current experimental methods. Hence, in my project, I will perform molecular simulations (mainly molecular dynamics simulations) to visualizing the detailed dynamics of the interaction processes and help explain the interaction mechanisms, which are difficult for the experiments and will provide useful insights for the experiments.' },
  { projectCode: 'Scramjet-combustion',
    cores: 512,
    pi: 'Philip Varghese',
    fos: 'Chemical Reaction Processes',
    inst: 'Department of Aerospace Engineering and Engineering Mechanics',
    abstract: 'Motivated by the nature of flows inside scramjet engines, we ask the following question:\nCan we use thermal nonequilibrium that is naturally present in the flow to fundamentally\nalter the performance of the engine? There is evidence that vibrationally excited molecules have very different reaction rates than predicted by conventional chemical\nkinetics models developed for gas-phase combustion. Vibrational nonequilibrium also\nleads to thermal energy transport and deposition to regions of the flow far from the source of vibrational excitation. This energy exchange could affect turbulent mixing, and hence the fundamental structure of turbulent flames. We hypothesize that these combined effects of modified chemistry and energy exchange across scales will fundamentally alter\nthe Kolmogorov turbulence cascade as well as models used for the flame structure in\nboth non-premixed and premixed systems. We further argue that creating vibrational\nnonequilibrium in a flow may provide a means to control reaction rates thereby facilitating favorable reactions or inhibiting undesirable ones.\n\nWe will explore the use of vibrational nonequilibrium as a means to control reacting gasphase systems with applications ranging from materials synthesis to scramjet combustion. The program has two main targets: 1) Understanding the laminar flame structure in diffusion flames, when one of the flow streams is vibrationally activated, and 2) understanding the impact of vibrational nonequilibrium on the turbulence energy cascade and flame propagation in turbulent flames. Current experimental and computational tools are inadequate to isolate thermal nonequilibrium effects from other interactions. We propose to use high-fidelity Raman measurements to quantify the degree of vibrational nonequilibrium. Laser diagnostic tools will be used to characterize this flame structure under varying levels of nonequilibrium. Since even these measurements only provide limited access to the flame physics, direct numerical simulations (DNS) will be used to analyze the energy cascade and vibrational energy transfer. A novel inhomogeneous master equation method will be developed to couple quantum chemistry computations to macroscopic flame simulations.' },
  { projectCode: 'TG-MCB100139',
    cores: 480,
    pi: 'Jeffery B Klauda',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'University of Maryland, College Park',
    abstract: 'The research focus in this XSEDE Computational Proposal involves membrane-associated proteins that span the membrane (transmembrane) or attach to the membrane (peripheral) to transport substrates between cellular organelles and lipid-only membrane models. For lipid-only simulations, we propose to develop models for the endoplasmic reticulum (ER) and plasma membrane (PM) in yeast that better represent in vivo membranes. All-atom molecular simulations are proposed for three secondary active transmembrane proteins, i.e., lactose permease (LacY), the sodium-hydantoin transporter (Mhp1), small multidrug resistance transporter (EmrE). The main objective for the LacY research is to use QM/MM methods to understand possible pathways for proton translocation during the proteins transport cycle. For Mhp1, we aim to test a new simulation method that can be used to predict unknown conformations of transmembrane proteins. This protein is an ideal test case because the outward-facing, outward-facing occluded and inward-facing structures have been determined from x-ray diffraction. Studies on EmrE will probe the structure and function of this protein. Another objective is to study the attachment mechanism of Osh4 to ER and PM of yeast. Osh4 is a member of an important class of oxysterol binding protein homologues that transfers sterols and a signaling lipid between organelles. Since all three projects are computationally demanding, the only way we can tackle these projects is to obtain a significant allocation on XSEDE.' },
  { projectCode: 'TG-AST090107',
    cores: 128,
    pi: 'Travis Metcalfe',
    fos: 'Astronomical Sciences (AST)',
    inst: 'Space Science Institute',
    abstract: 'n/a' },
  { projectCode: 'TG-CTS110007',
    cores: 32,
    pi: 'Baskar Ganapathysubramanian',
    fos: 'Interfacial, Transport, and Separation Processes',
    inst: 'Iowa State University',
    abstract: 'n/a' },
  { projectCode: 'TG-MCB120155',
    cores: 1296,
    pi: 'Andras Fiser',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Albert Einstein College of Medicine',
    abstract: 'Genes expression is regulated by proteins called transcription factors\n(TFs). It is important to know how these molecules interact with DNA\nand to be able to predict the specific set of sequences (binding\nsites) that they recognize. Knowledge of TF binding sites can help us\nfurther our understanding on how genes interact with each other to\ncoordinate functions temporally in the cell. A few hundred TFs have\nknown (experimentally determined) binding sites, but a few thousands\nmore remain unknown. Computational approaches can be used to discover\ntranscription factor binding sites.\n\nIn silico modeling TF binding sites: Based on a crystal structure of a\nTF-DNA complex we model all possible mutations to the DNA sequence by\nreplacing DNA bases. The resulting structures are scored using a\npair-wise statistical potential and the best scoring sequences are\nused to generate position specific weight matrices to model TF binding\nsite preferences.\n\nOnly a handful of transcription factor structures bound to DNA have\nbeen experimentally characterized. We use homology modeling techniques\nto generate structures of TFs for which only their sequences are\nknown. In this manner, we can model the remaining TFs and predict\ntheir binding preferences to DNA to gain insight into entire gene\nregulatory networks.\n\nBenchmarking the method: Experimentally determined TF binding sites\nare deposited in various databases and can be readily used to\nbenchmark our computational approach. The JASPAR database collects TF\nbinding sites that have been determined using several different\nmethods,  such as systematic evolution of ligands by exponential\nenrichment (SELEX), bacterial one hybrid, literature compilations,\netc. Whereas the UniPROBE database contains experimental binding sites\nderived exclusively from protein binding microarrays (PBMs).\n\nWe use a chi-square method (Schones et al., Bioinformatics\n21-3:307-313, 2005) to compare two position weight matrices (PWMs) and\npresent the results in the form of statistical z-scores to correct for\ndifferences in PWM length.\n\n\nWe will also test the limits of our predictions by generating homology\nmodels of TFs whose sequences have known PWMs but no crystal\nstructures. \n' },
  { projectCode: 'TG-DMR070072N',
    cores: 112,
    pi: 'Chris G Van de Walle',
    fos: 'Materials Research (DMR)',
    inst: 'University of California, Santa Barbara',
    abstract: 'We propose to apply Teragrid computing resources to investigate oxide and nitride semiconductors, hydrogen storage, and novel CMOS materials. We will apply state-of-art first-principles computational methods based on density functional theory to investigate the atomistic features and the electronic structure of surfaces, interfaces, native defects, and impurities in technologically important oxide and nitride semiconductors, non-classical CMOS materials, and complex hydrides.  Our group has a strong record in the research of wide-band-gap semiconductors, doping and defect physics, semiconductor surfaces and heterojunctions.  There are currently 12 researchers in our group,  including 1 university faculty, 1 project scientist, 1 associate specialist, 4 postdocs, and 5 Ph D students.  Our research is funded by external grants from NSF, DOE, the UCSB Solid State Lighting and Energy Center, the ACS Petroleum Fund and the Semiconductor Research Corporation.  In this proposal we are requesting a total of 1,115,000 Teragrid SUs for the year 2009.' },
  { projectCode: 'TG-DMR140035',
    cores: 48,
    pi: 'Paul M Voyles',
    fos: 'Metals, Ceramics, and Electronic Materials',
    inst: 'University of Wisconsin',
    abstract: 'We request 1,000,000 SUs on the TACC Stampede resource to support hybrid reverse Monte Carlo (HRMC) structural refinements of bulk metallic glasses.  The HRMC simulations will combine information about nearest neighbor distances and bonding (short-range order) from empirical interatomic potentials with information about nanometer-scale atom packing and organization (medium-range order) from fluctuation electron microscopy experiments.  This combined approach circumvents the limitations of either pure experiments or pure simulations to arrive at highly realistic metallic glass structural models.  Those models will be used to understand the structure that underlies the plastic deformation and glass-forming ability of various metallic glass alloys and will play an important part in a rational design strategy for new metallic glasses.' },
  { projectCode: 'TG-CTS100002',
    cores: 128,
    pi: 'Rajat Mittal',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'Johns Hopkins University',
    abstract: 'Heart disease is the single most consequential disease in the industrialized world and current trends point to a worsening outlook. The thesis of the current research is that transformative ideas in modeling, computation and analysis of cardiac blood flows and associated heart sound can enable highly effective and inexpensive simulation-guided therapies and diagnostic tools for heart diseases in the not-too-distant future. Understanding cardiac flows, especially inside the left ventricle, is an essential first step to diagnosing and treating several heart related diseases. Numerous efforts have been made in analyzing cardiac flows over the past two decades through in-vitro (e.g., laboratory PIV measurements), in-vivo (e.g., phase contrast MRI) experiments and computational methods. Though medical imaging techniques such as phase contrast MRI, CT, etc., provide details about the anatomy and some gross features of the flow, not much insight related to complex fluid behavior can be obtained using these approaches. Most of the computational and laboratory (in-vitro) studies have employed simplified geometries while attempting to match physiological values in terms of key hemodynamic parameters, and ignored pivotal interactions between heart flexible tissues, especially heart valves, and complex flow patterns inside heart chambers. The long-term goal of the current project is to develop image-based, biophysically-detailed, multi-scale, multi-physics models of the ventricular blood flows in health and disease that run efficiently on large-scale, CPU/GPU clusters, and to use these models to understand the biophysics of cardiac dysfunction. In this year, we will i) validate the computational modeling of cardiac flow against the in-vivo MRI measurements, ii) investigate the effect of structural dynamics of heart valve and its interaction with hemodynamics, and iii) biochemical process on the development of heart diseases.' },
  { projectCode: 'TG-AST140023',
    cores: 512,
    pi: 'Claude-Andre Faucher-Giguere',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'Northwestern University',
    abstract: 'n/a' },
  { projectCode: 'TG-MCB140130',
    cores: 320,
    pi: 'Robert A Farley',
    fos: 'Biophysics',
    inst: 'University of Southern California',
    abstract: 'Molecular dynamics (MD) simulations are powerful tools with which to investigate questions regarding mechanisms of action in different solute transporters and ion channels whose structures are known with atomic level resolution. This application requests access to computational resources that are needed to perform MD simulations of biological transport systems of this size. Specifically, we are investigating mechanisms of ion selectivity in both K+-selective and in Na+-selective ion channels. Preliminary results obtained from non-equilibrium MD simulations of ion selectivity in the K+-selective channel KcsA were used to propose a mechanism of ion selectivity based on selective exclusion of ions from the selectivity filter of the channel. This model is supported by recent preliminary results obtained simulating the movement of Na+ and K+ through the Na+-selective channel NavAb. These preliminary simulation results were obtained on Stampede using a startup allocation through the XSEDE portal, and the USC High Performance Computer Cluster (HPCC). The resources of HPCC are not sufficient to allow us to continue the work with longer simulation times and multiple ions in the channel, however, and the application requests resources available at TACC to continue the project. Details of the simulations of each of the projects that will be investigated using resources available through XSEDE are described in the Research Plan of this application, together with justification for the request.' },
  { projectCode: 'TG-CTS120002',
    cores: 272,
    pi: 'Sedat Biringen',
    fos: 'Advanced Scientific Computing (ASC)',
    inst: 'University of Colorado',
    abstract: 'The proposed resource request involves the control of spatial and periodic instabilities in both transitional and fully turbulent channel flow using direct numerical simulation (DNS). This work is fully funded under NSF-IDR Award No. 1131802. We plan to further explore the control of spatial instabilities using passive periodic structures for both channel flows and boundary layers with cross flow. We also plan to investigate the turbulent drag reducing capabilities of these passive periodic structures in fully turbulent channel flow.  Results from the current allocation will soon appear in journal articles and have been accepted for presentation at national conferences. Given these topics of study, an allocation of 1,000,000 SUs and 2 TB of storage space on the NICS Kraken super-computer is requested.    ' },
  { projectCode: 'TG-DMR140063',
    cores: 640,
    pi: 'Zi-Kui Liu',
    fos: 'Materials Research (DMR)',
    inst: 'Pennsylvania State University',
    abstract: 'This proposal is a request for the computing resources at XSEDE to perform first-principles calculations to investigate fundamental properties (diffusion coefficients, interfacial energies, finite temperature thermodynamic properties) of critical materials for energy and defense applications. This request is for 3,620k SUs on Stampede for a total of 5 PhD students and 3 postdocs. The research topics covered by this project are: 1. Study of advanced titanium-base alloys for next generation medical devices (280k SUs); 2. Ab-initio prediction of diffusion coefficients in Mg alloys (775k SUs); 3. Bulk and grain boundary diffusivities of oxygen in Ni-Al-Cr systems through first-principles and kinetic Monte Carlo approaches (517k SUs); 4. Prediction of mechanical and thermodynamic properties of Ni-base superalloys (400k SUs); 5. First-principle prediction of grain boundary energy in Fe alloys (449k SUs); 6. A first-principles study of stacking faults and long periodic stacking order structures in Mg and Mg alloys (240k SUs); 7. Thermodynamic properties of Li-Mn-Co-Ni-O system for battery applications (600k SUs); 8. First-principles calculation of thermodynamic and kinetic properties of CZTSSe solar absorber materials (360k SUs). Most of the projects are funded by National Science Foundation (NSF) with some funded by Department of Defense (DoD) Army Research Lab and Pratt-Whitney. The results obtained by first-principles calculations will be integrated with CALPHAD (CALculation of PHAse Diagrams) modeling to predict complex multi-component materials properties. The requested resources are for the proposed first-principles calculations, all of which will be performed using the VASP code, one of the most efficient and accurate density functional theory tools available. VASP is widely used on the XSEDE machines and runs efficiently on Stampede, which are where we are requesting SUs.' },
  { projectCode: 'TG-AST090105',
    cores: 2048,
    pi: 'Christopher Reynolds',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'University of Maryland, College Park',
    abstract: 'Accretion flows around black holes are believed to be driven by magnetohydrodynamic (MHD) turbulence that results from the magnetorotational instability (MRI).  We propose a series of simulations of black hole accretion flows aimed at addressing two basic questions.  Firstly, we will investigate the basic nature of the turbulence and the accompanying dynamo action in high resolution, global simulations of geometrically-thin disks using the energy-conserving ATHENA code.  The proposed simulations will be the highest-resolution global models of black hole accretion disks run to date.  Secondly, we will explore the behavior of accretion flows around a merging black hole binary using the flexible ZEUS-MP code. Motivated by the desire to assess possible electromagnetic signatures of merging black holes, we will study the response of the disk to the almost instantaneous loss of mass-energy of the central object (due to energy lost to gravitational radiation) as well as the kick that is generally imparted to the central object.\n' },
  { projectCode: 'TG-MCA03S014',
    cores: 864,
    pi: 'Pete Riley',
    fos: 'Solar Terrestrial Research',
    inst: 'Predictive Science, Inc.',
    abstract: 'This renewal proposal requests support for the computational needs of the NSF Center for Integrated Space Weather Modeling, CISM, one of six Science and Technology Centers selected by NSF in 2002. CISMs central focus is developing, coupling, and applying advanced numerical models of the solar terrestrial environment and to understand processes, space weather, that  affect the performance and reliability of space borne and ground based technological systems, or endanger human life or health. The computing resources requested here are essential to our Centers research objectives, which are reviewed annually through formal NSF site visits. For the next year we request time on TACC/Ranger, TACC/Lonestar, PSC XT3, NICS XT4, NCSA/LONI, and NCSA/Cobalt, totaling 2,277,712 SU.   The requested time will support basic science studies with large-scale runs of our massively parallel models of the solar corona (MAS), solar surface-lower corona (RADMHD), and Earths magnetosphere (LFM and LFM-RCM-TIEGCM).  Progress under the current LRAC allocation is described in an accompanying Progress Report, dated July 2008.' },
  { projectCode: 'Project1',
    cores: 384,
    pi: 'Jianpeng Ma',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Baylor College of Medicine',
    abstract: 'Large-scale conformational transitions in protein structures play an important role in a variety of cellular processes. Understanding such transitions is one of the central tasks of modern biophysics and structural biology. Among all the available structural and biophysical methods, computer simulation is a powerful method that allows one to model the motions of proteins in atomic details. The research projects primarily focus on  molecular simulation of protein folding, protein structure prediction and protein-protein interactions.' },
  { projectCode: 'A-go3',
    cores: 2048,
    pi: 'Zong-Liang Yang',
    fos: 'Atmospheric Sciences (ATM)',
    inst: 'Department of Geological Sciences',
    abstract: 'A large number of numerical experiments will be conducted to understand global and regional changes of climate, water, ecosystems, and environment under global warming.' },
  { projectCode: 'TG-MCB120050',
    cores: 96,
    pi: 'Karen Fleming',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Johns Hopkins University',
    abstract: 'The thermodynamics of lipid-protein interactions is a fundamental driving force for processes involving membrane proteins and membrane-active peptides. Even though membrane proteins constitute ~25% of open reading frames throughout all kingdoms of life, very little is quantitatively known about the physical basis of their folding and stability. We plan a large set of molecular dynamics computations aimed at discovering how membrane proteins and membranes adapt to sequence changes introduced on the lipid-facing surface of membrane proteins. The proposed work includes 3 broad computational projects: (1) determine the structural consequences to both the membrane and the protein in response to mutations on the proteins lipid-facing surface; (2) reconcile the disparity between computational and experimental free energies of partitioning of amino acid side chains at a central position in the bilayer; and (3) determine the influence of the local environment on the structure and energetic consequences of charged mutations by classical MD and free energy perturbation calculations. ' },
  { projectCode: 'A-ph5',
    cores: 32,
    pi: 'Wendell Horton',
    fos: 'Physics (PHY)',
    inst: 'Department of Physics',
    abstract: 'Plasma physics is the study of high temperature gases like those in the sun and in man -made confinement machines called tokamaks, mirror machines and the helimak.\r\nThe dynamics of the plasma is according to the selfconsistient solutions of the equations of electromagnetic theory and newtonian laws of motion for the charged particles. We use the TAAC resources to solve these complex nonlinear equations for the plasma systems to predict the properties of the plasma. Predictions include the amount of nuclear fusion that takes place in the system and the turbulent diffusion of the plasma across the magnetic field structures.  The space/astrophysics aspects of the research is funded by the National Science Foundation and the laboratory confinement problem by the Department of Energy.' },
  { projectCode: 'TG-MCB070015N',
    cores: 128,
    pi: 'Wonpil Im',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of Kansas',
    abstract: 'MscL, the mechanosensitive channel of large conductance, forms a homo-pentameric pore in which each subunit contains two transmembrane (TM) domains (TM1 and TM2) involved in the channel gating, and a C-terminal cytoplasmic helical domain. The crystal structure (PDB ID: 2OAR) represents a closed state of the channel, showing a funnel shaped pore with a large opening on the periplasmic side and the narrowest point near the cytoplasm. Assuming that TM helix tilting due to membrane tension drives MscL gating, we will determine the possible gating mechanisms at the atomic level by (1) performing molecular dynamics simulations by tilting the TM helices continuously, and (2) calculating potential of mean force of MscL as a function of TM helix tilt angle. We will use the recently developed helix tilt restraint potential to control the TM helix tilt in a DMPC lipid bilayer. The continuous simulations of MscL TM helix tilting will provide detailed information on the change of the pore size, molecular interactions, and pressure profile as a function of helix tilt, and thus the possible gating mechanisms of MscL at the atomic level. Resulting mechanisms and simulation protocols, obtained from the continuous simulations, will be utilized to calculate the PMF as a function of tilt angle to obtain the detailed energetics upon helix tilting and MscL gating. The PMF decomposition and trajectory analysis, as well as the estimate of membrane tension as a function of helix tilt will provide novel insights into MscL gating upon helix tilting. ' },
  { projectCode: 'TG-PHY120002',
    cores: 512,
    pi: 'Anna Hasenfratz',
    fos: 'Elementary Particle Physics',
    inst: 'University of Colorado',
    abstract: 'n/a' },
  { projectCode: 'TG-MCB130001',
    cores: 64,
    pi: 'Thomas Poulos',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'University of California, Irvine',
    abstract: 'Understanding how heme proteins behave dynamically during their activity in a computational setting can provide a great deal of insight into their function that would otherwise be experimentally difficult to determine. To this point, we propose a series of computational studies that will aid to reveal unknown qualities to several cytochrome P450s as well as Nitric Oxide Synthase. These studies will cover a wide variety of topics including the interactions of P450cam with its redox partner PDX, designing a thermostable form of P450BM3, investigating the dynamic behavior of P450cin in response to active site mutations, as well as drug discovery efforts in bNOS. Combined, these studies will aim to shed a new light in this already active field. ' },
  { projectCode: 'TG-AST120046',
    cores: 128,
    pi: 'John H Wise',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'Georgia Institute of Technology',
    abstract: 'n/a' },
  { projectCode: 'TG-DMR130005',
    cores: 368,
    pi: 'Maosheng Miao',
    fos: 'Materials Research (DMR)',
    inst: 'University of California, Santa Barbara',
    abstract: 'We propose to apply computing resources in XSEDE for computational materials and solid-state chemistry research focusing on designing novel materials for energy conversion and storage, including the novel oxide materials, the nanostructured thermoelectric materials, the phosphors for LED and laser diodes and the noble metal compounds for heterogeneous catalysis. Our group combines the most advanced first principles computation method with the state-of-art solid state synthesis and characterization techniques to study the structures, properties and especially their relations in functional inorganic materials. The awarded resources will be used to support first-principles calculations associated with theoretical and experimental research programs funded by NSF, DOE and the UCSB Solid State Lighting and Energy Center. The research will be conducted by an associate specialist with computational materials background, 1 postdoctoral researcher and 2-3 graduate students and 1 undergraduate intern student. ' },
  { projectCode: 'TG-MCB070073N',
    cores: 32,
    pi: 'Cameron Abrams',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Drexel University',
    abstract: '200,000 supplement SU\'s are requested for the following molecular simulations:\n1.  Docking, equilibration, and free energy calculations of insulin and insulin-like growth factor (IGF) type 1 on the on the IGF-1 receptor.\n2.  Development of a novel non-equilibrium simulation of "conformational diffusion" in the acetylcholine-gated ion channel.\n3.  Targeted molecular dynamics simulations of conformational changes in the HIV-1 gp120 envelope protein.' },
  { projectCode: 'P-UTB2',
    cores: 48,
    pi: 'Fredrick Jenet',
    fos: 'Astronomical Sciences (AST)',
    inst: 'University of Texas at Brownsville',
    abstract: 'Radio pulsars are the compact remains of stars gone supernova.These objects emit regular bursts of radio radiation, or pulses. The study of these stars has pushed our understanding of a wide range of physics and astrophysics. Of particular interest to the Center for Gravitational Wave Astronomy is the potential to test general relativity and directly detect gravitational wave radiation. Our ability to detect gravitational waves using radio pulsars is directly proportional to the number of pulsars suitable for such experiments.   \r\nLarge scale surveys for radio pulsars are currently being performed at two major US radio observatories: The Arecibo radio observatory in Puerto Rico and the Green Bank telescope in West Virginia. These surveys will collect over 500 Tera-bytes of data and they will require a large amount of computational power to uncover the signature of radio pulsars in these data. The surveys are expected to find over 2000 new pulsars, more than doubling the currently known number.' },
  { projectCode: 'TG-PHY100030',
    cores: 64,
    pi: 'Brigita Urbanc',
    fos: 'Physics (PHY)',
    inst: 'Drexel University',
    abstract: 'We are requesting TeraGrid computational resources to conduct a multiscale molecular dynamics study of folding and assembly of three proteins:  hemoglobin,\nalpha-synuclein, and amyloid-beta\nrelevant to sickle-cell, Parkinson\'s, and\nAlzheimer\'s diseases, respectively.  The term ``multiscale" refers to spatial resolution of the protein models as well as the type of molecular dynamics.  Such a multiscale modeling\napproach is critical in addressing biologically-relevant processes that occur on a wide range of time scales and thereby providing unique structural information required to\nelucidate the cause of toxicity and onset of the disease under study. \n \nIn the present application, we propose to apply a\nlow-resolution protein model with the smallest number of particles per molecule to examine the entire assembly pathway of the sickle-cell hemoglobin from spatially separated\nmonomers to fibril-like assemblies that are in a steady state with monomers.  We further propose to apply an intermediate-resolution model, i.e. the four-bead protein model, in which each amino acid is represented by up to four particles, to study folding and early assembly pathways of\n140-residue long alpha-synuclein and 40- and 42-residue long amyloid beta-proteins.  The low- and intermediate-resolution protein models will be combined with event-driven discrete molecular dynamics (DMD), in which each continuous interparticle potential is replaced by a square-well (or a combination of square-well) potential(s).  A high-resolution protein model will combine the all-atom protein representation with molecular dynamics (MD) in explicit water to study stability and structural details of the protein conformers obtained by the four-bead protein model. \n\nThe computational modeling comprises\nthe low-resolution (Project 1), intermediate resolution (four-bead) (Projects 2 and 3), and the high-resolution (Project 3) approaches.  We are currently using TeraGrid computational resources through two start-up applications\nexamining (a) free energy landscapes of alpha-synuclein and amyloid beta-protein folding and (b) stability and structure of amyloid beta-protein dimers obtained by the DMD with the four-bead protein model.  These start-up resources enabled us to gain experience with\nTeraGrid usage as well as to obtain preliminary data on Projects 2 and 3.  Our current research on Project 3 is funded by NIH grant AG027818.\n' },
  { projectCode: 'TG-CHE140022',
    cores: 64,
    pi: 'Xiaotai Wang',
    fos: 'Chemistry (CHE)',
    inst: 'University of Colorado, Denver',
    abstract: 'The ruthenium-catalyzed olefin metathesis and the palladium-catalyzed Heck coupling are both important chemical reactions that create new carbon-carbon bonds, which prove extremely useful in the synthesis of medicinal and other molecules. New catalysts have been invented recently that allow these reactions to generate carbon-carbon bonds both site-selectively and stereo-selectively. We seek to utilize density functional theory (DFT) computations to elucidate the mechanisms and particularly the origins of site- and stereo-selectivities of these newly developed catalytic reactions. For each reaction system, various possible pathways are explored by computing the structures and energies of the intermediates and transition states, and the most favorable mechanism is determined by examining the free energy profiles, from which theoretical site- and stereo-selectivities can be calculated. The plausibility of the mechanism is further checked by comparing with the experimentally observed site- and stereo-selectivities. We expect this work to produce publishable results and give valuable insight for the further development of these highly useful carbon-carbon bond forming reactions.' },
  { projectCode: 'TG-CTS070067N',
    cores: 64,
    pi: 'Rayhaneh Akhavan',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Michigan',
    abstract: 'This renewal proposal is a request for computational resources at the Indiana University IBM e1350 (Big Red), the TACC Sun Constellation cluster (Ranger), and the HPSS tape storage at SDSC, to be used in our ongoing studies of turbulent drag reduction by dilute polymer solutions. The studies planned for the upcoming year will focus on development of practical skin-friction drag reduction technologies for transportation inspired by the mechanisms observed in polymer drag reduction. A cornerstone of these studies is some recent preliminary DNS studies performed in our lab which show that in turbulent channel flow, MDR conditions can be achieved with the polymer force activated only in the viscous sub-layer and the buffer layer. This observation opens up new possibilities for developing practical drag reduction technologies for use in transportation. The simulations planned for the upcoming year will include: (i) more detailed simulations of turbulent channel flow with the polymer force activated only in the viscous sub-layer and the buffer layer; (ii) simulations of turbulent channel flow with a sharp viscosity gradient imposed in the viscous sub-layer and the buffer layer; (iii) simulations of turbulent channel flow with a wire mesh in the viscous sub-layer and the buffer layer; and (iv) simulations of turbulent channel flow with flexible fibers in the viscous sub-layer and the buffer layer. The principle action of all these drag reduction technologies is to redirect a small portion of turbulence kinetic energy at the location of the peak of turbulence production in the buffer layer into a path other than the normal turbulent energy cascade. This re-routing of the turbulence kinetic energy at a given turbulent scale results in a drop in the fluctuating strain rate at that scale which, in turn, inhibits the ability of turbulence to redistribute the kinetic energy at that scale from the streamwise to the cross-stream directions through the pressure-strain term.  This results in a pileup of kinetic energy in the streamwise direction and a drop of kinetic energy in the cross-stream directions, which leads to an overall drop in the Reynolds shear-stress and a concomitant drop turbulence production, thus leading to turbulence suppression and drag reduction. These are the principle mechanisms at work in drag reduction by dilute polymer solutions. A total of 400,000 SUs is requested for these studies. Because the IU BigRed will be decommissioned from Teragrid service in March 2010, the requested allocation is split between IU, which we plan to use up to March 2010, and TACC Ranger which we plan to use thereafter. The requested tape storage at SDSC HPSS is for existing data which we have stored at this facility over the past seven years.\n' },
  { projectCode: 'A-asyg1',
    cores: 128,
    pi: 'John C Wheeler',
    fos: 'Astronomical Sciences (AST)',
    inst: 'Department of Astronomy',
    abstract: 'Supernova Asymmetries\n\n\nWe will explore multidimensional asymmetries in each of the main categories of supernova explosion mechanisms: core collapse in massive stars, electron/positron pair instability in even more massive stars, and thermonuclear explosions of white dwarfs.\n\nDespite decades of theoretical effort, the mechanism that causes massive stars to explode as core-collapse supernovae is still uncertain.  Core-collapse supernovae (CCSNe) have been the subject of some of the most sophisticated and challenging numerical simulations in all of astrophysics.  The complex problem involves the physics of multidimensional hydrodynamics, dynamic gravity, the state of matter at extreme conditions, and the transport of elusive, but critically important, neutrinos.  \n\nOur research project aims to address another very important aspect of CCSNe physics that has heretofore received little attention relative to the neutrino physics: magnetic fields and rotation.  In the process of core collapse, magnetic fields are amplified by both linear processes and non-linear instabilities.  The saturation strength of the magnetic fields can be dynamically important even in non-extreme progenitors.  We aim to simulate the amplification and subsequent dynamics of magnetic fields in CCSNe with high-fidelity.  We will employ physically-motivated simplifications for neutrino transport that will make full neutrino-magnetohydrodynamic CCSNe simulations feasible.  Understanding the role that rotation and magnetic fields play in the dynamics of the CCSN mechanism is critical to understanding what gives rise to the asymmetries observed in real CCSNe.\n\nIn a related project, we will explore the nature of pair-formation supernovae in rotating very massive stars. For stars with mass exceeding 100 solar masses, models predict that in the oxygen core phase, the core is hot enough to generate electron-positron pairs by photo-production. This conversion of radiation to rest mass reduces the radiation pressure and destabilizes the star. The core contracts, burns oxygen dynamically and explodes to totally disrupt the star. We have done some of the first-ever models of this process with rotation, but seek to extend the models to 3D. \n\nType Ia supernovae, the kind used to discover the acceleration of the Universe, arise in the explosions of carbon/oxygen white dwarfs, but there is still considerable uncertainty as to how the white dwarf is brought to the condition of ignition and explosion and the nature of the explosion. We will explore multidimensional models of the interaction of the expanding white dwarf with putative circumstellar matter to try to explain the velocity patterns in the expanding material. In particular we seek to understand the origin of "high velocity" features, with a velocity of about twice that of matter at the supernova photosphere that has the qualitiative character of collision with a circumstellar shell. \n\nWe will use the FLASH simulation framework to conduct the proposed models.  FLASH is a professionally-developed and -maintained community code that has a long track record of enabling scientific discovery through simulation.  The developers at the Flash Center, University of Chicago, including Co-I Couch, have worked diligently to ensure that FLASH remains a modern, highly-optimized code for today\'s most cutting edge HPC platforms.  FLASH is highly portable and we have been using FLASH on TACC resources, including Ranger and more recently Stampede, for years.  FLASH includes a new, highly-accurate multidimensional magnetohydrodynamics (MHD) solver that will be utilized for this effort.\n\nThe first part of the core-collapse project will focus on testing a sub-grid model for the growth of the magneto-rotational instability (MRI) in the context of CCSNe.  This model is already being developed by Co-I Couch and PI Wheeler.  The small scale nature of the MRI makes it prohibitive to fully resolve in a realistic CCSNe simulation.  This sub-grid model will be critical to accurately capturing the important physics that leads to magnetic field amplification in CCSNe.\n\nSome of the project allocation will be used to ascertain the relative importance of magnetic fields and neutrinos in driving successful CCSN explosions.  We will conduct a 2D parameter study in which the progenitor star\'s rotational speed and the driving neutrino luminosity are varied.  By changing these two parameters we will be able to determine by how much progenitor rotation, in the presence of accurate magnetic field amplification, modifies the neutrino luminosity necessary to obtain explosions. We will also simulate rotating pair formation supernovae and their collisions with circumstellar shells of matter ejected in the prior history of the progenitor star and the collision of thermonuclear explosions of white dwarfs with circumstellar matter. \n\nCost analysis\nThe most demanding simulations with be those of magnetic core collapse. Experiments using the FLASH MHD solver on Ranger show that the cost, in SUs, to advance one 2D zone through one time step is ~2.3e-8 SUs/zone/step.  Each simulation of the proposed parameter study will comprise a time-averaged number of zones of approximately 1e6 and will require around 4e5 steps to complete.  The cost for one simulation is then 9200 SUs.  In order to adequately cover the parameter space in progenitor rotation and neutrino luminosity we will need to run around 16 simulations, bringing the total cost of the parameter study to 150,000 SUs.\n\nDevelopment of the MRI sub-grid model will require fewer simulations and less demanding resolution.  We estimate, again using FLASH, that we will need 50,000 SUs to complete development and testing of the MRI sub-grid model.\n\nThe total allocation request is then 200,000 SUs.  We further request 10,000 SUs on Longhorn to visualize our data.  Co-I Couch has a long history of using VisIt in parallel on TACC resources to perform scientific data visualization.' },
  { projectCode: 'TG-MCA00N020',
    cores: 768,
    pi: 'Richard I. Klein',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'University of California, Berkeley',
    abstract: 'In this 3rd year of our 3 year LRAC proposal with our state-of -the-art code ORION, a parallel, 3D, adaptive mesh refinement (AMR) radiation-magnetohydrodynamics (RMHD) code with self-gravity, we will continue to address some of the leading questions in modern day star formation.  Building upon the substantial advancements we have made in the first 2 years of this LRAC award, we will continue our simulations of high mass star formation by extending our study of collapse and fragmentation of turbulent cores with no outflows and single-frequency radiation to explore a larger number of realizations and a wider range of parameters.\nWe will include for the first time, the combined effect of feedback from radiation and its interaction with feedback from protostellar outflows in an effort to pin down a mapping between the properties of cores and their environments such as column density, and the masses and multiplicities of the stellar systems to which they collapse.  The first exploratory simulations with ionization will be performed. We will also continue our ground breaking studies of multiple low mass star formation by studying the collapse of magnetized turbulent clumps with AMR and comparing results to our pure hydrodynamic models to gauge the role of magnetic fields in the star formation process. In addition, we will perform the same simulation with a 1000 solar mass turbulent clump that we have used in our current studies of star formation in turbulent clumps (Offner, Klein and McKee, 2008) but with magnetic fields. This study, now including magnetic fields, will complement our studies of core and star formation this current year without fields and enable us to delineate the effects of magnetic fields on star formation. To explore the effects of outflows on low mass star formation, we will also perform high-resolution AMR simulations of cluster formation including the feedback from such outflows using stellar evolutionary and wind feedback models. To do these simulations we will take advantage of our implementation of sink particles in Eulerian grids, which we have previously used to handle stellar evolution and feedback in our studies of high mass star formation. We will continue simulations of low mass star formation with radiative transfer, thereby addressing the effect of radiation feedback on core fragmentation and stellar multiplicity, first using our grey flux-limited implementation (GFLD) in ORION and then comparing with simulations using our newly developed Multi-Frequency Grey radiation transfer.  Finally, we will implement a new constrained transport Godunov algorithm for MHD in ORION and combine this with our newly developed approach to non-ideal MHD for our future explorations of turbulent core collapse driven by ambipolar diffusion.' },
  { projectCode: 'TG-CTS100078',
    cores: 64,
    pi: 'Tengfei Luo',
    fos: 'Thermal Systems',
    inst: 'University of Notre Dame',
    abstract: 'n/a' },
  { projectCode: 'TG-PHY100033',
    cores: 1536,
    pi: 'Christian D Ott',
    fos: 'Gravitational Physics',
    inst: 'California Institute of Technology',
    abstract: 'One century after Einstein\'s theory of general relativity has revealed space and time as dynamical entities, research in gravitation is preparing for a dramatically rising tide of observational data, adding gravitational waves to the messenger ensemble of astrophysics.  The first detection of gravitational waves will push open a new window on the universe, comparable to the revolutions brought about by the development of radio, infrared, and high-energy (UV/X/$\\gamma$-ray) astronomy. Prime candidates for first detection are catastrophic events involving compact relativistic objects and their strongly nonlinear gravitational fields, in particular the coalescence of compact binaries and stellar collapse.\n\nThe challenge to meet the tremendous sensitivity requirements of gravitational wave detectors is paralleled by a computational modeling challenge: The detection, identification, and accurate determination of the physical parameters of sources relies on the detailed theoretical understanding of the source physics, and, in many cases, on the availability of waveform template banks, which are used to filter the detector signals. \n\nFor coalescing compact binaries, good analytical approximations for the gravitational waveforms are provided by post-Newtonian expansion techniques as long as the orbits are wide. For the last obits and merger, where the fields are particularly strong, and where one has the best chances of discovering entirely new physics, the full Einstein equations have to be solved numerically on supercomputers. The latter is true also and in particular for stellar collapse to a protoneutron star and the subsequent evolution to a core-collapse supernova or to stellar-mass black hole formation and a potential late-time gamma-ray burst. In this case, gravitational wave data can be complemented by information carried by neutrinos and electromagnetic waves.\n\nOur group of researchers has been involved at the heart of the recent progress in numerical relativity that is now allowing for robust simulations of compact binary coalescence, merger, and post-merger evolution as well as simulations of stellar collapse and core-collapse supernova evolution in full general relativity.\n \nHere we propose to carry out computational relativistic astrophysics modeling of stellar collapse and binary black hole coalescence, following novel research directions, employing new technical approaches while fundamentally relying on the community infrastructure Cactus that we helped create.\n\nOver the last few years, we have invested much work into black hole binary simulations and pioneered many of the techniques that render possible large scale parameter studies of these systems, and to construct from such simulations analytical template banks that describe the inspiral, merger and ringdown of black hole binaries. The binary black hole part of this project will make it possible to combine all these techniques and leap-frog black hole parameter studies in time for establishing data analysis strategies for the advanced generation of GW detectors that is expected to come online in 2014.\n\nWe have equally been at the forefront in the modeling of the general relativistic collapse of massive stars to neutron stars and in simulations of core-collapse supernovae and the accretion-induced collapse of massive white dwarfs. In addition, we have recently developed and published much improved treatments and implementations for highly-relevant neutrino processes and the microphysical finite-temperature nuclear equation of state. The 3D stellar collapse projects that we propose here focus on the formation of black holes in failing core-collapse supernovae and on comparing 2D (axisymmetric) and 3D core-collapse supernova dynamics. The former is aimed at understanding the formation of gamma-ray burst central engines while the latter will help ascertain the influence of multi-D phenomena on the core-collapse supernova explosion mechanism. In addition, these simulations will yield new and improved estimates of the gravitational wave signature of stellar collapse, core-collapse supernovae, and black hole formation.\n' },
  { projectCode: 'TG-MCB090159',
    cores: 48,
    pi: 'Gregg Beckhame',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'National Renewable Energy Laboratory',
    abstract: 'Molecular simulation will be used to investigate the structure of the plant cell wall and the mechanisms by which cellulose-degrading enzymes convert highly recalcitrant plant cell walls into sugars.  Research conducted as part of this proposal will enable molecular-level understanding of the natural routes for cellulose conversion to sugar, thus facilitating rational design approaches for improved biofuels processes at the industrial scale.  Three groups of projects will be pursued concurrently:  1) modeling of the plant cell wall structure from the atomistic to the micrometer length scale with a multiscale simulation approach; 2) investigation of fungal cellulases interacting with cellulose; and 3) a study of bacterial enzymes that assemble to form huge protein complexes (cellulosomes) to degrade cellulose synergistically.' },
  { projectCode: 'TG-PHY140020',
    cores: 4608,
    pi: 'Farhat Beg',
    fos: 'Physics (PHY)',
    inst: 'University of California, San Diego',
    abstract: '   We request a new allocation of 10 million (M) service units (SUs) on "Stampede\'\' to carry out a series of large-scale computational studies on developing a novel path towards compact laser-ion accelerators, radiation pressure acceleration (RPA) for both protons and heavy ions. The newly-emerged RPA scheme has been regarded as the most promising route to obtaining high-quality high-energy ion beams, comparing to other acceleration schemes identified to date. We plan to use the state-of-the-art collisional particle-in-cell (PIC) code, "PSC", to simulate such relativistic laser-plasma interaction and ion RPA dynamics, where a self-consistent ionization module for the code including both field and impact ionizations have been developed by our group to give a more exact and complete description of the physics. Through simulations, we will validate the RPA scheme, determine the requisite laser and target coupling conditions, and improve the produced ion source properties. Further, we will extend the RPA scheme, for the first time, to heavy ions using ultrathin metal foils, where the ionization physics plays important role. The computations will also be used to explain and design the relative experiment on HERCULUS laser at University of Michigan, which is one of the highest intensity and contrast lasers in the world. The relevant research of the project have been supported by the PI\'s project under Department of Defense (DoD) Air Force Office of Scientific Research-Basic Research Initiatives for 3 years (2014-2017) [see the attached email communication from the Air Force Program office] and will facilitate significant future funding. The computational results with totally 10M SUs will bring a breakthrough progress in the Accelerator Science. And the success of the project will benefit a broad scientific community involved in the research of relativistic laser-matter interactions, accelerator science, nuclear physics, material science, and medicine and so on.' },
  { projectCode: 'TG-DMR130078',
    cores: 96,
    pi: 'Stephen J Paddison',
    fos: 'Solid State Chemistry and Polymers',
    inst: 'University of Tennessee, Knoxville',
    abstract: 'A significant challenge in the 21st century is unquestionably energy conversion and storage. Electrochemical devices such as lithium ion batteries will gain importance moving towards a low-carbon economy, but innovative materials chemistry is crucial for making further progress in these technologies.  While materials in which electrons may easily be excited and transferred has facilitated the development and wide spread use of electronic devices in society, the design and fundamental understanding of materials that are pure ion conductors has lagged behind even though the benefit of their utilization in electrochemical devices is recognized. It is the general purpose of the proposed work to develop fundamental understanding of the connections between cationic transport with structure, morphology, associated counter anion, and the chemistry in polymeric electrolyte materials with first principles based simulations. The research described in this proposal will contribute to laying the foundations for the development of poly- and polymer electrolytes that are single ion conductors  broadly considered to be an essential milestone in battery technology.' },
  { projectCode: 'TG-DMR140090',
    cores: 160,
    pi: 'Michael Gao',
    fos: 'Materials Research (DMR)',
    inst: 'US Department of Energy',
    abstract: '\tThis proposal requests computational time and storage to support advanced alloy development: light-weight high-performance high-entropy alloys. The ultimate goal is to design and develop new alloys to replace conventional aluminum- and titanium-based alloys due to their combination of superior strength, good ductility, and outstanding high-temperature stability. The computation is based on first-principles density functional theory (DFT) methods to study the structural, electronic, vibrational, and mechanical properties. Ab initio molecular dynamics and Monte Carlo simulations will also be carried out. Alloy screening will be carried out first to identify potential alloy compositions of high likelihood of success in achieving low density (in the range of 3.0-6.0 g/cm3) and optimal mechanical properties. \n\tWe primarily focus on the AlxCrFeMgyMnTiz alloys (where x, y and z can be changed independently). Possible addition of Li, Si, and Ga will also be considered. The searching criteria we use are: density, enthalpy, entropy, and elastic modules (Young\'s, shear and bulk). The following tasks will be carried out:  \n1)\tPerform DFT calculations to obtain the enthalpy, electronic structure, and elastic constants  of various alloys compositions.\n2)\tPerform ab initio molecular dynamics and Monte Carlo simulations to study the structure, thermodynamics and kinetics in both liquid and solid states. One important goal is to obtain disordered structures and calculate the confiurational entropy in the solid state.\n3)\tPerform lattice phonon calculations to obtain vibrational entropy and free energies of down-selected compositions.\n' },
  { projectCode: 'TG-MCB130178',
    cores: 224,
    pi: 'Angel E Garcia',
    fos: 'Biophysics',
    inst: 'Rensselaer Polytechnic Institute',
    abstract: 'n/a' },
  { projectCode: 'TG-MSS090007',
    cores: 16,
    pi: 'Markus J Buehler',
    fos: 'Mechanics and Materials',
    inst: 'Massachusetts Institute of Technology',
    abstract: 'Biological materials, many of which contain proteins as an elementary building block, are organized in functional networks, resulting in structures that span many hierarchical levels. The astounding ability of biological materials to integrate disparate properties goes far beyond our current ability in designing and synthesizing engineered materials, which often feature mutually exclusive properties. Our computational project is aimed at bridging analytical theory and experimental observation in order to both explain phenomena and predict behavior of biological hierarchical materials. In the previous year, we have successfully used XSEDE resources to run our massive computational jobs that provide us productive results of the molecular structures of several protein materials such as silk, elastin, collagen and intermediate filament. Specifically, for this renewal, we will continue focus on several representative biological protein materials from a material science perspective and investigate their role in mechanical materials phenomena. Our study will be very comprehensive as we will fully characterize the structure-mechanics relationship of each protein material to understand the molecular mechanism of their mechanics, as well as carry out comparative investigation to understand their unique roles in the corresponding physiological conditions. We will focus on addressing the property of several key materials: (i) collagenous tissues and bone, (ii) beta-sheet rich materials such as silk, and (iii) elastin, and including combinations of the above in so-called protein alloys. We will summarize the result in an integrated and comparative way by using category theory. Those features make the boundary of our study cross different length scales and different species of materials, making our study unique. The result will greatly contributes to our understanding of biomateriomics, which will improve the design of engineering materials. To ensure that we continue to make achievements toward our goal, we need continuum support of the computational resource for massively parallelized large-scale full-atomistic simulations and successive coarse-grained simulations. The computational resources provided by XSEDE resources will enable us to link the hierarchical structures, geometries and chemical interactions to the overall mechanical and failure properties of these materials. We have set up collaborations with multiple experimental groups in all areas of research, which makes our study promising and will lead to increased impact of our work.' },
  { projectCode: 'TG-CHE130105',
    cores: 32,
    pi: 'Binyomin Abrams',
    fos: 'Physical Chemistry',
    inst: 'Boston University',
    abstract: 'Recently, there has been increased focus on understanding biomimetic oligomers that exhibit a folded helical structure, similar to that of many biological macromolecules. Foldamers, non-biological macromolecular oligomers that form folded helical structures with relatively few monomers, have become increasingly popular among synthetic chemists and are ideal models for studying diffusion processes similar to those found in proteins and transmembrane channels.  \n\nWhile previous computational studies on m-poly(phenylene ethylene) foldamers have focused on the ability of theory to reproduce the structural behavior of the foldamers, little work has been done on the chemical utility of these models.  Moreover, no water-soluble mPPE foldamers have yet to be parameterized or studied computationally.\n\nThis project will involve the parameterization and modeling of water-soluble mPPE foldamers, similar to those synthesized by Tan and coworkers.  Once the structures of these foldamers have been verified, simulations on rigidly constrained foldamers with added substrates will be performed and a diffusion model will be developed consistent with the free energies computed.\n\nThe ultimate goal of the study is to model diffusion as a function of helix length, investigate the effect of adding endohelical side-chains on the rates of diffusion and folding process, and research the use of polar or charged endohelical groups to functionalize foldamers as chemoselective molecular sieves.\n' },
  { projectCode: 'TG-CTS110037',
    cores: 384,
    pi: 'Kiran Bhaganagar',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Texas at San Antonio',
    abstract: 'We request computing resources of 1000,000SUs to perform, for the first time, very high Reynolds numbers up-to Re =4000 in a turbulent channel flow with rough-walls. To-date, highest Re performed using DNS has been 2000 for smooth-wall turbulent channel flow, and Re =400 for rough-wall. These simulations will provide fundamental data that will be of tremendous use to entire community of fundamental and applied fluid mechanics.  The simulations will be performed with the existing parallel well-resolved highly accurate solver developed by Bhaganagar et al in 2004. The request of 1000K will be used to simulate flow over different types of roughness-shapes and different inflow conditions. Our previous startup SUs of 200000 were used to simulate flow over rough-wall at Re =180 for range of roughness shapes.' },
  { projectCode: 'battery',
    cores: 256,
    pi: 'Roberto C Longo Pazos',
    fos: 'Condensed Matter Physics',
    inst: 'University of Texas at Dallas',
    abstract: 'The design of novel materials is critical for many potential new\nand clean energy technologies. Whether it is hydrogen or solar, thermoelectrics\nor energy storage, the effectiveness of these technologies is severely limited\nby the available materials. Focused on energy storage in current Li-ion batteries,\nthe use of a cobalt oxide as the most common material in the cathode is approaching\nto its end, due to the fact that the Co must be obtained from natural resources.\nSo, while the new generation of Li-air batteries are still been developed in the\nlabs, we must concentrate our efforts in the search of new materials to be used as cathode\nin Li-ion batteries, to improve their efficiency and performance.\nIn this project, we are going to use first-principles calculations to compute\nseveral properties (geometry, band gap, ionic conductivity,...) of some materials\nwe believe they are most likely suitable candidates for that purpose.' },
  { projectCode: 'TG-AST140029',
    cores: 1024,
    pi: 'Jeremy Goodman',
    fos: 'Extragalactic Astronomy and Cosmology',
    inst: 'Princeton University',
    abstract: 'We request a total of 4.3e6 SUs on the Austin machine Stampede to conduct 3D radiation-hydro and magnetohydrodynamic simulations of star formation in a quasar disk.  From observed quasar accretion rates one infers dense,  radiation-pressure-dominated, self-gravitating conditions in broad-line regions, conditions which are uniquely suited to forming objects of many hundreds of solar masses on dynamical timescales.  For physical and technical reasons, this problem cannot be studied reliably in fewer than three dimensions, nor without radiative transfer and MHD.  We will use the recently developed radiation-transfer module in the well-tested MHD code Athena.  We propose to run 15 radiation-hydro and 9 radiation-MHD local shearing box simulations, covering five different positions from the central black hole and three different surface densities at each location, hence spanning both radiation-pressure and gas-pressure-dominated regimes.  To analyze the large datasets that will result from these calculations, we request an allocation of 1.5e4 SUs on the TACC Maverick visualization and analysis system.\n\nFunding for the proposed research will be provided by the NSF-DOE Physics Frontier Center for Magnetic Self-Organization (PHY 0821899), in which the PI is a participant, and by NASA through an Einstein Postdoctoral Fellowship awarded (to YFJ) by the Chandra X-ray Center, which is operated by the Smithsonian Astrophysical Observatory for NASA under contract NAS8-03060.' },
  { projectCode: 'TG-CTS140065',
    cores: 32,
    pi: 'Bassam A Younis',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of California, Davis',
    abstract: 'In power-generating machinery such as gas turbines, air is use to cool critical components that come in contact with the hot products of combustion. For the case of turbine blades, the air flows inside interior channels that rotate with the blades. In order to enhance the rate at which heat is transferred from the blade to the air, transverse ribs are installed in rows causing the air to circulate in such a manner as to mix the air layers more efficiently. The result is a turbulent flow field that is difficult to predict using the class of mathematical models used in industry. The ultimate aim of this research is to improve the predictive abilities of these models by gaining a better understanding of the physical mechanisms that govern the heat transfer processes in rotating turbulent flows in the presence of ribs. This will be achieved by performing finely-resolved large-eddy simulations (LES) in which the fundamental equations that govern the transport of heat and momentum are solved with the least amount of empirical input. The computations will be performed using OpenFOAM - a widely-used open source simulations tool that is already installed on XSEDE. An advanced model for the thermal sub-grid scale fluxes will be implement, and its performance evaluated against experimental data. The outcome of the research will be in the form of detailed description of the turbulent flow and thermal fields in rotating ribbed channels, and an understanding of the underlying physical processes involved.' },
  { projectCode: 'TG-CHE140059',
    cores: 16,
    pi: 'Bill Casey',
    fos: 'Chemistry (CHE)',
    inst: 'University of California, Davis',
    abstract: 'Abstract: Large aqueous ions of 40-300 atoms are scientifically useful as structurally well-defined molecules intermediate in size between poorly understood mineral interfaces with solution and well-understood simple monomer ions.  For 15 years we\'ve been studying simple isotope-exchange dynamics in a set of aluminum-hydroxide molecules to bridge the understanding. Isotope-exchange pathways in these molecules involve metastable structural states that may be related to the five isomers.  \n\nWe have quantum calculations on the five structural isomers of the  [AlO4Al12(OH)24(OH2)12]7+ ion at level of theory that will yield highly accurate energies that can be compared to experimental results.  The size of the molecules and number of contributions to the basis sets has outstripped our ability to complete the calculations using our existing 7-blade, 8-node/blade clusters. We specifically request time to use G09 software to complete optimization and vibrational calculations on the five isomers, which will entail three sets of calculation per isomer or 15 jobs in total.  Our conservative estimate is that these five jobs will take &#8764;160,000 units, and thus request 200,000.  (5 jobs x 2000 hours/job x 16 cores/job = ca 160,000 units).  \n\nWe understand that the limit may have been reduced to 50,000 for starter grants, as per communication with Eric Heien, the UCD XCEDE Champion, and anticipate preparing a full research grant for the remaining work.  Finally, our work is supported by a NSF CCI grant through the Center for Sustainable Materials Chemistry, number CHE-1102637. \n\n' },
  { projectCode: 'TG-MCB120045',
    cores: 320,
    pi: 'Silvina R Matysiak',
    fos: 'Biophysics',
    inst: 'University of Maryland, College Park',
    abstract: 'The general objectives of this proposal are 1) to develop a multi-resolution simulation method in order to study long and short time scale events simultaneously, 2) study the cold and pressure denaturation of proteins to better understand the underlying forces that contribute to the folding and stability of proteins and 3) study the aggregation of the huntingtin (HTT) protein with polyQ inserts which are known to be the cause of Huntington disease and its interactions with a membrane bilayer' },
  { projectCode: 'TG-MCA94P017',
    cores: 384,
    pi: 'Gregory A. Voth',
    fos: 'Chemistry (CHE)',
    inst: 'University of Chicago',
    abstract: 'An allocation is requested for large scale computer simulations of multiple and single proton transport (PT) in biomolecular systems, coarse-graining, and large multi-scale simulations of biological assemblies. In the case of PT, the interaction of the proton with the biomolecular environment is represented by the multi-state empirical valence bond (MS-EVB) method, and the potential of mean force (PMF) along the pathway of PT is calculated by averaging over highly parallel swarms of trajectories. A novel methodology to simulate multiple protons, based on the MS-EVB, has just been developed by our group and scales nearly linearly with proton number. Large atomistic simulations of biological assemblies will be performed in order to systematically parameterize coarse-grained mesoscopic models that will be employed to examine long time- and length-scale phenomena. Multi-scale coupled simulations of embedded proteins in lipid bilayers, as well as spectrin filaments will be employed to directly examine atomistic-level couplings with mesoscopic phenomena. These studies are extremely challenging and well suited to parallel supercomputing environments.' },
  { projectCode: 'TG-DMR140125',
    cores: 128,
    pi: 'Meenakshi Dutt',
    fos: 'Materials Research (DMR)',
    inst: 'Rutgers University',
    abstract: 'The over-arching focus of our research is to develop and utilize mesoscopic computational methods to design hybrid soft materials with specific structure-function relations by harnessing the multiscale dynamic coupling of the interactions between the molecular species, and the statistical thermodynamics of the system. Soft materials encompass solid composites or liquid dispersions whose molecular species form the nanoscopic building blocks which assemble into structures spanning large length scales (angstroms to microns.) In addition to molecular-scale interactions between nanoscopic elements, the kinetics and thermodynamics of the structure and dynamics of these materials is dictated by physical forces which are predominant in these length scales: friction, electrostatics and hydrodynamics. The complex interplay between these key forces determines the structure or composition of these materials, and their responses to changes in the external environment such as acidity, temperature or light radiation. Fundamental insight into the morphology and dynamics of these materials will require the development and utilization of a suite of modeling tools with each class of tools tuned to address physical phenomena over a specific spatio-temporal scale. These multiple modeling techniques have to be interfaced at the juncture of two scales to enable a multiscale resolution of the system behavior over large length and time scales (nano-seconds to micro-seconds.) We harness these methodologies to develop a fundamental understanding of the various mechanisms underlying the interaction between cells and surfaces, for applications in targeted drug delivery, cellular sensing and antifouling. We are interested in the conception and design of bio-inspired membranes, vesicles, suitable biocompatible delivery vehicles and functionalized surfaces with specific interactions, via the use of mesoscopic computational models and techniques. The outline of the proposed work is provided below:\n1.\tDesigning bio-inspired membranes and vesicles \n2.\tMesoscopic implicit solvent models for bio-inspired bilayer vesicles \n3.\tDesigning sterically stable lipid-based delivery vehicles \n4.\tDesigning controlled-release delivery vehicles \n5.\tDesigning delivery vehicles via self-assembly of functionalized viral capsids \n6.\tRemoval of heavy metal ions using dendritic surfaces \n\tThe modeling and simulation techniques developed will require the utilization of state-of-the-art high-end fast-interconnect multi-core computing resources available at the Texas Advanced Computing Center (TACC). The simulations for all the projects will be carried out on TACC Stampede using an open source Molecular Dynamics (MD) code entitled Large-scale Atomic/Molecular Massively Parallel Simulator (LAMMPS) [1]. To compare the run time measurements for the different number of processors, we measure the run Time per number of Particles per number of Iterations (TPI) for different number of processors. All computational models will be rigorously tested and bench-marked prior to the production runs for system scales of interest on TACC Stampede.' },
  { projectCode: 'TG-PHY140019',
    cores: 320,
    pi: 'Wolfgang Tichy',
    fos: 'Gravitational Physics',
    inst: 'Florida Atlantic University',
    abstract: 'The NSF\'s LIGO gravitational wave detectors are among a number of new\nfacilities all over the world which are designed to directly detect and\nmeasure gravitational waves. These waves will come from a variety of\nastrophysical sources and will open a new window to the universe. One of the\nmost promising sources for these detectors are the inspirals and mergers of\nneutron star binaries. As the two objects get close, fully non-linear\nnumerical simulations of the Einstein equations are required to make \npredictions about the final part of the inspiral and subsequent merger. We\npropose to use the moving puncture method together with high a resolution\nshock capturing scheme (as implemented in the BAM code) to explore more\nphysically realistic situations. In particular, we plan to address several \nkey physics issues such as: (i) How important is neutron star spin in the\nevolutions of neutron star binaries? (ii) Can we find information about the\nequation of state of neutron star matter even if the stars are allowed to \nhave spin? To answer these questions we plan to perform the first long-term,\ndetailed 3+1 simulations of binary neutron stars with spin, to explore a\nrelevant fraction of the parameter space and to use this data to support the\ndevelopment of gravitational wave templates for gravitational wave\nastronomy. For our simulations we request 8776960 SU, preferably on\nStampede.\n' },
  { projectCode: 'TG-MCA99S024',
    cores: 512,
    pi: 'Mordecai-Mark Mac Low',
    fos: 'Astronomical Sciences (AST)',
    inst: 'American Museum of Natural History',
    abstract: 'We propose to continue and expand our study of several astrophysical problems using well tested, publically available astrophysical simulation codes. We will continue our use of the\nslab-parellelized, high-order, finite difference, non-ideal MHD code Pencil (developed by A. Brandenburg & W. Dobler), to study the\ninteraction of planets with partially-ionized protostellar disks, as well as the magnetorotational instability in such disks.  We will also continue to use the parallel, adaptive mesh refinement (AMR) hydrocode Flash (developed by the ASCI Flash center at the U. of Chicago) to study the formation of superwinds in local models of a supernova-driven, turbulent interstellar medium. Finally, we will continue a project begun elsewhere to model early generations of star formation in the universe using the parallel, smoothed particle hydrodynamics code GADGET 2 (developed by V. Springel and collaborators).' },
  { projectCode: 'TG-MCB120008',
    cores: 256,
    pi: 'Harel Weinstein',
    fos: 'Biophysics',
    inst: 'Weill Cornell Medical College of Cornell University',
    abstract: 'n/a' },
  { projectCode: 'TG-MCA08X016',
    cores: 512,
    pi: 'Nicholas H Brummell',
    fos: 'Astronomical Sciences (AST)',
    inst: 'University of California, Santa Cruz',
    abstract: 'We propose a multi-year effort to continue our research into the magnetohydrodynamics of the solar interior.  We use -local- domain, high resolution simulations of the processes found in the solar interior to try and understand the production of the magnetic activity observed at the solar surface.  These processes are complex and operate in the highly turbulent regime, and therefore demand enormous computing power to simulate the dynamics at sufficient resolution and for sufficient time to garner meaningful statistics from the turbulence.  We have made significant progress with LRAC resources on this long-term project over the last 10 years or more, and request continuing support to continue this program.' },
  { projectCode: 'TG-CDA130008',
    cores: 256,
    pi: 'Daniel Lobo',
    fos: 'Cross-Disciplinary Activities (CDA)',
    inst: 'Tufts University',
    abstract: 'A major challenge in developmental and regenerative biology is the identification of constructive models that specify the steps sufficient for complex pattern regulation. A great number of surgical and molecular-genetic experiments are producing a huge dataset; yet, no comprehensive, constructive model exists that explains the remarkable ability of many organisms to restore anatomical polarity and organ morphology after amputation. It is now clear that to surpass this barrier to progress, computational tools must be developed to mine the ever-increasing set of functional data on perturbations of regeneration and help derive predictive, mechanistic models that explain regulation of shape, not only of genetic pathways. Thus, we developed a novel bioinformatics of shape based on mathematical formalisms and artificial intelligence tools to automate the discovery of control models that have the right regenerative properties. We have curated a formal database with more than a thousand experiments from the regenerative literature, and have implemented novel tools to automate the discovery of regenerative models that matches well to this dataset of real experimental data. Running our heuristic discovery engine requires to simulate thousands of regenerative experiments comprising the behavior of thousands of cells and their secreted signaling molecules diffusing according to intensive differential equations. Due to this high computational cost, our system will make use of the computational resources available on XSEDE. Using our current XSEDE startup allocation, we have debugged and optimized our implementation for the Stampede cluster computer, demonstrating the high scalability and performance of our system. Our project will involve students, will directly impact regenerative medicine, synthetic biology, and our fundamental understanding of evolution, and will have important implications for the engineering of highly adaptive robotics and communications networks.' },
  { projectCode: 'TG-AST140024',
    cores: 2048,
    pi: 'Yanfei Jiang',
    fos: 'Astronomical Sciences (AST)',
    inst: 'Smithsonian, Astrophys Obs',
    abstract: 'We request a total of 13.72* 10^6 SUs on the Austin machine Stampede to conduct 3D radiation-hydro and magnetohydrodynamic (MHD) simulations of three \ndifferent astrophysics systems. Each project will be able to answer one long-standing question with the most accurate radiation transfer algorithm.\n\nFirst, global radiation MHD simulations of black hole (BH) accretion disks. These simulations can tell us the global structures of radiation dominated accretion disks by calculating the turbulence from magneto-rotational instability (MRI) and radiation transfer self-consistently. Our goal is to study how the thermal instability in the radiation pressure dominated regime changes the structures of the disk. By changing the accretion rate, we will also be able to study three different kinds of accretion flows. Specific intensities from these simulations will be able to compare with observations directly. The new radiation transfer algorithm we have developed is a significant improvement over traditional diffusion approximation or M1 closure. \n\nSecond, dynamics of the super-Eddington envelope of massive stars. These simulations will\nexplore convection in the radiation pressure dominated regime, including the stability of \na density inversion that  develops due to super-Eddington radiation flux.\nThe primary objective is to constrain the  poorly understood structure and stability of massive star envelopes, which in turns will help to understand the physics of mass loss. \nThis is expected to significantly improve our understanding of the evolution and death of massive stars.\n\nThird, radiation feedback on giant molecular clouds (GMCs). We will calculate the evolution and disruption of GMCs under irradiation from young stars. As radiation feedback is believed to play an important role in the regulation of the star formation rate in the galaxies, these simulations will allow us to better assess and quantify the role of radiation forces and heating.  In particular,  we will better understand how radiation couples with dust and gas in star forming environments, with the aim of improving the sub-grid models in large scale cosmological simulations. \n\nAll the three projects require accurate treatment of the radiation transfer, \nand coupling both the radiation energy and momentum source terms to the MHD equations.     \nWe have developed two new radiation-transfer modules in the well-tested MHD code Athena \nso that we can use the best suitable method for each project. Our calculations do not make the approximations used by other radiation hydro/MHD simulations in the literature (such as flux limited diffusion and M1).  As a result, we are the only group utilizing the full solution of the radiation transfer equation to study key astrophysical radiation hydro/MHD problems.   \n' },
  { projectCode: 'A-ch5111',
    cores: 160,
    pi: 'Gyeong Hwang',
    fos: 'Materials Research (DMR)',
    inst: 'Department of Chemical Engineering',
    abstract: 'This project aims at developing: (1) a deeper understanding of the fundamental behavior and properties of defect and dopant complexes in strained Si layers and their interfaces with a-SiO2 (with also some effort on high-k dielectrics); and (2) first principles-based kinetic models capable of predicting the evolution of dopant and defect profiles, which is needed for rational experimental designs to realize ultrashallow junctions for the 45-nm node or beyond. \nContinued scaling of CMOS devices down to the 45-nm design node or beyond will require the formation of ever shallower and more abrupt junctions with higher doping levels.  This also requires moving away from bulk CMOS in Si with SiO2 gate dielectrics.  It will probably involve the use of a buried strained Si layer for channel mobility enhancement and high-k dielectrics for gate leakage current reduction.  However, little is known about the fundamental behavior and properties of defects and dopants in strained Si layers and their interfaces with a-SiO2, (let alone high-k dielectrics). \nWe perform first principles calculations to determine: structure, stability, and bonding of defect and dopant clusters in amorphous/strained Si layers; formation and diffusion of mobile defect and defect-dopant complexes in strained Si layers and in the vicinity of a-c Si interfaces; and defect annihilation and dopant precipitation at strained-Si/a-SiO2 interfaces. \nWe perform first principles based classical molecular dynamics (or ab inito tight binding molecular dynamics, if necessary) simulations to examine complex dynamics occurring in amorphous Si.  Emphasis is placed on understanding: recrystallization of amorphous pockets in the presence of strain and defects; and dynamic behavior of defects in the vicinity of amorphous pockets.  The fundamental findings contribute to developing improved kinetic models for defect profiles during the early stages of post-implantation annealing.' },
  { projectCode: 'TG-PHY130016',
    cores: 256,
    pi: 'Bin Qiao',
    fos: 'Physics (PHY)',
    inst: 'University of California, San Diego',
    abstract: '   We request a new allocation of 6 million service units (SUs) on Stampede and 2 million SUs on Lonestar to carry out a series of large-scale computational studies on the dynamics of high-energy proton beam generation, focusing and transport by high-power lasers. We plan to use the unique capability of 3D implicit hybrid particle-in-cell (PIC) code LSP [Welch01, Welch06], specially designed for large-scale plasma simulation by ATK Company, to extend our previous proton focusing and transport studies from laser-pulse of 1 picosecond (ps) duration and 100 Joule (J) energy scale to 10ps-kJ scale. That is an unexplored regime of proton focusing and beam interactions where new phenomena, such as electron loss to surrounding structures, proton source depletion [Foord07, Hey09] and instabilities on beam transition into plasma [Ruhl04], are predicted. Our goal is to extend our physical understanding of the phenomena into this range facilitating optimal source designs for various applications and eventually utilizing laser-accelerated protons as a potential drive for proton fast ignition inertial fusion energy (IFE). The scientific basic for proton fast ignition IFE will be established and the first integrated point design simulation of proton fast-ignition will be carried out.  The computations will also be used to explain and design the relative experiments on OMEGA EP national laser facilities, which have been supported by DOE NNSA NULF funding for 2 years (2013-2014) and other funded or pending DOE HEDLP programs (DE-SC0001265 etc.).  The computational results with totally 8M SUs will have a significant impact in the field of HED physics and the success of the project - with possible medical and energy application spin-offs - could spark general public interest as well.' },
  { projectCode: 'TG-MCB120160',
    cores: 320,
    pi: 'David LeBard',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'Yeshiva University',
    abstract: 'This proposal requests CPU and GPU allocations on XSEDE resources through XRAC, primarily the Sun Constellation Linux Cluster (Ranger), the Dell XD Visualization GPU Cluster (Longhorn), and the Dell Linux Cluster (Lonestar) at the Texas Advanced Computing Center, as well as development time at the flash-based Appro cluster (Gordon) at the San Diego Supercomputing Center.  The proposed computational projects involve microsecond-length simulations focused on the study of amyloid peptide nucleation using atomistic bias-exchange metadynamics molecular dynamics (MD) simulations, and GPU-based simulations of amyloid peptide polymorphism using coarse-grained (CG) parallel tempering replica exchange MD (REMD).  A third project will be focused on the implementation and algorithmic optimization of collective variable analysis run in a hybrid parallel CPU/GPU software suite.  All-atom bias-exchange metadynamics MD trajectories will be obtained by using PLUMED 1.3.0 patched into NAMD 2.8, and CG-GPU REMD simulations will be performed using HOOMD-Blue 0.10.0.  The parallel analysis software has been developed and optimized for large-scale supercomputers and GPU clusters, and will be released as an open-source software under the GPL license.' },
  { projectCode: 'TG-MCB060011N',
    cores: 192,
    pi: 'Ravi Radhakrishnan',
    fos: 'Molecular and Cellular Biosciences (MCB)',
    inst: 'University of Pennsylvania',
    abstract: 'In the realm of fundamental and applied sciences, the interface between nanotechnology and biotechnology is rapidly evolving. At this interface, quantitative description of underlying fundamental processes is inherently a multiscale problem. In this proposal, we strive to achieve a multiscale description of equilibrium and dynamic processes associated \nbiomolecular interactions by pursuing the following aims. (1) Develop and apply free energy methods in conjunction with a quantum mechanics molecular mechanics (QMMM) Hamiltonian to describe enzyme catalytic mechanisms. (2) Apply free energy methods in conjunction with molecular dynamics to descrive enzyme conformational activation and substrate recognition. (3) Develop and apply multiscale spatially resolved hybrid deterministic/ stochastic algorithms for studying signal transduction. The proposed studies are likely to have a significant impact in nanobiotechnology and systems biology in terms of enabling fundamental scientific discoveries, as well as driving rational design.' },
  { projectCode: 'TG-DMR130145',
    cores: 64,
    pi: 'Yong Han',
    fos: 'Materials Research (DMR)',
    inst: 'Iowa State University',
    abstract: 'This work is the modeling and simulation component of NSF-supported Grant No. CHE-1111500 which covers both experimental and modeling studies. The goal of this research work is to advance capabilities for predictive modeling and simulation of metal nanostructure formation and stability. The nanoclusters considered in this work are formed by deposition on single-component single-crystal metal substrates, on binary alloy substrates, and/or on graphene substrates supported on flat surfaces of certain metals. We develop realistic atomistic-level models which have predictive capability, and can thus elucidate and guide experiments. Our model requires very many precise energetic parameters (both for thermodynamics and kinetics) as input. These energies must be obtained from a large number of density functional theory calculations with high convergence standards and high precision. These NSF-supported studies are of fundamental importance to advance the understanding of the formation and relaxation of metal nanostructures on specific surfaces, and potentially of the interaction of those nanostructures with chemisorbed species.' },
  { projectCode: 'TG-DMS080016N',
    cores: 16,
    pi: 'Clinton N. Dawson',
    fos: 'Mathematical Sciences (DMS)',
    inst: 'Institute for Computational Engineering and Science',
    abstract: 'Storm surge is caused by wind, atmospheric pressure gradients, tides,\nriver flow and short-crested wind-waves.  An accurate numerical model\nof storm surge should account for all of these effects.  Such a model\ncan be used in predictive mode as storms approach landfall for the\npurposes of emergency evacuation and response, and can be used in the\ndesign and implementation of improved man-made and natural protection\nsystems for vulnerable coastal areas.  Storm surge computer models\nhave been developed extensively over the past decade; however, only\nwithin the past few years have the algorithms, computational power and\nresolution been available to begin to model these events with any\nreasonable degree of accuracy.\n\n\nThe goal of this project is to investigate the use of petascale\ncomputing to significantly advance the state-of-the-art in storm surge\nsimulation, to accurately model flows at multiple, interacting scales,\nat resolution never before attempted, and to demonstrate that results\nfrom these simulations can be delivered in real-time to emergency\nmanagers.  To achieve this goal will require the continued development\nand improved understand of the mechanisms involved in tightly coupled\nmodels of wind, waves, circulation and geomorphology, improvements in\nthe description of the physical domain and adaptive resolution of all\nenergetic flow scales, and investigation of accurate, robust and\nhighly parallelizable numerical algorithms.  Efficient implementation\nof these models on emerging petascale architectures will require\nutilizing the latest developments in parallel data management,\nreal-time visualization, and programming tools.\n\nIn this project we will develop high resolution, large-scale coastal\ninundation models discretized using robust and highly parallelizable\nalgorithms. The models will be implemented on NSF Track 2 HPC systems\ncurrently under development.\n' },
  { projectCode: 'TG-CTS130052',
    cores: 112,
    pi: 'David Schmidt',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Massachusetts, Amherst',
    abstract: 'We propose to simulate fluid-structure interaction in two-phase flow.  The particular application is wave impacts on a buoy that represents an offshore wind turbine platform.  We will use OpenFOAM\'s volume-of-fluid solver with a six degree-of-freedom motion solver to calculate motion and forces on the structure.  ' },
  { projectCode: 'TG-EAR130027',
    cores: 64,
    pi: 'Claire Welty',
    fos: 'Earth Sciences (EAR)',
    inst: 'University of Maryland, Baltimore County',
    abstract: 'n/a' },
  { projectCode: 'TG-MCB140107',
    cores: 640,
    pi: 'George Makhatadze',
    fos: 'Biochemistry and Molecular Structure and Function',
    inst: 'Rensselaer Polytechnic Institute',
    abstract: 'Proteins are the building blocks of life. They are important cellular scaffolds, signaling molecules, and chemical catalysts.  Our research objectives are to understand the folding (self-assembly), dynamics, and stability of proteins. To this end we use computational and theoretical approaches based on statistical mechanics, with particular emphasis on atomistic molecular dynamics (MD) simulations. The application of computer simulations to molecular models grounded in physical principles allows us to obtain dynamic insights in atomistic details that are currently inaccessible by any other method.\nThis application deals with the use of atomistic, explicit solvent models of biomolecular systems and are directly related to human disease, HIV transmission modulated by amyloidogenic peptide found in semen. These systems include amyloid forming peptides of PAPf39 and Sem1f and serve in addition as a tractable model system for understanding intrinsically disordered proteins.  \nIn this proposal, we take advantage of the unprecedented opportunity for large-scale sampling presented by XSEDE, in conjunction with highly-optimized molecular dynamics code and efficient sampling algorithms, to reach new milestones in the detailed atomistic description of biomolecular processes and to validate these models against available experimental data. Together, these studies will help bridge the gap between microscopic and macroscopic scales of important biological processes and provide meaningful new insight into the molecular basis of human health and disease. \n' },
  { projectCode: 'Numerical-simulation',
    cores: 32,
    pi: 'William Anderson',
    fos: 'Fluid, Particulate, and Hyrdaulic Systems',
    inst: 'University of Texas at Dallas',
    abstract: 'This project focuses on flow processes in the human pulmonary system. Preliminary efforts will focus specifically on modeling flows entering the trachea and first two to three bifurcations of the bronchi. We will use large-scale, scientific simulations to capture realistic flow processes present in this system, such as vortex shedding at bronchi bifurcations, and subsequent vortex deformation due to the imposed forcing. The work is motivated by concerns related to invasive and noninvasive drug delivery by masks and endotracheal tubes, respectively. These devices deliver drugs by elevating the airway pressure and inducing a negative pressure gradient through the trachea and bronchi. The medications themselves are transported by ambient air, thereby introducing questions related to multiphase fluid mechanics, and thermodynamics of the new mixture. Findings from the research will enable our group to discern flow patterns responsible for inhibiting or preventing drug delivery to lung alveoli tissue â€“ interfacial tissue composed of micron-scale membranes that absorb quantities from air in the lungs and provides them to the blood. Thus, the project represents an early but important research effort in fundamental fluid mechanics applied to a non-traditional problems. Flow in the bronchi undergoes a pattern of laminarization, in which momentum absorption and turbulent diffusion suppress eddying motions in the upper stages of the airway: such â€œtransitionalâ€ behavior is itself a contemporary topic in turbulence research.' },
  { projectCode: 'TG-DMR090071',
    cores: 96,
    pi: 'Tunna Baruah',
    fos: 'Condensed Matter Physics',
    inst: 'University of Texas at El Paso',
    abstract: '\n We propose density functional theory based computational studies on optical, vibrational, structural and magnetic properties of several molecular scale systems.  We propose five research topics/projects in the directions summarized as follows.  We intend to study the effects of ligands on the excited states of large light-harvesting molecules, to test and apply  a methodology for calculation of energy transfer using density functional theory, to study the magnetic anisotropy energies for a Mn based molecular magnet,  to study Boron fullerenes and their solids, and to study Se clusters in zeolites.  Using our newly developed method for calculating (approximate) excited state, we have performed wide scale calculations to obtain the energies of singly excited states on a number of small molecules as well as on a large light-harvesting carotenoid-porphyrin-C60 triad molecule.  We have been studying novel Boron nanostructures. This proposal extends our ongoing investigations on the above-mentioned systems and techniques.  Some of these projects are funded by external funding agencies and for others funding is being sought.  The possible impact of these projects are in solar energy utilization, DFT based method developments, in development of revolutionary data-storage devices, new Boron based materials, and in cluster science.  These studies are expected to broaden our understanding of nano-materials, light-harvesting systems, and will add to or clarify experimental studies.\n' },
  { projectCode: 'TG-CTS080043N',
    cores: 16,
    pi: 'Blair Perot',
    fos: 'Chemical and Thermal Systems (CTS)',
    inst: 'University of Massachusetts, Amherst',
    abstract: 'The goal of this project is to determine the power law decay exponent in homogeneous isotropic turbulence as a function of the turbulent Reynolds number.   The project will address the realistic numerical creation of isotropic turbulence, and its subsequent decay using sufficient statistical sample to produce definitive results.  Because of the size of resolution required for the desired results, we are requesting 320,000 roaming hours for this work.  This allocation size will allow for determination of the power law decay exponent over a range of Reynolds numbers, which will lead to the advancement of the state of turbulence modeling.  ' },
  { projectCode: 'TG-DMS140019',
    cores: 16,
    pi: 'Peng Zhang',
    fos: 'Computational Mathematics',
    inst: 'SUNY at Stony Brook',
    abstract: 'Modeling of flow-induced platelet-mediated thrombogenesis is a life-saving computing. Cardiovascular diseases remain the leading cause of deaths, according for ~35% of all deaths in US annually. Implantable blood recirculating devices, providing life saving solutions for patients with severe cardiovascular diseases, are burdened with thrombosis. The device thrombogenicity is induced by the pathological flows and it is potentiated by chronically activating platelets. However, limitations in charactering the mechanical stimuli and the platelet responses to them still hamper human ability to successfully model such intricate phenomena. The flows and stresses are represented to the &#956;m level while the molecular effects of platelet activation and adhesion are on the nm level. The coupling of the disparate spatiotemporal scales between molecular dynamics and macroscopic transport represents a compelling computational challenger, which requires a multidisciplinary multiscale modeling approach. More importantly, parallel computing facitilies are the only computational feasible solution to such complex multiscale models.' },
  { projectCode: 'commenting',
    cores: 16,
    pi: 'Natalie Stroud',
    fos: 'Political Science',
    inst: 'College of Communication',
    abstract: 'We are using the program R to analyze data from comment sections on a popular news website.  We are analyzing what predicts commenting behavior and how commenters react to the behaviors of others.' },
  { projectCode: 'TG-DMR130087',
    cores: 16,
    pi: 'Surya R Kalidindi',
    fos: 'Materials Research (DMR)',
    inst: 'Georgia Institute of Technology',
    abstract: 'n/a' },
  { projectCode: 'TG-SES140010',
    cores: 32,
    pi: 'Dov Cohen',
    fos: 'Law and Social Sciences',
    inst: 'University of Illinois',
    abstract: 'The prevalent way of analyzing culture is in terms of cultural dimensions considered in isolation from each other.  However, an emerging approach to culture examines the way various aspects of culture are interdependent and connected in meaningful ways, unified by an underlying cultural logic.  One way of examining these connections involves empirically constructing cultural models.  Different cultures may have different models and even when they share models, these models may be prevalent to different degrees within the respective populations.  Constructing such models is computationally intensive, particular when there are many variables, many cases, and many cultures -- as is true for the dataset we intend to work with (the GLOBE dataset that has 17,300 managers from 951 organizations in 62 different countries who were asked about 120 different attitude items). After generating these models, we then hope to show that the "models" approach predicts important outcomes (say, creativity, corruption, democracy, and so on) better than the "dimensions" approach does.\n\nThe models will be constructed using the statistical package R.  Basically, similarity matrices have to be computed between all participants, meaning\nthat we\'ll need to be able to process a matrix that is 17300 X 17300.  \nWe\'ve tried working with much smaller matrices on a desktop and it took 5 days to process a 400 X 400 matrix (that is, a matrix with 400 participants).\nAdditionally, if we want to compute similarity matrices within country, this would mean processing matrices that are approximately 300 X 300 for 62 different countries.\n\nAs an aside, I am not very knowledge about which supercomputer machines are best for which purposes.  If there\'s another computer besides Stampede that\nyou recommend, please feel free to let me know.' },
  { projectCode: 'Conformational-dynam',
    cores: 64,
    pi: 'zhenlong li',
    fos: 'Biophysics',
    inst: 'University of Texas Health Science Center at Houston',
    abstract: 'GPI-anchored folate receptors (FRs) are over-expressed in numerous human malignancies and have been widely exploited for targeted drug delivery. Multiple folate-conjugated small molecular drugs are currently in human clinical trials. A variety of FR-targeted drug nanocarriers have been tested for both therapeutic and diagnostic applications. However, most nanocarriers suffer from poor tissue selectivity and tumor permeability. To overcome these obstacles, it is vital to accurately characterize the molecular interactions between nanocarriers and FR-positive cells. In this proposal, I will develop and validate a multiscale computational platform that can be used to quantify FR-mediated nanocarrier-cell interactions and to optimize nanocarrier structural parameters.\nIn the first stage of this research, I will use all-atom molecular dynamics simulations to study the conformational dynamics and ligand interactions of two Folate receptor isoforms.\nWe will use NAMD and CHARMM force field. Request of allocation for this exciting new project is based on our lab\'s extensive experience on another protein (Ras) of similar size. Each simulation system contain ~50,000 atoms (water, protein, ligands and ions), and needs to be sampled to up to microsecond time scale. It is estimated that a total of 1,00,000 SUs is required for this stage.' },
  { projectCode: 'A-ccsc',
    cores: 16,
    pi: 'Bill Barth',
    fos: 'Advanced Scientific Computing (ASC)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'TACC Research  and Consulting Support.  This project is to be used by TACC consultants in the day-to-day operations of supporting external users.' },
  { projectCode: 'TG-CDA090008',
    cores: 48,
    pi: 'Xiao Zhu',
    fos: 'Cross-Disciplinary Activities (CDA)',
    inst: 'Purdue University',
    abstract: 'This allocation will be used by the Campus Champion to help researchers on the Purdue campus understand how to use TeraGrid resources.' },
  { projectCode: 'Membrane-Ras',
    cores: 96,
    pi: 'Priyanka P Srivastava',
    fos: 'Chemistry (CHE)',
    inst: 'University of Texas Health Science Center at Houston',
    abstract: 'The lipid-modified Ras proteins are key regulators of diverse signaling pathways which act as molecular switches by cycling between active and inactive forms. Ras mutations are found in ~15% of all human tumors. Three human isoforms H-, N- and K-ras are known that share a high degree of similarity (~90% sequence identity) yet exhibit differential signaling properties and role in tumor formation. Membrane binding is essential for Ras biological function and the differential membrane-localization may explain the functional diversity among Ras isoforms. Experimental and simulation studies have shown that the isoform specific differences in membrane-binding are governed by the C-terminal helix of Ras which in turn is linked to the anchor region directly interacting with the membrane. Thus, in order to explore the differential membrane-localization of Ras isoforms we will perform an extensive all-atom molecular dynamics simulation of the full-length Ras proteins containing suitable lipid modification in the presence of membrane bilayers. The conformers obtained from the MD simulations and our in-house programs will be used to design isoform selective Ras inhibitors.' },
  { projectCode: 'AdminStampede',
    cores: 528,
    pi: 'Bill Barth',
    fos: 'OTHER (TRA)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'Administrative project for Stampede.' },
  { projectCode: '3DMinibasin',
    cores: 16,
    pi: 'Naiara Fernandez Terrones',
    fos: 'GEOSCIENCES (GEO)',
    inst: 'Bureau of Economic Geology',
    abstract: 'Salt-withdrawal minibasins (or minibasins) are small sedimentary basins filled with synkinematic sediments that have subsided into a larger salt body. Minibasins are common in many salt provinces, such as the Gulf of Mexico, where they contain important hydrocarbon resources. Because density of uncompacted synkinematic sediments is smaller than density of the underlying salt, density-driven minibasin subsidence is not expected to happen until the sediments have attained an average density higher than density of the salt, which may happen with 1500-300 meter sediment thickness. However, observations show that minibasins started subsiding with sediment thicknesses thinner than predicted and therefore several alternative mechanisms or triggers have been proposed to explain minibasin initiation (see Hudec et al. 2009).    \nIn this project, our aim is to use numerical modelling to understand minibasin formation and propagation by performing several 3D forward simulations. For this purpose the 3D parallel finite differences code LaMEM (Lithosphere and Mantle Evolution Model, Kaus et al., 2012) will be used. LaMEM solves the equations for the incompressible, stationary Stokes equations, is written in C and uses components from the PETSc library.\n\nHudec, M.R., Jackson, M.P.A., and Schultz-Ela, D.D., 2009, The paradox of minibasin subsidence into salt: Clues to the evolution of crustal basins: Geological Society of America Bulletin, v. 121, p. 201-221.\n\nKaus, B. J. P., A. Popov, and D. A. May (2012), Recent Progress in modelling 3D lithospheric deformation, paper presented at EGU Spring meeting, Vienna.' },
  { projectCode: 'TG-AST140015',
    cores: 16,
    pi: 'Peera Pongkitiwanichakul',
    fos: 'Stellar Astronomy and Astrophysics',
    inst: 'University of Chicago',
    abstract: 'We propose a series of high-resolution numerical simulations that are aimed at clarifying the mechanisms that lead to heating of stellar coronae. We plan a detailed study of an idealized model that captures many of the essential physical ingredients of the coronal heating problem. The model consists of an initially uniform magnetic field that is slowly deformed by a prescribed flow. The response of the system is to re-adjust the magnetic configuration by a series of reconnection events that lead to the heating of the plasma. Our main goal is to develop a systematic description of the statistical properties of the reconnection events and of the geometrical properties of the associated dissipative structures. These simulations will provide crucial informations for developing a comprehensive phenomenological model of coronal heating. ' },
  { projectCode: 'Raytheon-WRF',
    cores: 16,
    pi: 'Melyssa Fratkin',
    fos: 'Atmospheric Sciences (ATM)',
    inst: 'Texas Advanced Computing Center',
    abstract: 'Large-scale WRF project, supported by Raytheon.' },
  { projectCode: 'TG-MCB140081',
    cores: 512,
    pi: 'Jeff Wereszczynski',
    fos: 'Biophysics',
    inst: 'Illinois Institute of Technology',
    abstract: 'n/a' },
  { projectCode: 'TG-MCB140215',
    cores: 32,
    pi: 'David Cowburn',
    fos: 'Biophysics',
    inst: 'Albert Einstein College of Medicine',
    abstract: 'n/a' },
  { projectCode: 'Lipolymer',
    cores: 96,
    pi: 'zhenlong li',
    fos: 'Biophysics',
    inst: 'University of Texas Health Science Center at Houston',
    abstract: 'Our previous project on DPD simulation of Ras-vesicle systems has concluded and proved that DPD is very efficient for vesicle studies. This request is for further study of lipid vesicle formation in presence of polymeric chains using DPD simulations. We aim at a fundamental understanding of lipid/polymer self-assembly. Estimation of required SUs is based on previous study on the Ras-vesicle systems. It is expected that longer simulations are required due to the slow relaxation of polymeric chains.' },
  { projectCode: 'A-ices9',
    cores: 48,
    pi: 'Ron Elber',
    fos: 'Biophysics',
    inst: 'Department of Chemistry and Biochemistry',
    abstract: 'We are developing theory and algorithms to extend the time scale of simulations in molecular biophysics' },
  { projectCode: 'TG-DMR050013N',
    cores: 16,
    pi: 'Axel Vandewalle',
    fos: 'Materials Research (DMR)',
    inst: 'Brown University',
    abstract: 'Although most of the projects supported by this allocation are progressing as expected, two of the five sub-projects turned out to require unexpectedly larger computational resources.\n\n(1) The calculation of the equation of state (EOS) of Ta and Fe at high pressures and temperatures via ab initio molecular dynamics and lattice dynamics simulations are more demanding than expected for two reasons:\na) at the higher end of the pressure range of interest, we realized that we needed to explicitly model some of the electrons that would have been safely treated as part of a "frozen core" at lower pressures. This involves larger basis sets and correspondingly larger resources.\nb) we observed an apparent electronic transition in Ta at high pressure, which turned out to be artifact that disappeared after increasing the k-point mesh.\nThese two issues roughly lead to a factor 6 increase in computational requirements (relative to the estimates of our original proposal) and affect roughly 50 high-pressure data points (out of the original 200). Our additional requirements are therefore:\n6 x 1500 SU/point  50 points = 450 000 SU.\n\n2) As we were carrying out the computational characterization of the phase diagram of Zn-Sb-based thermoelectrics, new experimental evidence became available that indicated the potential presence of a new compound in the phase diagram that needs to be investigated. Unfortunately, this new compound turns out to have an extremely low symmetry (only inversion symmetry is present!). As a result, each structural energy calculation (to explore various point defect structures that contribute the non-negligible configurational free energy of the compound) requires about 4 times more resources to complete and we need about twice as many of them. Our additional requirements are therefore:\n(2 x 300 structures)  (4 x 100 SU/structure) = 240 000 SU\n\nIn summary, we would need an additional 690 000 SU.\n' },
  { projectCode: 'TG-CHE110065',
    cores: 80,
    pi: 'Carol Hall',
    fos: 'Physical Chemistry',
    inst: 'North Carolina State University at Raleigh',
    abstract: 'We apply for an account on TeraGrid to access PSC/Pople, NICS/Kraken and TACC/Ranger for the purpose of developing and testing a strategy based on computational simulation to design a peptide sequence that could serve as a drug which interferes with the replication of HIV. Molecular dynamics, Monte Carlo, quantum mechanics-based and eventually coarse-grained simulations will be performed to discover short peptides that bind with high affinity and specificity to the anticodon stem and loop (ASL) of a key fragment of transfer RNA, tRNALys3. To achieve the ultimate goal, several hundred-thousand CPU hours will be required. We will develop new force field parameters for the unnatural modifications on the transfer RNA, explore the structure-forming mechanism and stability issues for the peptide/RNA complex and optimize the search algorithm for peptide design. Finally, our simulation results will be directly compared to experimental work by our collaborator for further verification and then used to inform the next steps in the computational project.' } ]